[
    {
        "movielens_id": "11",
        "imdb_id": "0114369",
        "title": "Se7en",
        "plot": "Two detectives, a rookie and a veteran, hunt a serial killer who uses the seven deadly sins as his motives.",
        "genres": "Crime, Drama, Mystery, Thriller",
        "year": "1995",
        "rating": "8.6",
        "directors": "David Fincher",
        "cast": "Morgan Freeman, Andrew Kevin Walker, Daniel Zacapa, Brad Pitt, Gwyneth Paltrow, John Cassini, Bob Mack, Peter Crombie, Reg E. Cathey, R. Lee Ermey, George Christy, Endre Hules, Hawthorne James, William Davidson, Bob Collins, Jimmy Dale Hartsell, Richard Roundtree, Charline Su, Dominique Jennings, Allan Kolman, Beverly Burke, Gene Borkan, Julie Araskog, Mario Di Donato, Alfonso Freeman, John C. McGinley, Harrison White, Bob Stephenson, Michael Reid MacKay, Kevin Spacey, Richard Portnow, Tudor Sherrard, Mark Boone Junior, Pamala Tyson, Lennie Loftin, Sarah Reinhardt, Emily Wagner, Martin Serene, Michael Massee, David Correia, Ron Blair, Jennifer Mueller, Leland Orser, Lexie Bigham, Evan Mirand, Paul Eckstein, Harris Savides, Rachel Flanagan, Heidi Schanz, Brian Evers, Shannon Wilcox, Richard Schiff, James Deeth, John Santin, Charles A. Tamburro, Richmond Arquette, Duffy Gaver, Charles S. Dutton, Gregory Fennell, Rick Lyon, Arthur Max",
        "dbpedia_uri": "http://dbpedia.org/resource/Seven_(film)",
        "dbpedia_label": "Seven (film)"
    },
    {
        "movielens_id": "33",
        "imdb_id": "0112851",
        "title": "Desperado",
        "plot": "Former musician and gunslinger El Mariachi arrives at a small Mexican border town after being away for a long time. His past quickly catches up with him and he soon gets entangled with the local drug kingpin Bucho and his gang.",
        "genres": "Action, Crime, Thriller",
        "year": "1995",
        "rating": "7.2",
        "directors": "Robert Rodriguez",
        "cast": "Antonio Banderas, Salma Hayek, Joaquim de Almeida, Cheech Marin, Steve Buscemi, Carlos Gómez, Quentin Tarantino, Tito Larriva, Angel Aviles, Danny Trejo, Abraham Verduzco, Carlos Gallardo, Albert Michel Jr., David Alvarado, Angela Lanza, Mike Moroff, Robert Arevalo, Gerardo Moscoso, Peter Marquardt, Consuelo Gómez, Jaime de Hoyos, Cristos, Richie Gaona, Mark Dalton, Tommy Nix, Patricia Vonne, Elizabeth Rodriguez, Enrique Iglesias, Reinol Martinez, Diego Sandoval",
        "dbpedia_uri": "http://dbpedia.org/resource/Desperado_(film)",
        "dbpedia_label": "Desperado (film)"
    },
    {
        "movielens_id": "61",
        "imdb_id": "0111507",
        "title": "Three Colors: White",
        "plot": "After his wife divorces him, a Polish immigrant plots to get even with her.",
        "genres": "Comedy, Drama, Romance",
        "year": "1994",
        "rating": "7.6",
        "directors": "Krzysztof Kieslowski",
        "cast": "Zbigniew Zamachowski, Julie Delpy, Janusz Gajos, Jerzy Stuhr, Aleksander Bardini, Grzegorz Warchol, Cezary Harasimowicz, Jerzy Nowak, Jerzy Trela, Cezary Pazura, Michel Lisowski, Philippe Morier-Genoud, Piotr Machalica, Francis Coffinet, Barbara Dziekan, Yannick Evely, Marzena Trybala, Jacques Disses, Teresa Budzisz-Krzyzanowska, Krystyna Bigelmajer, Marianna Grodzka-Marciano, Maria Robaszkiewicz, Jerzy Dominik, Jan Mayzel, Zdzislaw Rychter, Jakub Grzegorek, J. Modet, Bozena Szymanska, Malgorzata Kaczmarska, Liliana Okowity-Brosset, Bartlomiej Topa, Aleksander Kalinowski, Adam Paplinski, Wanda Wróblewska, Stan Latek, Wojciech Paszkowski, M. Verner, Joanna Ladynska, Malgorzata Prazmowska, Piotr Zelt, Juliette Binoche, Florence Pernel, Andrzej Precigs",
        "dbpedia_uri": "http://dbpedia.org/resource/Three_Colors:_White",
        "dbpedia_label": "Three Colors: White"
    },
    {
        "movielens_id": "189",
        "imdb_id": "0104361",
        "title": "A Grand Day Out",
        "plot": "Wallace takes a break from trying to decide on a holiday destination only to find he has no cheese for his crackers. The solution to both problems is a trip to the moon, with dog Gromit, because everybody knows the moon's made of cheese.",
        "genres": "Animation, Short, Adventure, Comedy, Family, Sci-Fi",
        "year": "1989",
        "rating": "7.8",
        "directors": "Nick Park",
        "cast": "Peter Sallis, Peter Hawkins",
        "dbpedia_uri": "http://dbpedia.org/resource/A_Grand_Day_Out",
        "dbpedia_label": "A Grand Day Out"
    },
    {
        "movielens_id": "208",
        "imdb_id": "0072431",
        "title": "Young Frankenstein",
        "plot": "An American grandson of the infamous scientist, struggling to prove that his grandfather was not as insane as people believe, is invited to Transylvania, where he discovers the process that reanimates a dead body.",
        "genres": "Comedy",
        "year": "1974",
        "rating": "8.0",
        "directors": "Mel Brooks",
        "cast": "Gene Wilder, Peter Boyle, Marty Feldman, Madeline Kahn, Cloris Leachman, Teri Garr, Kenneth Mars, Richard Haydn, Liam Dunn, Danny Goldman, Oscar Beregi Jr., Arthur Malet, Richard A. Roth, Monte Landis, Rusty Blitz, Anne Beesley, Gene Hackman, John Madison, John Dennis, Rick Norman, Rolfe Sedan, Terence Pushman, Randolph Dobbs, Norbert Schiller, Pat O'Hara, Michael Fox, Lidia Kristen, Ian Abercrombie, Leon Askin, Benjie Bancroft, Mel Brooks, Robert Cole, Lou Cutell, Peter Paul Eastman, Sig Frohlich, Michael J. Grayson, Peter Halton, Bob Harks, Lars Hensen, George Holmes, Kathryn Janssen, Michael Jeffers, Dale Johnson, Berry Kroeger, Ethelreda Leopold, Bob Liddle, John Marlin, Jeff Maxwell, John Hugh McKnight, Ernesto Molinari, Monty O'Grady, Tony Regan, Leoda Richards, Clark Ross, Paul Russell, Maida Severn, Norman Stevans, Arthur Tovey, Clement von Franckenstein, Max Wagner",
        "dbpedia_uri": "http://dbpedia.org/resource/Young_Frankenstein",
        "dbpedia_label": "Young Frankenstein"
    },
    {
        "movielens_id": "288",
        "imdb_id": "0117571",
        "title": "Scream",
        "plot": "A year after the murder of her mother, a teenage girl is terrorized by a new killer, who targets the girl and her friends by using horror films as part of a deadly game.",
        "genres": "Horror, Mystery",
        "year": "1996",
        "rating": "7.3",
        "directors": "Wes Craven",
        "cast": "Drew Barrymore, Roger Jackson, Kevin Patrick Walls, David Booth, Carla Hatley, Neve Campbell, Skeet Ulrich, Lawrence Hecht, Courteney Cox, W. Earl Brown, Rose McGowan, Lois Saunders, David Arquette, Joseph Whipp, Matthew Lillard, Jamie Kennedy, Lisa Beach, Tony Kilbert, C.W. Morgan, Frances Lee McCain, Liev Schreiber, Troy Bishop, Ryan Kennedy, Leonora Scelfo, Nancy Anne Ridder, Lisa Canning, Bonnie Wood, Aurora Draper, Kenny Kwong, Justin Sullivan, Kurtis Bedford, Angela Miller, Linda Blair, Cabran E. Chamberlain, Andrew Christiansen, Wes Craven, Matt McDonald, Lynn McRee, Carter Raff, Freddy W. Smith, Henry Winkler",
        "dbpedia_uri": "http://dbpedia.org/resource/Scream_(1996_film)",
        "dbpedia_label": "Scream (1996 film)"
    }
]