[{"movielens_id": "2", "imdb_id": "0113189", "title": "GoldenEye", "plot": "Years after a friend and fellow 00 agent is killed on a joint mission, a secret space based weapons program known as \"_GoldenEye_ (qv)\" is stolen. James Bond sets out to stop a Russian crime syndicate from using the weapon.", "genres": "Action, Adventure, Thriller", "year": "1995", "rating": "7.2", "directors": "Martin Campbell", "cast": "Pierce Brosnan, Sean Bean, Izabella Scorupco, Famke Janssen, Joe Don Baker, Judi Dench, Robbie Coltrane, Tchéky Karyo, Gottfried John, Alan Cumming, Desmond Llewelyn, Samantha Bond, Michael Kitchen, Serena Gordon, Simon Kunz, Pavel Douglas, Olivier Lajous, Billy J. Mitchell, Constantine Gregory, Minnie Driver, Michelle Arthur, Ravil Isyanov, Vladimir Milanovich, Trevor Byfield, Peter Majer, Paul Bannon, Simone Bechtel, Martin Campbell, Mark Chapman, Kenneth Coombs, Simon Crane, Terrance Denville, Ian Durrant, Max Faulkner, Juliet Forester, Stefan Kopiecki, Jo Anna Lee, Derek Lyons, Wayne Michaels, Bhasker Patel, Paul Sacks, Michael G. Wilson", "dbpedia_uri": "http://dbpedia.org/resource/GoldenEye", "dbpedia_label": "GoldenEye"}, {"movielens_id": "7", "imdb_id": "0114746", "title": "12 Monkeys", "plot": "In a future world devastated by disease, a convict is sent back in time to gather information about the man-made virus that wiped out most of the human population on the planet.", "genres": "Mystery, Sci-Fi, Thriller", "year": "1995", "rating": "8.0", "directors": "Terry Gilliam", "cast": "Joseph Melito, Bruce Willis, Jon Seda, Michael Chance, Vernon Campbell, H. Michael Walls, Bob Adrian, Simon Jones, Carol Florence, Bill Raymond, Ernest Abuba, Irma St. Paule, Madeleine Stowe, Joey Perillo, Bruce Kirkpatrick, Wilfred Williams, Rozwill Young, Brad Pitt, Nell Johnson, Frederick Strother, Rick Warner, Frank Gorshin, Anthony 'Chip' Brienza, Joilet Harris, Drucie McDaniel, John Blaisse, Louis Lippa, Stan Kang, Pat Dias, Aaron Michael Lacey, David Morse, Charles Techman, Jann Ellis, Johnnie Hobbs Jr., Janet Zappala, Thomas Roy, Harry O'Toole, Korchenko, Chuck Jeffreys, LisaGay Hamilton, Felix Pire, Matt Ross, Barry Price, John Panzarella, Christopher Plummer, Larry Daly, Arthur Fennell, Karl Warren, Christopher Meloni, Paul Meshejian, Robert O'Neill, Kevin Thigpen, Lee Golden, Joseph McKenna, Jeff Tanner, Faith Potts, Michael Ryan Segal, Annie Golden, Lisa Talerico, Stephen Bridgewater, Ray Huffman, Jodi Dawson, Jack Dougherty, Lenny Daniels, Herbert C. Hauls Jr., Charley Scalies, Carolyn Walker, Tiffany Baldwin, Bart the Bear, Al Brown, C.J. Byrnes, Phillip V. Caruso, Tom Detrik, Donald Faison, Kelly Farnan, Joe Gerety, Laura Glas, Robert Gleason, John Hagy, Adam Hatley, Bonnie Loev, Julie Mabry, Raymond Mamrak, Sal Mazzotta, Roger Pratt, Allelon Ruggiero, Renee Spei, Richard Stanley, Thang, Susan Wool-Rush", "dbpedia_uri": "http://dbpedia.org/resource/12_Monkeys", "dbpedia_label": "12 Monkeys"}, {"movielens_id": "8", "imdb_id": "0112431", "title": "Babe", "plot": "_Babe_ (qv), a pig raised by sheepdogs, learns to herd sheep with a little help from Farmer Hoggett.", "genres": "Comedy, Drama, Family", "year": "1995", "rating": "6.8", "directors": "Chris Noonan", "cast": "Christine Cavanaugh, Miriam Margolyes, Danny Mann, Hugo Weaving, Miriam Flynn, Russi Taylor, Evelyn Krape, Michael Edward-Stevens, Charles Bartlett, Paul Livingston, Roscoe Lee Browne, James Cromwell, Magda Szubanski, Zoe Burton, Paul Goddard, Wade Hayward, Brittany Byrnes, Mary Acres, Janet Foye, Pamela Hawken, Karen Gough, David Webb, Marshall Napier, Hec Macmillan, Ken Gregory, Nicholas Lidstone, Trevor Read, Nicholas Blake, Matthew Long, John Doyle, Mike Harris, Ross Bagley, Gemini Barnett, Rachel Davey, Debi Derryberry, Jazz Raycole, Courtland Mead, Kevin Jamal Woods, Jane Alden, Kimberly Bailey, Patrika Darbo, Michelle Davison, Julie Forsyth, Maeve Germaine, Rosanna Huffman, Carlyle King, Tina Lifford, Gennie Nevinson, Mary Linda Phillips, Paige Pollack, Kerry Walker, Barbara Harris, Jacqueline Brennan, Doug Burch, John Erwin, Doris Grau, Tony Hughes, Linda Janssen, Daamen J. Krall, Charlie MacLean, Justin Monjo, Antonia Murphy, Helen O'Connor, Neil Ross, Scott Vernon, Kay E. Kuter, Karl Lewis Miller", "dbpedia_uri": "http://dbpedia.org/resource/Babe_(film)", "dbpedia_label": "Babe (film)"}, {"movielens_id": "9", "imdb_id": "0112818", "title": "Dead Man Walking", "plot": "A nun, while comforting a convicted killer on death row, empathizes with both the killer and his victim's families.", "genres": "Crime, Drama", "year": "1995", "rating": "7.5", "directors": "Tim Robbins", "cast": "Susan Sarandon, Sean Penn, Robert Prosky, Raymond J. Barry, R. Lee Ermey, Celia Weston, Lois Smith, Scott Wilson, Roberta Maxwell, Margo Martindale, Barton Heyman, Steve Boles, Nesbitt Blaisdell, Ray Aranha, Larry Pine, Gil Robbins, Kevin Cooney, Clancy Brown, Adele Robbins, Michael Cullen, Peter Sarsgaard, Missy Yager, Jenny Krochmal, Jack Black, Jon Abrahams, Arthur Bridgers, Steve Carlisle, Helen Hester, Eva Amurri Martino, Jack Henry Robbins, Gary 'Buddy' Boe, Amy Long, Dennis Neal, Molly Bryant, Pamela Garmon, Adrian Colon, John D. Wilmot, Margaret Lane, Sally Ann Roberts, Alec Gifford, John Hurlbutt, Mike Longman, Pete Burris, Joan Glover, Florrie Hathorn, Lenore Banks, Idella Cassamier, Marlon Horton, Kenitra Singleton, Palmer Jackson, Johnathan Thomas, Walter Breaux Jr., Scott Sowers, Cortez Nance Jr., Adam Nelson, Dalvin Ford, Derek Steeley, Jeremy Knaster, Mary Robbins, Miles Robbins, Marcus Lyle Brown, Joanna Doherty, Anthony Michael Frederick, Thomas McGowan, Rawleigh Moreland, Helen Prejean, Codie Scott", "dbpedia_uri": "http://dbpedia.org/resource/Dead_Man_Walking_(film)", "dbpedia_label": "Dead Man Walking (film)"}, {"movielens_id": "12", "imdb_id": "0114814", "title": "The Usual Suspects", "plot": "A sole survivor tells of the twisty events leading up to a horrific gun battle on a boat, which began when five criminals met at a seemingly random police lineup.", "genres": "Crime, Mystery, Thriller", "year": "1995", "rating": "8.5", "directors": "Bryan Singer", "cast": "Stephen Baldwin, Gabriel Byrne, Benicio Del Toro, Kevin Pollak, Kevin Spacey, Chazz Palminteri, Pete Postlethwaite, Suzy Amis, Giancarlo Esposito, Dan Hedaya, Paul Bartel, Carl Bressler, Phillipe Simon, Jack Shearer, Christine Estabrook, Clark Gregg, Morgan Hunter, Ken Daly, Michelle Clunie, Louis Lombardi, Frank Medrano, Ron Gilbert, Vito D'Ambrosio, Gene Lythgow, Bob Elmore, David Powledge, Bob Pennetta, Billy Bates, Smadar Hanson, Castulo Guerra, Peter Rocca, Bert Williams, Jaime H. Campos, John Gillespie, Johnathan Gorman, Peter Greene, Michael McKay, Christopher McQuarrie, Ralph Moratz, Scott B. Morgan, Mike Nyman, Grace Sinden", "dbpedia_uri": "http://dbpedia.org/resource/The_Usual_Suspects", "dbpedia_label": "The Usual Suspects"}, {"movielens_id": "14", "imdb_id": "0110877", "title": "The Postman", "plot": "A simple Italian postman learns to love poetry while delivering mail to a famous poet, and then uses this to woo local beauty Beatrice.", "genres": "Biography, Comedy, Drama, Romance", "year": "1994", "rating": "7.7", "directors": "Michael Radford, Massimo Troisi", "cast": "Philippe Noiret, Massimo Troisi, Maria Grazia Cucinotta, Renato Scarpa, Linda Moretti, Sergio Solli, Carlo Di Maio, Nando Neri, Vincenzo Di Sauro, Orazio Stracuzzi, Alfredo Cozzolino, Mariano Rigillo, Anna Bonaiuto, Simona Caparrini, Chuck Riley, Michael J. Tomaso", "dbpedia_uri": "http://dbpedia.org/resource/Il_Postino:_The_Postman", "dbpedia_label": "Il Postino: The Postman"}, {"movielens_id": "17", "imdb_id": "0116367", "title": "From Dusk Till Dawn", "plot": "Two criminals and their hostages unknowingly seek temporary refuge in a truck stop populated by vampires, with chaotic results.", "genres": "Action, Crime, Horror", "year": "1996", "rating": "7.2", "directors": "Robert Rodriguez", "cast": "George Clooney, Quentin Tarantino, Harvey Keitel, Juliette Lewis, Ernest Liu, Salma Hayek, Cheech Marin, Danny Trejo, Tom Savini, Fred Williamson, Michael Parks, Brenda Hillhouse, John Saxon, Marc Lawrence, Kelly Preston, John Hawkes, Tito Larriva, Peter Atanasoff, Johnny 'Vatos' Hernandez, Aimee Graham, Heidi McNeal, Ernest M. Garcia, Greg Nicotero, Cristos, Mike Moroff, Michelle Berube-Schneider, Neena Bidasha, Veena Bidasha, Ungela Brockman, Madison Clark, María Díaz, Rosalia Hayakawa, Janine Jordae, Jacque Lawson, Houston Leigh, Janie Liszewski, Tia Texada, John Paul Fedele, Michael McKay, Jake McKinnon, Josh Patton, Walter Phelan, Wayne Toth, Henrik von Ryzin, Howard Berger, Amy Minda Cohen, Cecilia Montiel, Lyle Trachtenberg, Danny the Wonder Pony, Lawrence Bender, Carlo Corazon, Annette Harper, Victoria Lucai, Jody Millard, John Ponzio, Robert Rodriguez, D. Danny Warhol", "dbpedia_uri": "http://dbpedia.org/resource/From_Dusk_till_Dawn", "dbpedia_label": "From Dusk till Dawn"}, {"movielens_id": "24", "imdb_id": "0113326", "title": "Rumble in the Bronx", "plot": "A young man visiting and helping his uncle in New York City finds himself forced to fight a street gang and the mob with his martial art skills.", "genres": "Action, Comedy, Crime, Thriller", "year": "1995", "rating": "6.8", "directors": "Stanley Tong", "cast": "Jackie Chan, Anita Mui, Françoise Yip, Bill Tung, Marc Akerstream, Garvin Cross, Morgan Lam, Ailen Sit, Man-Ching Chan, Fred Andrucci, Mark Antoniuk, Lauro David Chartrand-DelValle, Chris Franco, Lance Gibson, David Hooper, Kathy Hubble, Terrance Leigh, Dean McKenzie, Kimani Ray Smith, Lisa Stevens, Kris Lord, Richard Faraci, Mark Fielding, Terry Howson, Jordan Lennox, Gabriel Ostevic, John Sampson, Owen Walstrom, Carrie Cain-Sparks, Guyle Fraizer, David Fredericks, Harold Gillespie, Alf Humphreys, Elly Leung, Ho-Wai Ching, Jamie Luk, Richard O'Sullivan, Alecia Paget, John McGrath, Adrian Parkinson, Rick Burgess, Eddy Ko, On-Na Lui, Emil Chau, Alex To, Glen Chin, Victor Formosa, Harley Martin, James McKenzie, Lee Sollenberger", "dbpedia_uri": "http://dbpedia.org/resource/Rumble_in_the_Bronx", "dbpedia_label": "Rumble in the Bronx"}, {"movielens_id": "29", "imdb_id": "0112462", "title": "Batman Forever", "plot": "Batman must battle former district attorney Harvey Dent, who is now Two-Face and Edward Nygma, The Riddler with help from an amorous psychologist and a young circus acrobat who becomes his sidekick, Robin.", "genres": "Action, Adventure", "year": "1995", "rating": "5.4", "directors": "Joel Schumacher", "cast": "Val Kilmer, Tommy Lee Jones, Jim Carrey, Nicole Kidman, Chris O'Donnell, Michael Gough, Pat Hingle, Drew Barrymore, Debi Mazar, Elizabeth Sanders, Rene Auberjonois, Joe Grifasi, Philip Moon, Jessica Tuck, Dennis Paladino, Kimberly Scott, Michael Paul Chan, Jon Favreau, Greg Lauren, Ramsey Ellis, Michael Scranton, Eileen Seeley, David U. Hodges, Jack Betts, Tim Jackson, Daniel Reichert, Glory Fioramonti, Larry A. Lee, Bruce Roberts, George Wallace, Bob Zmuda, Rebecca Budig, Don Wilson, Sydney D. Minckler, Maxine Jones, Terry Ellis, Cindy Herron, Dawn Robinson, Gary Kasper, Amanda Trees, Andrea Fletcher, Ria Coyne, Jed Curtis, William Mesnik, Marga Gómez, Kelly Vaughn, John Fink, Noby Arden, Marlene Bologna, Danny Castle, Troy S. Wolfe, Christopher Caso, Gary Clayton, Oscar Dillon, Keith Graham, Kevin Grevioux, Mark Hicks, Corey Jordan, Randy Lamb, Maurice Lamont, Sidney S. Liufau, Brad Martin, Deron McBee, Mario Mugavero, Joey Nelson, Jim Palmer, Robert Powell, Peewee Piemonte, Peter Radon, François Rodrigue, Joe Sabatino, Mike Sabatino, Ofer Samra, Matt Sigloch, Mike Smith, Ed Begley Jr., George Cheung, Scott Cranford, Michael Dane, Jenny Inge Devaney, Katrina Fisher, Nancy Gassner-Clayton, Timothy Guest, Joe Kent, Anthony Kopczynski, Patrick Leahy, Marshall Dancing Elk Lucas, Velvet Rhodes, Nikky Smedley, Dana Walsh", "dbpedia_uri": "http://dbpedia.org/resource/Batman_Forever", "dbpedia_label": "Batman Forever"}, {"movielens_id": "31", "imdb_id": "0112740", "title": "Crimson Tide", "plot": "On a U.S. nuclear missile sub, a young First Officer stages a mutiny to prevent his trigger happy Captain from launching his missiles before confirming his orders to do so.", "genres": "Action, Drama, Thriller, War", "year": "1995", "rating": "7.3", "directors": "Tony Scott", "cast": "Denzel Washington, Gene Hackman, Matt Craven, George Dzundza, Viggo Mortensen, James Gandolfini, Rocky Carroll, Jaime Gomez, Michael Milhoan, Scott Burkholder, Danny Nucci, Lillo Brancato, Eric Bruskotter, Ricky Schroder, Steve Zahn, Marcello Thedford, R.J. Knoll, Billy Devlin, Matthew Barry, Christopher Birt, Jim Boyce, Jacob Vargas, Kai Lennox, Michael D. Weatherred, Tommy Bush, Earl Billings, Mark Christopher Lawrence, Michael Chieffo, Ashley Smock, James Lesure, Trevor St. John, Dennis Garber, Vanessa Bell Calloway, Brenden Jefferson, Ashley Calloway, Daniel von Bargen, Richard Valeriani, Warren Olney, Rad Daly, Sean O'Bryan, Victor Togunde, Troy A. Cephers, Armand Watson, Brent Goldberg, Scott Grimes, Ryan Phillippe, Dale Andre Lee Everett, Angela C. Tortu, Ronald Ramessar, Robin Faraday, Bob Stone, Henry Mortensen, Chris Ellis, Skip Beard, Lennox Brown, John Daniels, Gerald Emerick, Mo Gallini, Steve Gonzales, Annette Goodman, Marianne Hettinger, Jason Robards, Lars Woods", "dbpedia_uri": "http://dbpedia.org/resource/Crimson_Tide_(film)", "dbpedia_label": "Crimson Tide (film)"}, {"movielens_id": "42", "imdb_id": "0109445", "title": "Clerks", "plot": "A day in the lives of two convenience clerks named Dante and Randal as they annoy customers, discuss movies, and play hockey on the store roof.", "genres": "Comedy", "year": "1994", "rating": "7.7", "directors": "Kevin Smith", "cast": "Brian O'Halloran, Jeff Anderson, Marilyn Ghigliotti, Lisa Spoonauer, Jason Mewes, Kevin Smith, Scott Mosier, Scott Schiaffo, Al Berkowitz, Walter Flanagan, Ed Hapstak, Lee Bendick, David Klein, Pattijean Csik, Ken Clark, Donna Jeanne, Virginia Smith, Betsy Broussard, Ernest O'Donnell, Kimberly Loughran, Gary Stern, Joe Bagnole, John Henry Westhead, Chuck Bickel, Leslie Hope, Connie O'Connor, Vincent Pereira, Ashley Pereira, Erix Infante, Melissa Crawford, Thomas Burke, Dan Hapstak, Mitch Cohen, Matthew Banta, Rajiv Thapar, Mike Belicose, Jane Kuritz, Grace Smith, Frances Cresci, Matt Crawford, Sarla Thapar, Brian Drinkwater, Bob Fisler, Derek Jaccodine, Matthew Pereira, Frank Pereira, Carl Roth, Paul Finn, Haiku, Lenin's Tomb", "dbpedia_uri": "http://dbpedia.org/resource/Clerks", "dbpedia_label": "Clerks"}, {"movielens_id": "44", "imdb_id": "0109642", "title": "Dolores Claiborne", "plot": "A big city reporter travels to a small town where her mother has been arrested for the murder of an elderly woman for whom she worked as a housekeeper.", "genres": "Crime, Drama, Mystery, Thriller", "year": "1995", "rating": "7.4", "directors": "Taylor Hackford", "cast": "Kathy Bates, Jennifer Jason Leigh, Judy Parfitt, Christopher Plummer, David Strathairn, Eric Bogosian, John C. Reilly, Ellen Muth, Bob Gunton, Roy Cooper, Wayne Robson, Ruth Marshall, Weldon Allen, Tom Gallant, Kelly Burnett, Matt Appleby, Thomas Skinner, Vernon Steel, Taffara Jessica Stella Murray, Susan Lane, Frank Adamson, Edward Rubin, Sandy MacDonald, Dean Eilertson, Danielle Sarty", "dbpedia_uri": "http://dbpedia.org/resource/Dolores_Claiborne_(film)", "dbpedia_label": "Dolores Claiborne (film)"}, {"movielens_id": "54", "imdb_id": "0114069", "title": "Outbreak", "plot": "Army doctors struggle to find a cure for a deadly virus spreading throughout a California town that was brought to America by an African monkey.", "genres": "Action, Drama, Thriller", "year": "1995", "rating": "6.6", "directors": "Wolfgang Petersen", "cast": "Dustin Hoffman, Rene Russo, Morgan Freeman, Kevin Spacey, Cuba Gooding Jr., Donald Sutherland, Patrick Dempsey, Zakes Mokae, Malick Bowens, Susan Lee Hoffman, Benito Martinez, Bruce Jarchow, Leland Hayward III, Daniel Chodos, Dale Dye, Kara Keough, Gina Menza, Per Didrik Fasmer, Michelle Joyner, Donald Forrest, Julie Pierce, Tim Ransom, Michelle M. Miller, Maury Sterling, Michael Emanuel, Lucas Dudley, Robert Alan Joseph, Joseph Latimore, Michael Sottile, Ed Beechner, Matthew Saks, Diana Bellamy, Lance Kerwin, Brett Oliver, Eric Mungai Nguku, Larry Hine, Nickolas H. Marshall, Douglas Hebron, Jae Woo Lee, Johnny Kim, Billy Stevenson, Kellie Overbey, Dana Andersen, Patricia Place, Nicholas Pappone, Traci Odom, Herbert Jefferson Jr., Thomas Crawford, Buzz Barbee, Jenna Byrne, Brian Reddy, Ina Romeo, Teresa Velarde, Jane Jenkins, Carmela Rappazzo, Kurt Boesen, Jack Rader, Robert Rigamonti, Mimi Doyka, C. Jack Robinson, Robert Alan Beuth, Gordon Michaels, Peter Looney, Conrad Bachmann, Cary J. Pitts, Cynthia Harrison, Marcus Hennessy, Albert Owens, David Silverbrand, Julie Araskog, Frank Rositani, George Christy, Bruce Isacson, Marilyn Brandt, Philip Handy, Tim Frazee, Moses Williams, Roland Tsui, Keith Butler, Davi Lee Phillips, Ralph Miller, Mark Brown, Jim Antonio, Binx, Brad Frost, Ellsworth Hanna, Jeanne Hanna, Bruce Holman, Jack Kyle, Bob Lazar, John Lizzi, Beau Lotterman, David Novak, Ross Turner, J.T. Walsh, David A.R. White, Robert 'Bobby Z' Zajonc", "dbpedia_uri": "http://dbpedia.org/resource/Outbreak_(film)", "dbpedia_label": "Outbreak (film)"}, {"movielens_id": "56", "imdb_id": "0110912", "title": "Pulp Fiction", "plot": "The lives of two mob hitmen, a boxer, a gangster and his wife, and a pair of diner bandits intertwine in four tales of violence and redemption.", "genres": "Crime, Drama", "year": "1994", "rating": "8.9", "directors": "Quentin Tarantino", "cast": "Tim Roth, Amanda Plummer, Laura Lovelace, John Travolta, Samuel L. Jackson, Phil LaMarr, Frank Whaley, Burr Steers, Bruce Willis, Ving Rhames, Paul Calderon, Bronagh Gallagher, Rosanna Arquette, Eric Stoltz, Uma Thurman, Jerome Patrick Hoban, Michael Gilden, Gary Shorelle, Susan Griffiths, Eric Clark, Joseph Pilato, Brad Blumenthal, Steve Buscemi, Lorelei Leslie, Emil Sitka, Brenda Hillhouse, Christopher Walken, Chandler Lindauer, Sy Sher, Robert Ruth, Rich Turner, Angela Jones, Don Blakely, Carl Allen, Maria de Medeiros, Karen Maruyama, Kathy Griffin, Venessia Valentino, Linda Kaye, Duane Whitaker, Peter Greene, Stephen Hibbert, Alexis Arquette, Quentin Tarantino, Harvey Keitel, Julia Sweeney, Lawrence Bender, Cie Allman, Rene Beard, Rhys Kirkman, Pui Fan Lee, Justin Mullins, Lori Pizzo, Glendon Rich, Devan Richardson, Richard Rossi, Ani Sava", "dbpedia_uri": "http://dbpedia.org/resource/Pulp_Fiction", "dbpedia_label": "Pulp Fiction"}, {"movielens_id": "64", "imdb_id": "0111161", "title": "The Shawshank Redemption", "plot": "Two imprisoned men bond over a number of years, finding solace and eventual redemption through acts of common decency.", "genres": "Drama", "year": "1994", "rating": "9.3", "directors": "Frank Darabont", "cast": "Tim Robbins, Morgan Freeman, Bob Gunton, William Sadler, Clancy Brown, Gil Bellows, Mark Rolston, James Whitmore, Jeffrey DeMunn, Larry Brandenburg, Neil Giuntoli, Brian Libby, David Proval, Joseph Ragno, Jude Ciccolella, Paul McCrane, Renee Blaine, Scott Mann, John Horton, Gordon Greene, Alfonso Freeman, V.J. Foster, John E. Summers, Frank Medrano, Mack Miles, Alan R. Kessler, Morgan Lund, Cornell Wallace, Gary Lee Davis, Neil Summers, Ned Bellamy, Joe Pecoraro, Harold E. Cope Jr., Brian Delate, Don McManus, Donald Zinn, Dorothy Silver, Robert Haley, Dana Snyder, John D. Craig, Ken Magee, Eugene C. DePasquale, Bill Bolender, Ron Newell, John R. Woodward, Chuck Brauchler, Dion Anderson, Claire Slemmer, James Kisicki, Rohn Thomas, Charlie Kearns, Rob Reider, Brian Brophy, Paul Kennedy, James Babson, Dennis Baker, Fred Culbertson, Richard Doone, Shane Grove, Rita Hayworth, David Hecht, Alonzo F. Jones, Gary Jones, Sergio Kato, Michael Lightsey, George Macready, Robin J. Meyer, Christopher Page, Neil Riddaway, Brad Spencer, Jodiviah Stepp, Mark A. Strain", "dbpedia_uri": "http://dbpedia.org/resource/The_Shawshank_Redemption", "dbpedia_label": "The Shawshank Redemption"}, {"movielens_id": "66", "imdb_id": "0114924", "title": "While You Were Sleeping", "plot": "A hopelessly romantic Chicago Transit Authority token collector is mistaken for the fiancée of a coma patient.", "genres": "Comedy, Drama, Romance", "year": "1995", "rating": "6.7", "directors": "Jon Turteltaub", "cast": "Sandra Bullock, Bill Pullman, Peter Gallagher, Peter Boyle, Jack Warden, Glynis Johns, Micole Mercurio, Jason Bernard, Michael Rispoli, Ally Walker, Monica Keena, Ruth Rudnick, Marcia Wright, Dick Cusack, Thomas Q. Morris, Bernie Landis, James Krag, Rick Worthy, Marc Grapey, Joel Hatch, Mike Bacarella, Peter Siragusa, Gene Janson, Krista Lally, Kevin Gudahl, Ann Whitney, Margaret Travolta, Shea Farrell, Kate Reinders, Susan Messing, Richard Pickren, Megan Schaiper, Jeffrey C. Hogue, Dobie Maxwell, Robert Minkoff, Robert Osladil", "dbpedia_uri": "http://dbpedia.org/resource/While_You_Were_Sleeping", "dbpedia_label": "While You Were Sleeping"}, {"movielens_id": "67", "imdb_id": "0109040", "title": "Ace Ventura: Pet Detective", "plot": "A goofy detective specializing in animals goes in search of the missing mascot of the Miami Dolphins.", "genres": "Comedy", "year": "1994", "rating": "6.9", "directors": "Tom Shadyac", "cast": "Jim Carrey, Courteney Cox, Sean Young, Tone Loc, Dan Marino, Noble Willingham, Troy Evans, Raynor Scheine, Udo Kier, Frank Adonis, Tiny Ron, David Margulies, John Capodice, Judy Clayton, Bill Zuckert, Alice Drummond, Rebecca Ferratti, Mark Margolis, Antoni Corone, Margo Peace, Randall 'Tex' Cobb, Henry Landivar, Florence Mistrot, Robert Ferrell, Will Knickerbocker, Gary Munch, Terry Miller, John Archie, Cristina Karman, Tom Wahl, Herbert Goldstein, Chaz Mena, Manuel L. García, Don Shula, Scott Mitchell, Peter Stoyanovich, Dwight Stephenson, Jeff Uhlenhake, Jeff Dellenbach, Marco Coleman, Kim Bokamper, Jeff Cross, Chris Barnes, Alex Webster, Paul Mazurkiewicz Jr., Jack Owen, Robert Barrett, Bubba Baker, Nick Bass, Binx, Ray Buffer, Vince Cecere, Robert Deacon, Greg Finley, Cassidy McMillan, Bill Pearlman, Dominic Jack Pizzo Sr., Michelle Russo, Jimmy Star, Laird Stuart", "dbpedia_uri": "http://dbpedia.org/resource/Ace_Ventura:_Pet_Detective", "dbpedia_label": "Ace Ventura: Pet Detective"}, {"movielens_id": "68", "imdb_id": "0109506", "title": "The Crow", "plot": "A man brutally murdered comes back to life as an undead avenger of his and his fiancée's murder.", "genres": "Action, Drama, Fantasy", "year": "1994", "rating": "7.6", "directors": "Alex Proyas", "cast": "Brandon Lee, Rochelle Davis, Ernie Hudson, Michael Wincott, Bai Ling, Sofia Shinas, Anna Thomson, David Patrick Kelly, Angel David, Laurence Mason, Michael Massee, Tony Todd, Jon Polito, Bill Raymond, Marco Rodríguez, Kim Sykes, Rock Taulbee, Norman Max Maxwell, Jeff Cadiente, Henry Kingi Jr., Erik Stabenau, Cassandra Lawton, Lou Criscuolo, Todd Brenner, Joe West, Thomas Rosales Jr., Jeff Imada, Tierre Turner, Tim Parati, Matt Adler, Charles Bazaldua, Jennifer Blanc-Biehn, Theodore Borders, Joseph Chapman, Holly Dorff, Judi M. Durand, Greg Finley, Spencer Garrett, Barbara Harris, Kathleen Kane, Carlyle King, Phillip Lucier, Peter Lurie, Juan Pope, David Randolph, Vernon Scott, Jim Goodall, Brad Laner, James Putnam, Eddie Ruscha, Elizabeth Thompson, Marston Daley, Laura Gomel, Rachel Hollingsworth, Charles Levi, Mark McCabe, Frank Nardiello, Brianne Brozey, Phoebe Dollar, Dale Frye, Aaron Jefford, James O'Barr, Hamilton Perkins, Kai Portman, David J. Schow, Michael Sinterniklaas, Tom Wayland", "dbpedia_uri": "http://dbpedia.org/resource/The_Crow_(film)", "dbpedia_label": "The Crow (film)"}, {"movielens_id": "69", "imdb_id": "0109830", "title": "Forrest Gump", "plot": "The presidencies of Kennedy and Johnson, the Vietnam War, the Watergate scandal and other historical events unfold from the perspective of an Alabama man with an IQ of 75, whose only desire is to be reunited with his childhood sweetheart.", "genres": "Drama, Romance", "year": "1994", "rating": "8.8", "directors": "Robert Zemeckis", "cast": "Tom Hanks, Rebecca Williams, Sally Field, Michael Conner Humphreys, Harold G. Herthum, George Kelly, Bob Penny, John Randall, Sam Anderson, Margo Moorer, Ione M. Telech, Christine Seabrook, John Worsham, Peter Dobson, Siobhan Fallon Hogan, Alexander Zemeckis, Logan Livingston Gomez, Ben Waddel, Elizabeth Hanks, Hanna Hall, Tyler Long, Christopher Jones, Grady Bowman, Kevin Mangan, Fay Genens, Frank Geyer, Robin Wright, Rob Landry, Jason McGuire, Pete Auster, Sonny Shroyer, Brett Rice, Ed Davis, Daniel C. Striepeke, Bruce Lucvia, David Brisbin, Kirk Ward, Angela Lomas, Timothy Record, Deborah McTeer, Mark Matheisen, Al Harrington, Jed Gillin, Bob Harks, Don Fischer, Kenneth Bevington, Michael Flannery, Gary Robinson, Mykelti Williamson, Marlena Smalls, Kitty K. Green, Afemo Omilami, Matt Wallace, Danté McCarthy, Paulie DiCocco, Mike Jolly, Michael Kemmerling, John Voldstad, Jeffrey Winner, Russ Wilson, Daniel J. Gillooly, Gary Sinise, Calvin Gadsden, Aaron Izbicki, Michael Burgess, Steven Griffith, Bill Roberson, Michael McFall, Eric Underwood, Steve DeRelian, Byron Minns, Stephen Bridgewater, Bonnie Ann Burgess, Scott Oliver, John William Galt, Hilary Chaplain, Isabel Rose, Jay Ross, Richard D'Alessandro, Dick Stilwell, Kevin Davis, Michael Jace, Geoffrey Blake, Tim Perry, Vanessa Roth, Emily Carey, Paul Raczkowski, Valentine, Dick Cavett, Joe Stefanelli, Tiffany Salerno, Marla Sucharetza, Aloysius Gigl, Jack Bowden, Joe Alaskey, Lazarus Jackson, W. Benson Terry, Matt Rebenkoff, Peter Bannon, The Hallelujah Singers of Beaufort South Carolina, Joe Washington, Nora Dunfee, Natalie Hendrix, Hallie D'Amore, Chiffonye Cobb, Juan Singleton, Bobby Richardson, Michael Mattison, Lenny Herb, Charles Boswell, Timothy McNeil, Haley Joel Osment, Lonnie Hamilton, Teresa Denton, Joe Abby, Rob Adams, Markus Alexander, Neil Armstrong, Marcus Batton, Keri-Anne Bilotta, Jim Boeke, Arthur Bremer, Grand L. Bush, Clint Calvert, Troy Christian, Dick Clark, John Connally, Darren W. Conrad, Jim Damron, Ryan Duncan, James Ent, Gerald Ford, Michael Garvey, Leigh Goodoff, Christopher James Hall, Bryan Hanna, Ellsworth Hanna, Jeanne Hanna, Zach Hanner, John Glenn Harding, Bob Hope, Russ Isles, Lyndon B. Johnson, Shann Johnson, Jim Keller, John F. Kennedy, Robert F. Kennedy, Aaron Michael Lacey, Teddy Lane Jr., John Lennon, Andrew Lepper, Jacqueline Lovell, Richard Nixon, Darrell O'Cook, Shawn Michael Perry, Elvis Presley, Ronald Reagan, Mark A. Rich, Kurt Russell, Brendan Shanahan, William Shipman, Robb Skyler, John-Michael Steele, Mary Ellen Trainor, USC Trojan Marching Band, George Wallace, Eric Alan Wendell, Zhuang Zedong", "dbpedia_uri": "http://dbpedia.org/resource/Forrest_Gump", "dbpedia_label": "Forrest Gump"}, {"movielens_id": "72", "imdb_id": "0110475", "title": "The Mask", "plot": "Bank clerk Stanley Ipkiss is transformed into a manic superhero when he wears a mysterious mask.", "genres": "Action, Comedy, Crime, Fantasy", "year": "1994", "rating": "6.9", "directors": "Chuck Russell", "cast": "Jim Carrey, Peter Riegert, Peter Greene, Amy Yasbeck, Richard Jeni, Orestes Matacena, Tim Bagley, Nancy Fish, Johnny Williams, Reg E. Cathey, Jim Doughan, Denis Forest, Cameron Diaz, Joseph Alfieri, B.J. Barie, Catherine Berge, Phil Boardman, Krista Buonauro, Debra Casey, Blake Clark, Christopher Darga, Suzanne Dunn, Joely Fisher, Kevin Grevioux, Peter Jazwinski, Howard Kay, Robert Keith, Beau Lotterman, Scott McElroy, Richard Montes, Ivory Ocean, Robert O'Reilly, Louis Ortiz, Daniel James Peterson, Jeremy Roberts, Eamonn Roche, Randi Ruimy, Ben Stein, Nils Allen Stewart, Chris Taylor, Bullet Valmont, Wendy L. Walsh, Meadow Williams, Max, Susan Boyd, Monica Lee Bellais, Keri-Anne Bilotta, Mike Breyer, Leslie Cook, Christopher A. Green, Krista Miller, Richard Raynesford, Rebecca Ryiz, Garret Sato, Peter Wick", "dbpedia_uri": "http://dbpedia.org/resource/The_Mask_(film)", "dbpedia_label": "The Mask (film)"}, {"movielens_id": "81", "imdb_id": "0110074", "title": "The Hudsucker Proxy", "plot": "A naive business graduate is installed as president of a manufacturing company as part of a stock scam.", "genres": "Comedy, Drama, Fantasy", "year": "1994", "rating": "7.2", "directors": "Joel Coen, Ethan Coen", "cast": "Tim Robbins, Jennifer Jason Leigh, Paul Newman, Charles Durning, John Mahoney, Jim True-Frost, Bill Cobbs, Bruce Campbell, Harry Bugin, John Seitz, Joe Grifasi, Roy Brocksmith, John Wylie, I.M. Hobson, Gary Allen, John Scanlan, Richard Woods, Jerome Dempsey, Peter McPherson, David Byrd, Christopher Darga, Patrick Cranshaw, Robert Weil, Mary Lou Rosato, Ernest Sarracino, Eleanor Glockner, Kathleen Perkins, Joseph Marcus, Peter Gallagher, Noble Willingham, Barbara Ann Grimes, Thom Noble, Steve Buscemi, William Duff-Griffin, Anna Nicole Smith, Pamela Everett, Arthur Bridgers, Sam Raimi, John Cameron, Skipper Duke, Jay Kapner, Jon Polito, Richard Whiting, Linda McCoy, Stan Adams, John Goodman, Joanne Pankow, Mario Todisco, Colin Fickes, Dick Sasso, Jesse Brewer, Philip Loch, Stan Lichtenstein, Todd Alcott, Ace O'Connell, Richard Schiff, Frank Jeffreys, Lou Criscuolo, Michael Earl Reid, Mike Starr, David Hagar, Willie Reale, Harvey Meyer, Tom Toner, David Fawcett, Jeff Still, David Gould, Gil Pearson, Marc Garber, David Massie, Mark Jeffrey Miller, Peter Siragusa, Nelson George, Mike Houlihan, Ed Lillard, Wantland Sandel, James Deuter, Roderick Peeples, Cynthia Baker, Pat Battistini, Catherine Bayley, Bryan Keith DeBose, Steve Head, Jack Rooney, Keith Schrader, Selena Vidya", "dbpedia_uri": "http://dbpedia.org/resource/The_Hudsucker_Proxy", "dbpedia_label": "The Hudsucker Proxy"}, {"movielens_id": "82", "imdb_id": "0107290", "title": "Jurassic Park", "plot": "A pragmatic paleontologist visiting an almost complete theme park is tasked with protecting a couple of kids after a power failure causes the park's cloned dinosaurs to run loose.", "genres": "Action, Adventure, Sci-Fi, Thriller", "year": "1993", "rating": "8.1", "directors": "Steven Spielberg", "cast": "Sam Neill, Laura Dern, Jeff Goldblum, Richard Attenborough, Bob Peck, Martin Ferrero, BD Wong, Joseph Mazzello, Ariana Richards, Samuel L. Jackson, Wayne Knight, Gerald R. Molen, Miguel Sandoval, Cameron Thor, Christopher John Fields, Whit Hertford, Dean Cundey, Jophery C. Brown, Tom Mishler, Greg Burson, Adrian Escober, Richard Kiley, Brad M. Bucklin, Laura Burnett, Michael Lantieri, Gary Rodriguez, Lata Ryan, Brian Smrz, Rip Lee Walker, Robert 'Bobby Z' Zajonc", "dbpedia_uri": "http://dbpedia.org/resource/Jurassic_Park_(film)", "dbpedia_label": "Jurassic Park (film)"}, {"movielens_id": "86", "imdb_id": "0107943", "title": "The Remains of the Day", "plot": "A butler who sacrificed body and soul to service in the years leading up to World War II realizes too late how misguided his loyalty was to his lordly employer.", "genres": "Drama, Romance", "year": "1993", "rating": "7.8", "directors": "James Ivory", "cast": "John Haycraft, Christopher Reeve, Anthony Hopkins, Emma Thompson, Caroline Hunt, James Fox, Peter Vaughan, Paula Jacobs, Ben Chaplin, Steve Dibben, Abigail Hopkins, Patrick Godfrey, Peter Cellier, Peter Halliday, Hugh Grant, Terence Bayler, Jeffry Wickham, Hugh Sweetman, Michael Lonsdale, Brigitte Kahn, John Savident, Tony Aitken, Emma Lewis, Joanna Joseph, Rupert Vansittart, Tim Pigott-Smith, Christopher Brown, Lena Headey, Paul Copley, Ian Redford, Jo Kendall, Steven Beard, Pip Torrens, Frank Shelley, Peter Eyre, Jestyn Phillips, Wolf Kahler, Frank Höltje, Andreas Töns, Roger McKern, Angela Newmarch, Keith Gale, Miles Richardson", "dbpedia_uri": "http://dbpedia.org/resource/The_Remains_of_the_Day_(film)", "dbpedia_label": "The Remains of the Day (film)"}, {"movielens_id": "87", "imdb_id": "0108065", "title": "Searching for Bobby Fischer", "plot": "A prepubescent chess prodigy refuses to harden himself in order to become a champion like the famous but unlikable Bobby Fischer.", "genres": "Biography, Drama, Sport", "year": "1993", "rating": "7.4", "directors": "Steven Zaillian", "cast": "Max Pomeranc, Joe Mantegna, Joan Allen, Ben Kingsley, Laurence Fishburne, Michael Nirenberg, Robert Stephens, David Paymer, Hal Scardino, Vasek Simek, William H. Macy, Dan Hedaya, Laura Linney, Anthony Heald, Steven Randazzo, Chelsea Moore, Josh Mostel, Josh Kornbluth, Tony Shalhoub, Austin Pendleton, Tom McGowan, Ona Fletcher, Kamran Shirazi, Joel Benjamin, Roman Dzindzichashvili, Jerry Poe McClinton, Matt De Matt, Vincent Smith, Jerry Rakow, William Colgate, Tony De Santis, R.D. Reid, Anthony McGowen, Katya Waitzkin, Ryder Fleming-Jones, Harris Krofchick, John Bourgeois, Maria Ricossa, Caroline Yeager, Andrew Sardella, Nathan Carter, Nicholas Taylor, Jonathan Fazio, Nicky Mellina, Philip Neiman, Elizabeth Gropman, Bobby Fischer, Matt Birman, Robert Anthony Carswell, Mary Costa, James Garrigan, Bruce Pandolfini, Edd Scorpio, Josh Waitzkin", "dbpedia_uri": "http://dbpedia.org/resource/Searching_for_Bobby_Fischer", "dbpedia_label": "Searching for Bobby Fischer"}, {"movielens_id": "96", "imdb_id": "0103064", "title": "Terminator 2: Judgment Day", "plot": "A cyborg, identical to the one who failed to kill Sarah Connor, must now protect her ten year old son, John Connor, from a more advanced and powerful cyborg.", "genres": "Action, Sci-Fi", "year": "1991", "rating": "8.5", "directors": "James Cameron", "cast": "Arnold Schwarzenegger, Linda Hamilton, Edward Furlong, Robert Patrick, Earl Boen, Joe Morton, S. Epatha Merkerson, Castulo Guerra, Danny Cooksey, Jenette Goldstein, Xander Berkeley, Leslie Hamilton Gearren, Ken Gibbel, Robert Winley, Peter Schrum, Shane Wilder, Michael Edwards, Jared Lounsbery, Casey Chavez, Ennalls Berl, Don Lake, Richard Vidan, Tom McDonald, Jim Palmer, Guss Williams, Gwenda Deacon, Don Stanton, Dan Stanton, Colin Patrick Lynch, Noel Evangelisti, Nikki Cox, Lisa Brinegar, DeVaughn Nixon, Tony Simotes, Diane Rodriguez, Dalton Abbott, Ron Young, Charles Robert Brown, Abdul Salaam El Razzac, Mike Muscat, Dean Norris, Charles A. Tamburro, J. Rob Jordan, Terrence Evans, Denney Pierce, Mark Christopher Lawrence, Pat Kouri, Van Ling, Michael Albanese, Ed Arneson, Bret A. Arnold, Dean Blanke, Debra Casey, Jim Dahl, Martin Deluca, Jennifer Jacono, Gavin Kelly, Takao Komine, Joel Kramer, Anne Merrem, Mic Rodgers, Richard Ruskin, Scott Shaw, Steven Stear, Sven-Ole Thorsen, Randy Walker, William Wisher", "dbpedia_uri": "http://dbpedia.org/resource/Terminator_2:_Judgment_Day", "dbpedia_label": "Terminator 2: Judgment Day"}, {"movielens_id": "97", "imdb_id": "0099348", "title": "Dances with Wolves", "plot": "Lieutenant John Dunbar, assigned to a remote western Civil War outpost, befriends wolves and Indians, making him an intolerable aberration in the military.", "genres": "Adventure, Drama, Western", "year": "1990", "rating": "8.0", "directors": "Kevin Costner", "cast": "Kevin Costner, Mary McDonnell, Graham Greene, Rodney A. Grant, Floyd 'Red Crow' Westerman, Tantoo Cardinal, Robert Pastorelli, Charles Rocket, Maury Chaykin, Jimmy Herman, Nathan Lee Chasing His Horse, Michael Spears, Jason R. Lone Hill, Tony Pierce, Doris Leader Charge, Tom Everett, Larry Joshua, Kirk Baltz, Wayne Grace, Donald Hotton, Annie Costner, Conor Duffy, Elisa Daniel, Percy White Plume, John Tail, Steve Reevis, Sheldon Peters Wolfchild, Wes Studi, Buffalo Child, Clayton Big Eagle, Richard Leader Charge, Redwing Ted Nez, Marvin Holy, Raymond Newholy, David J. Fuller, Ryan White Bull, Otakuye Conroy, Maretta Big Crow, Steven Chambers, William H. Burton Jr., Bill W. Curry, Nick Thompson, Carter Hanner, Kent Hays, Robert Goldman, Frank P. Costanza, James A. Mitchell, R.L. Curtin, Justin, Teddy, Buck, Michael Horton, J. Wesley Adams, Linda Allen, Bill Costner, David Rambow, William Rossman, Jim Wilson", "dbpedia_uri": "http://dbpedia.org/resource/Dances_with_Wolves", "dbpedia_label": "Dances with Wolves"}, {"movielens_id": "100", "imdb_id": "0116282", "title": "Fargo", "plot": "Jerry Lundegaard's inept crime falls apart due to his and his henchmen's bungling and the persistent police work of the quite pregnant Marge Gunderson.", "genres": "Crime, Drama, Thriller", "year": "1996", "rating": "8.1", "directors": "Joel Coen, Ethan Coen", "cast": "William H. Macy, Steve Buscemi, Peter Stormare, Kristin Rudrüd, Harve Presnell, Tony Denman, Gary Houston, Sally Wingert, Kurt Schweickhardt, Larissa Kokernot, Melissa Peterman, Steve Reevis, Warren Keith, Steve Edelman, Sharon Anderson, Larry Brandenburg, James Gaulke, J. Todd Anderson, Michelle Suzanne LeDoux, Frances McDormand, John Carroll Lynch, Bruce Bohne, Petra Boden, Steve Park, Wayne A. Evenson, Cliff Rakerd, Jessica Shepherd, Peter Schmitz, Steven I. Schafer, Michelle Hutchison, David S. Lomax, José Feliciano, Bix Skahill, Bain Boehlke, Rose Stockton, Robert Ozasky, John Bandemer, Don Wescott, Bruce Campbell, Matthew McCloud, Clifford Nelson, Lori J. Ness", "dbpedia_uri": "http://dbpedia.org/resource/Fargo_(film)", "dbpedia_label": "Fargo (film)"}, {"movielens_id": "117", "imdb_id": "0117500", "title": "The Rock", "plot": "A mild-mannered chemist and an ex-con must lead the counterstrike when a rogue group of military men, led by a renegade general, threaten a nerve gas attack from Alcatraz against San Francisco.", "genres": "Action, Adventure, Thriller", "year": "1996", "rating": "7.4", "directors": "Michael Bay", "cast": "Sean Connery, Nicolas Cage, Ed Harris, John Spencer, David Morse, William Forsythe, Michael Biehn, Vanessa Marcil, John C. McGinley, Gregory Sporleder, Tony Todd, Bokeem Woodbine, Jim Maniaci, Greg Collins, Brendan Kelly, Steve Harris, Danny Nucci, Claire Forlani, Celeste Weaver, Todd Louiso, David Bowe, Raquel Krelle, Dennis Chalker, Marshall R. Teague, Duffy Gaver, Steve Decker, Joseph Hawes, Mike Mahrer, Carlos Sandoval, Rick Toms, Billy Devlin, Jack Yates, Juan A. Riojas, Joseph Patrick Kelly, Ingo Neuhaus, John Laughlin, Harry Humphries, Howard Platt, Willie Garson, John Nathan, Robert M. Anselmo, Jack Ford, Thomas J. Hageboeck, Dwight Hicks, Ralph Peduto, Anthony Clark, Andy Ryan, Hans Georg Struhar, Robert C. Besgrove, Sean Skelton, Raymond O'Connor, Jane Sanguinetti, Luenell, John W. Love Jr., Sam Whipple, Tom Towles, Ronald Simmons, Robert Ben Rajab, Leonard McMahan, Anthony Guidera, Jim Caviezel, John Enos III, Ken Kells, Fred Salvallon, Buck Kartalian, Stanley Anderson, Xander Berkeley, Richard Conti, Raymond Cruz, Jenny Inge Devaney, Leah Diamond II, Ric Drasin, David Marshall Grant, Matt Gulbranson, Philip Baker Hall, Michael Rose, Pat Skipper, Anthony Snow, Theodore Carl Soderberg, Jeronimo Spinx, Ezra J. Stanley, Erick Vinther, Kevin Weisman, Stuart Wilson", "dbpedia_uri": "http://dbpedia.org/resource/The_Rock_(film)", "dbpedia_label": "The Rock (film)"}, {"movielens_id": "121", "imdb_id": "0116629", "title": "Independence Day", "plot": "The aliens are coming and their goal is to invade and destroy Earth. Fighting superior technology, mankind's best weapon is the will to survive.", "genres": "Action, Adventure, Sci-Fi", "year": "1996", "rating": "7.0", "directors": "Roland Emmerich", "cast": "Will Smith, Bill Pullman, Jeff Goldblum, Mary McDonnell, Judd Hirsch, Robert Loggia, Randy Quaid, Margaret Colin, James Rebhorn, Harvey Fierstein, Adam Baldwin, Brent Spiner, James Duval, Vivica A. Fox, Lisa Jakub, Ross Bagley, Mae Whitman, Bill Smitrovich, Kiersten Warren, Harry Connick Jr., Giuseppe Andrews, John Storey, Frank Novak, Devon Gummersall, Leland Orser, Mirron E. Willis, Ross Lacy, David Pressman, Vivian Palermo, Raphael Sbarge, Bobby Hosea, Dan Lauria, Steve Giannelli, Eric Paskel, Carlos Lacamara, John Bennett Perry, Troy Willis, Tim Kelleher, Wayne Wilderson, Jay Acovone, James Wong, Thom Barry, Jana Marie Hupp, Matt Pashkow, Robert Pine, Marisa Johnston, Michael Winther, Dexter Warren, Paul LeClair, Michael Vacca, David Channell, John Capodice, Greg Collins, Derek Webster, Mark Fite, Eric Neal Newman, Levani, Kristof Konrad, Kevin Sifuentes, Elston Ridgle, Randy Oglesby, Jack Moore, Barry Del Sherman, Lyman Ward, Anthony Crivello, Richard Speight Jr., Barbara Beck, Joe Fowler, Andrew Warne, Sharon Tay, Peter J. Lucas, Yelena Danova, Johnny Kim, Vanessa J. Wells, Jessika Cardinahl, Gary W. Cruz, Ron Pitts, Wendy L. Walsh, Christine Devine, Mark Thompson, Ernie Anastos, Kevin Cooney, Rance Howard, Nelson Mashita, Jeff Phillips, Sayed Badreya, Adam Tomei, John Bradley, Kimberly Beck, Thomas F. Duffy, Andrew Keegan, Jon Shear, Jim Piddock, Frederic W. Barnes, Eleanor Clift, Jerry Dunphy, Jack Germond, Morton Kondracke, John McLaughlin, Barry Nolan, George Putnam, Eric Michael Zee, Pat Skipper, Carlos Lara, Mike Monteleone, Lee Strauss, Lisa Star, Malcolm Danare, Arthur Brooks, Michael Moertl, James J. Joyce, Joyce Cohen, Julie Moran, Robin Groth, Richard Pachorek, Dakota, Gary A. Hecker, Frank Welker, Jonathan Adler, Janette Andrade, T.D. Antoine, Kevin Ash, Erick Avari, Pam Blackwell, Greg Bronson, Kadrolsha Ona Carole, Roy Milton Davis, Dean Devlin, Daren Dochterman, Volker Engel, Bob Friend, Jake Garber, Jeffrey Gold, Michael Haddad, Bart Hamatake, Andre Harper, Lincoln D. Hiatt, Jay Hopkins, Jonathan Khan, Anthony Kopczynski, Jalil Jay Lynch, Darin Mangan, Joe Martinez, Scott McKinley, Karolyna Medina, Ralph Moratz, Bryan Moss, Roy Newton, Gary Pike, Darla Rae, Nectar Rose, Vincent Schiavelli, Bonnie Silco, Tadao Tomomatsu, Antonino Garcia Tony, Michael A. Valenzano, Tracey Walter, James With, James Woodson, Anne Zogby", "dbpedia_uri": "http://dbpedia.org/resource/Independence_Day_(1983_film)", "dbpedia_label": "Independence Day (1983 film)"}, {"movielens_id": "124", "imdb_id": "0116905", "title": "Lone Star", "plot": "When the skeleton of his murdered predecessor is found, Sheriff Sam Deeds unearths many other long-buried secrets in his Texas border town.", "genres": "Drama, Mystery", "year": "1996", "rating": "7.4", "directors": "John Sayles", "cast": "Stephen Mendillo, Stephen J. Lang, Chris Cooper, Elizabeth Peña, Oni Faida Lampley, Eleese Lester, Joe Stevens, Gonzalo Castillo, Richard Coca, Clifton James, Tony Frank, Miriam Colon, Kris Kristofferson, Jeff Monahan, Matthew McConaughey, Joe Morton, LaTanya Richardson Jackson, Eddie Robinson, Ron Canada, Chandra Wilson, Damon Guy, Dee Macaluso, Luis Cobo, Marco Perella, Don Phillips Jr., Mary Jane R. Hernandez, Jesse Borrego, Carina Martinez, Tony Plana, Richard Andrew Jones, Beatrice Winde, Gabriel Casseus, Randy Stripling, Richard Reyes, Olga Luna, Juan Vega III, Lizzie Curry Martinez, Leo Burmester, Carmen De Lavallade, Vanessa Martinez, Tay Strathairn, Sam Vlahos, Maricela Gonzalez, Tony Amendola, Gilbert R. Cuellar Jr., James Borrego, Gordon Tootoosis, Lisa Suarez, Jesus Ramirez, Frances McDormand, John Griesemer, Eduardo Martínez, Azalea Mendez, Murray Mead", "dbpedia_uri": "http://dbpedia.org/resource/Lone_Star_(1996_film)", "dbpedia_label": "Lone Star (1996 film)"}, {"movielens_id": "132", "imdb_id": "0032138", "title": "The Wizard of Oz", "plot": "Dorothy Gale is swept away from her home in Kansas to the magical Land of Oz in a tornado and embarks on a quest with her new friends to see the Wizard who can help her return home and help her friends as well.", "genres": "Adventure, Family, Fantasy, Musical", "year": "1939", "rating": "8.0", "directors": "Victor Fleming, George Cukor, Mervyn LeRoy, Norman Taurog, Richard Thorpe, King Vidor", "cast": "Judy Garland, Frank Morgan, Ray Bolger, Bert Lahr, Jack Haley, Billie Burke, Margaret Hamilton, Charley Grapewin, Pat Walshe, Clara Blandick, Terry, The Singer Midgets, Franz Balluck, Josefine Balluck, Dorothy Barrett, Amelia Batchelor, Charles Becker, Freda Betsky, Billy Bletcher, Lorraine Bridges, Buster Brodie, Tyler Brooke, Betty Ann Bruno, Christine Buresh, Eddie Buresh, Lida Buresh, Betty Ann Cain, Candy Candido, Mickey Carroll, Adriana Caselotti, Harry Cogg, Pinto Colvig, Nona Cooper, Tommy Cottonaro, Lewis Croft, Jimmy the Crow, Frank Cucksey, Billy Curtis, Ken Darby, Sid Dawson, Ethel W. Denis, Prince Denis, Abe Dinovitch, Jon Dodson, Gracie Doll, Tiny Doll, Ardith Dondanville, Ruth Duccini, Daisy Earles, Harry Earles, Buddy Ebsen, Fern Formica, Sig Frohlich, Jackie Gerlich, Phil Harron, Joseph Herbst, Shep Houghton, James R. Hulse, Charles Irwin, Lois January, Eleanor Keaton, Joan Kenmore, The King's Men, Karl 'Karchy' Kosiczky, Dolly Kramer, Emil Kranzler, Nita Krebs, Jeane La Barbera, Rae-Nell Laskey, Johnny Leal, Valerie Lee, Ethelreda Leopold, Mitchell Lewis, Bud Linn, Jerry Maren, Dona Massin, Elaine Merk, George Ministeri, Priscilla Montgomery, Harry Monty, Yvonne Moray, Lee Murray, Olga Nardone, George Noisom, William H. O'Docharty, Nicholas Page, Jack Paul, Margaret Pellegrini, Meinhardt Raabe, Hazel Resmondo, Freddie Retter, 'Little Billy' Rhodes, The Rhythmettes, Elvida Rizzo, Rad Robinson, Paul Rodriguez, Angelo Rossitto, Ambrose Schindler, Helen Seamon, Rolfe Sedan, Garland Slatten, Oliver Smith, Ruth Smith, Katharine Snell, Robert St. Angelo, Parnell St. Aubin, Alta Stevens, Elizabeth Stevens, Ralph Sudam, August Clarence Swenson, Betty Tanner, Gus Wayne, Victor Wetter, Harry Wilson, Johnny Winters, Marie Winters, Gladys V. Wolff, Murray Wood", "dbpedia_uri": "http://dbpedia.org/resource/The_Wizard_of_Oz_(1933_film)", "dbpedia_label": "The Wizard of Oz (1933 film)"}, {"movielens_id": "135", "imdb_id": "0062622", "title": "2001: A Space Odyssey", "plot": "After discovering a mysterious artifact buried beneath the Lunar surface, mankind sets off on a quest to find its origins with help from intelligent supercomputer H.A.L. 9000.", "genres": "Adventure, Sci-Fi", "year": "1968", "rating": "8.3", "directors": "Stanley Kubrick", "cast": "Keir Dullea, Gary Lockwood, William Sylvester, Daniel Richter, Leonard Rossiter, Margaret Tyzack, Robert Beatty, Sean Sullivan, Douglas Rain, Frank Miller, Bill Weston, Ed Bishop, Glenn Beck, Alan Gifford, Ann Gillis, Edwina Carroll, Penny Brahms, Heather Downham, Mike Lovell, John Ashley, Jimmy Bell, David Charkham, Simon Davis, Jonathan Daw, Péter Delmár, Terry Duggan, David Fleetwood, Danny Grover, Brian Hawley, David Hines, Tony Jackson, John Jordan, Scott MacKee, Laurence Marchant, Darryl Paes, Joe Refalo, Andy Wallace, Bob Wilyman, Richard Woods, Martin Amor, S. Newton Anderson, Ann Barrass, Jim Beasley, Sheraton Blount, Ann Bormann, John Clifford, Harold Coyne, Julie Croft, Harry Fielder, Penny Francis, Jane Hayward, Lew Hooper, Judy Keirn, Kenneth Kendall, Maya Koumani, Vivian Kubrick, Roy Lansford, Maggie London, Marcella Markham, Irena Marr, Krystyna Marr, Chela Matthison, Colin McKenzie, Kim Neil, Jane Pearl, Penny Pearl, Ivor Powell, Doug Robinson, Jennifer Sanders, Kevin Scott, Skeleton, John Swindells, Burnell Tucker", "dbpedia_uri": "http://dbpedia.org/resource/2001:_A_Space_Odyssey_(film)", "dbpedia_label": "2001: A Space Odyssey (film)"}, {"movielens_id": "143", "imdb_id": "0059742", "title": "The Sound of Music", "plot": "A woman leaves an Austrian convent to become a governess to a Naval officer widower's children.", "genres": "Biography, Drama, Family, Musical, Romance", "year": "1965", "rating": "8.0", "directors": "Robert Wise", "cast": "Julie Andrews, Christopher Plummer, Eleanor Parker, Richard Haydn, Peggy Wood, Charmian Carr, Heather Menzies-Urich, Nicholas Hammond, Duane Chase, Angela Cartwright, Debbie Turner, Kym Karath, Anna Lee, Portia Nelson, Ben Wright, Daniel Truhitte, Norma Varden, Gilchrist Stuart, Marni Nixon, Evadne Baker, Doris Lloyd, Leon Alton, Gertrude Astor, Frank Baker, Herman Boden, Alan Callow, Steve Carruthers, James Gonzalez, Sam Harris, Dorothy Jeakins, Irvin 'Zabo' Koszewski, Ada Beth Lee, William Meader, Monty O'Grady, Jean Ransome, Fred Rapport, Leoda Richards, Jeffrey Sayre, Bernard Sell, Norman Stevans, Bert Stevens, Doreen Tryden, Maria von Trapp", "dbpedia_uri": "http://dbpedia.org/resource/The_Sound_of_Music_(film)", "dbpedia_label": "The Sound of Music (film)"}, {"movielens_id": "153", "imdb_id": "0095159", "title": "A Fish Called Wanda", "plot": "In London, four very different people team up to commit armed robbery, then try to doublecross each other for the loot.", "genres": "Comedy, Crime", "year": "1988", "rating": "7.5", "directors": "Charles Crichton, John Cleese", "cast": "John Cleese, Jamie Lee Curtis, Kevin Kline, Michael Palin, Maria Aitken, Tom Georgeson, Patricia Hayes, Geoffrey Palmer, Cynthia Cleese, Mark Elwes, Neville Phillips, Peter Jonfield, Ken Campbell, Al Ashton, Roger Hume, Roger Brierley, Llewellyn Rees, Michael Percival, Kate Lansbury, Robert Ian Mackenzie, Andrew MacLachlan, Roland MacLeod, Jeremy Child, Pamela Miles, Tom Pigott Smith, Katherine John, Sophie Johnstone, Kim Barclay, Sharon Marino, Patrick Newman, David Simeon, Imogen Bickford-Smith, Tia Lee, Robert Putt, Waydon Croft, John Dixon, Anthony Pedley, Robert McBain, Clare McIntyre, Charu Bala Chokshi, Stephen Fry, John Bird, Chris Chering, Terence Conoley, Robert Goodman, Pat Gorman, Aidan Harrington, Rebecca Moore, Mike Reynell, Peter Roy, Guy Standeven", "dbpedia_uri": "http://dbpedia.org/resource/A_Fish_Called_Wanda", "dbpedia_label": "A Fish Called Wanda"}, {"movielens_id": "157", "imdb_id": "0091763", "title": "Platoon", "plot": "Chris Taylor, a neophyte recruit in Vietnam, finds himself caught in a battle of wills between two sergeants, one good and the other evil. A shrewd examination of the brutality of war and the duality of man in conflict.", "genres": "Drama, War", "year": "1986", "rating": "8.1", "directors": "Oliver Stone", "cast": "Keith David, Forest Whitaker, Francesco Quinn, Kevin Dillon, John C. McGinley, Reggie Johnson, Mark Moses, Corey Glover, Johnny Depp, Chris Pedersen, Bob Orwig, Corkey Ford, David Neidorf, Tom Berenger, Willem Dafoe, Charlie Sheen, Richard Edson, Tony Todd, Kevin Eshelman, James Terry McIlvain, J. Adam Glover, Ivan Kane, Paul Sanchez, Dale Dye, Peter Hicks, Basile Achara, Steve Barredo, Chris Castillejo, Andrew B. Clark, Bernardo Manalili, Than Rogers, Li Thi Van, Clarisa Ortacio, Romy Sevilla, Mathew Westfall, Nick Nicholson, Warren McLean, Li Mai Thao, Ron Barracks, H. Gordon Boos, Brad Cassini, Mark Ebenhoch, Robert 'Rock' Galotti, Ken Glover, Eric Hahn, Berto Spoor, Oliver Stone, Henry Strzalkowski", "dbpedia_uri": "http://dbpedia.org/resource/Platoon_(film)", "dbpedia_label": "Platoon (film)"}, {"movielens_id": "166", "imdb_id": "0091480", "title": "Manon of the Spring", "plot": "A beautiful but shy shepherdess plots vengeance on the men whose greedy conspiracy to acquire her father's land caused his death years earlier.", "genres": "Drama", "year": "1986", "rating": "8.0", "directors": "Claude Berri", "cast": "Yves Montand, Daniel Auteuil, Emmanuelle Béart, Hippolyte Girardot, Margarita Lozano, Yvonne Gamy, Ticky Holgado, Jean Bouchaud, Elisabeth Depardieu, Gabriel Bacquier, Armand Meffre, André Dupon, Pierre Nougaro, Jean Maurel, Roger Souza, Didier Pain, Pierre-Jean Rippert, Marc Betton, Chantal Liennel, Lucien Damiani, Fransined, Françoise Trompette", "dbpedia_uri": "http://dbpedia.org/resource/Manon_des_Sources_(1986_film)", "dbpedia_label": "Manon des Sources (1986 film)"}, {"movielens_id": "172", "imdb_id": "0080684", "title": "Star Wars: Episode V - The Empire Strikes Back", "plot": "After the Rebels are brutally overpowered by the Empire on the ice planet Hoth, Luke Skywalker begins Jedi training with Yoda, while his friends are pursued across the galaxy by Darth Vader and bounty hunter Boba Fett.", "genres": "Action, Adventure, Fantasy, Sci-Fi", "year": "1980", "rating": "8.7", "directors": "Irvin Kershner", "cast": "Mark Hamill, Harrison Ford, Carrie Fisher, Billy Dee Williams, Anthony Daniels, David Prowse, Peter Mayhew, Kenny Baker, Frank Oz, Alec Guinness, Jeremy Bulloch, John Hollis, Jack Purvis, Des Webb, Clive Revill, Kenneth Colley, Julian Glover, Michael Sheard, Michael Culver, John Dicks, Milton Johns, Mark Jones, Oliver Maguire, Robin Scobey, Bruce Boa, Christopher Malcolm, Denis Lawson, Richard Oldfield, John Morton, Ian Liston, John Ratzenberger, Jack McKenzie, Jerry Harte, Norman Chancer, Norwich Duff, Ray Hassett, Brigitte Kahn, Burnell Tucker, Tony Allen, Bob Anderson, Alan Austen, Richard Bonehill, Stephen Buchanan, Chris Bunn, Mercedes Burleigh, Jane Busby, Maurice Bush, Trevor Butterfield, John Cannon, Mark Capri, Tony Clarkin, Shaun Curry, Martin Dew, Peter Diamond, Jim Dowdall, Ian Durrant, Marjorie Eaton, Mike Edmonds, Tom Egeland, Harrison Ellenshaw, Stephanie English, Stuart Fell, Tom Flood, Alan Flyng, Michael A. Frandy, Patrick Ginter, Leroy Golding, Anthony Guilding, Alan Harris, Walter Henry, Kit Hillier, Susie Hudson, Colin Hunt, Paul Jerricho, Joe Johnston, James Earl Jones, Arve Juritzen, Paul Klein, Ian McDiarmid, Mac McDonald, Ralph McQuarrie, Steve Meek, Temuera Morrison, Ralph G. Morse, Cathy Munroe, Terence Mustoo, C. Andrew Nelson, Michael Pangrazio, Chris Parsons, Quentin Pierre, Mike Reynell, Terry Richards, Doug Robinson, Peter Ross-Murray, Deep Roy, Peter Roy, Richard Sidoli, Tony Smart, David Stone, Alan Swaden, Marolyn Turk, Harold Weed, Treat Williams, Jason Wingreen", "dbpedia_uri": "http://dbpedia.org/resource/Star_Wars_Episode_V:_The_Empire_Strikes_Back", "dbpedia_label": "Star Wars Episode V: The Empire Strikes Back"}, {"movielens_id": "173", "imdb_id": "0093779", "title": "The Princess Bride", "plot": "While home sick in bed, a young boy's grandfather reads him the story of a farmboy-turned-pirate who encounters numerous obstacles, enemies and allies in his quest to be reunited with his true love.", "genres": "Adventure, Family, Fantasy, Romance", "year": "1987", "rating": "8.1", "directors": "Rob Reiner", "cast": "Cary Elwes, Mandy Patinkin, Chris Sarandon, Christopher Guest, Wallace Shawn, André the Giant, Fred Savage, Robin Wright, Peter Falk, Peter Cook, Mel Smith, Carol Kane, Billy Crystal, Anne Dyson, Margery Mason, Malcolm Storry, Willoughby Gray, Betsy Brantley, Paul Badger, Danny Blackner, Sallie McLaughlin, Derek Pykett", "dbpedia_uri": "http://dbpedia.org/resource/The_Princess_Bride_(film)", "dbpedia_label": "The Princess Bride (film)"}, {"movielens_id": "179", "imdb_id": "0066921", "title": "A Clockwork Orange", "plot": "In the future, a sadistic gang leader is imprisoned and volunteers for a conduct-aversion experiment, but it doesn't go as planned.", "genres": "Crime, Drama, Sci-Fi", "year": "1971", "rating": "8.3", "directors": "Stanley Kubrick", "cast": "Malcolm McDowell, Patrick Magee, Michael Bates, Warren Clarke, John Clive, Adrienne Corri, Carl Duering, Paul Farrell, Clive Francis, Michael Gover, Miriam Karlin, James Marcus, Aubrey Morris, Godfrey Quigley, Sheila Raynor, Madge Ryan, John Savident, Anthony Sharp, Philip Stone, Pauline Taylor, Margaret Tyzack, Steven Berkoff, Lindsay Campbell, Michael Tarn, David Prowse, Barrie Cookson, Jan Adair, Gaye Brown, Peter Burton, John J. Carney, Vivienne Chandler, Richard Connaught, Prudence Drage, Carol Drinkwater, Lee Fox, Cheryl Grunwald, Gillian Hills, Craig Hunter, Shirley Jaffe, Virginia Wetherell, Neil Wilson, Katya Wyeth, Frankie Abbott, Jack Arrow, Joe Bartlett, Roy Beck, Robert Bruce, Maurice Bush, Steadman Clark, George Coulouris, Jeremy Curry, David Dawkins, Barbie Denham, Andros Epaminondas, Helen Ford, Norman Gay, Dr. Gundry, Peter Hannon, Alan Harris, Margaret Heald, Nicholas Hill, Heinrich Himmler, Adolf Hitler, Fred Hugh, Harry Hutchinson, Katharina Kubrick, Viktor Lutze, Olive Mercer, Leslie Nye, Glenys O'Brien, George O'Gorman, Nat Pearn, Chalmers Peddie, Rex Rashley, Fred Real, Pat Roach, Henry Robert, Billy Russell, Winifred Sabine, Len Saunders, Shane Shelton, George Spence, Guy Standeven, Tom Sye, Arthur Tatler, Alec Wallis, Sister Watkins", "dbpedia_uri": "http://dbpedia.org/resource/A_Clockwork_Orange_(film)", "dbpedia_label": "A Clockwork Orange (film)"}, {"movielens_id": "181", "imdb_id": "0086190", "title": "Star Wars: Episode VI - Return of the Jedi", "plot": "After a daring mission to rescue Han Solo from Jabba the Hutt, the Rebels dispatch to Endor to destroy the second Death Star. Meanwhile, Luke struggles to help Darth Vader back from the dark side without falling into the Emperor's trap.", "genres": "Action, Adventure, Fantasy, Sci-Fi", "year": "1983", "rating": "8.3", "directors": "Richard Marquand", "cast": "Mark Hamill, Harrison Ford, Carrie Fisher, Billy Dee Williams, Anthony Daniels, Peter Mayhew, Sebastian Shaw, Ian McDiarmid, Frank Oz, James Earl Jones, David Prowse, Alec Guinness, Kenny Baker, Michael Pennington, Kenneth Colley, Michael Carter, Denis Lawson, Tim Rose, Dermot Crowley, Caroline Blakiston, Warwick Davis, Jeremy Bulloch, Femi Taylor, Annie Arbogast, Claire Davenport, Jack Purvis, Mike Edmonds, Jane Busby, Malcolm Dixon, Mike Cottrell, Nicolas Read, Adam Bareham, Jonathan Oliver, Pip Miller, Tom Mannion, Margo Apostolos, Ray Armstrong, Eileen Baker, Michael Henbury Ballan, Bobby Bell, Patty Bell, Alan Bennett, Sarah Bennett, Pamela Betts, Danny Blackner, Linda Bowley, Peter Burroughs, Debbie Lee Carrington, Maureen Charlton, Willie Coppen, Sadie Corre, Tony Cox, John Cumming, Jean D'Agostino, Luis De Jesus, Debbie Dixon, Margarita Farrell, Phil Fondacaro, Sal Fondacaro, Tony Friel, Daniel Frishman, John Ghavan, Michael Gilden, Paul Grant, Lydia Green, Lars Green, Pam Grizz, Andrew Herd, J.J. Jackson, Richard Jones, Trevor Jones, Glynn Jones, Karen Lay, John Lummiss, Nancy Maclean, Peter Mandell, Carole Morris, Stacie Nichols, Chris Nunn, Barbara O'Laughlin, Brian Orenstein, Harrell Parker Jr., John Pedrick, April Perkins, Ronnie Phillips, Katie Purvis, Carol Read, Nicholas Read, Diana Reynolds, Daniel Rodgers, Chris Romano, Dean Shackelford, Kiran Shah, Felix Silla, Linda Spriggs, Gerald Staddon, Josephine Staddon, Kevin Thompson, Kendra Wall, Brian Wheeler, Butch Wilhelm, Dalyn Chew, Celia Fushille-Burke, Mercedes Ngoh, Jennifer Jaffe, Philip Edward Alexy, Hazel Allen, Peter Allen, John Altman, Franki Anderson, Glyn Baker, Erik Bauersfeld, Dickey Beer, Ailsa Berk, Don Bies, Richard Bonehill, Darrell Brook, Russell Brook, Paul Brooke, Ben Burtt, Maurice Bush, Trevor Butterfield, Vivienne Chandler, David Church, Tony Clarkin, Harold Cole, Kenneth Coombs, Stephen Costantino, Sean Crawford, Adeal Crooms, Andy Cunningham, Ronny Cush, Daniel D'Arcy, Kim Davis, Peter Diamond, Mark Dodson, Michael Drew, Richard Driscoll, Tim Dry, Ian Durrant, Tracey Eddon, Douglas Farrell, Alan Flyng, Ernie Fosselius, Stuart Fox, Leroy Golding, David Gonzales, Isaac Grand, Anthony Guilding, Nelson Hall, Poppy Hands, Gordon Hann, Alan Harris, Mike Havord, Lynne Hazelden, Walter Henry, Frank Henson, Philip Herbert, Barrie Holland, Larry Holt, Gerald Home, Velma Horne, William Hoyland, Colin Hunt, Carolyn Irving, Jasper Jacob, Monty Jordan, Michael Josephs, Paul Klein, Eiji Kusuhara, Larin Lahr, Anthony Lang, Arnold Lee, Julius LeFlore, Richard Lentz, Swee Lim, John Maloney, Paul Markham, Richard Marquand, Hilton McRae, George Miller, Billy J. Mitchell, Ralph G. Morse, Ann Murray, Terence Mustoo, Amanda Noar, Jack Orris, Quentin Pierre, Mike Quinn, Barry Robertson, Richard Robinson, Peter Ross-Murray, Kipsang Rotich, Deep Roy, Peter Roy, Terry Sach, Errol Shaker, Tina Simmons, John Simpkin, Timothy Sinclair, Anthony Smee, Hugh Spight, Paul Springer, Guy Standeven, Tony Star, Michael Stevens, David Stone, Phil Tippett, Marolyn Turk, John Tynan, Jules Walter, Larry Ward, Robert Watts, Pat Welsh, Paul Weston, Corey Dee Williams, Simon J. Williamson", "dbpedia_uri": "http://dbpedia.org/resource/Star_Wars_Episode_VI:_Return_of_the_Jedi", "dbpedia_label": "Star Wars Episode VI: Return of the Jedi"}, {"movielens_id": "182", "imdb_id": "0099685", "title": "Goodfellas", "plot": "The story of 'Henry Hill' (qv) and his life in the mob, covering his relationship with his wife Karen Hill and his mob partners Jimmy Conway and Tommy DeVito in the Italian-American crime syndicate.", "genres": "Biography, Crime, Drama", "year": "1990", "rating": "8.7", "directors": "Martin Scorsese", "cast": "Robert De Niro, Ray Liotta, Joe Pesci, Lorraine Bracco, Paul Sorvino, Frank Sivero, Tony Darrow, Mike Starr, Frank Vincent, Chuck Low, Frank DiLeo, Henny Youngman, Gina Mastrogiacomo, Catherine Scorsese, Charles Scorsese, Suzanne Shepherd, Debi Mazar, Margo Winkler, Welker White, Jerry Vale, Julie Garfield, Christopher Serrone, Elaine Kagan, Beau Starr, Kevin Corrigan, Michael Imperioli, Robbie Vinton, Johnny Williams, Daniel P. Conte, Tony Conforti, Frank Pellegrino, Ronald Maccone, Tony Sirico, Joseph D'Onofrio, Steve Forleo, Richard Dioguardi, Frank Adonis, John Manca, Joseph Bono, Katherine Wallach, Mark Jacobs, Angela Pietropinto, Marianne Leone, Marie Michaels, LoNardo, Melissa Prophet, Illeana Douglas, Susan Varon, Elizabeth Whitcraft, Clem Caserta, Samuel L. Jackson, Fran McGee, Paul Herman, Edward McDonald, Edward Hayes, Daniela Barbosa, Gina Mattia, Joel Calendrillo, Anthony Valentin, Edward D. Murphy, Michael Citriniti, Peter Hock, Erasmus C. Alfano, John Di Benedetto, Manny Alfaro, Thomas Lowry, Margaret Smith, Richard Mullally, Frank Albanese, Paul McIsaac, Bob Golub, Louis Eppolito, Tony Lip, Mikey Black, Peter Cicale, Anthony Powers, Vincent Pastore, Anthony Alessandro, Victor Colicchio, Mike Contessa, Philip Suriano, Paul Mougey, Norman Barbera, Anthony Polemeni, James Quattrochi, Lawrence Sacco, Dino Laudicina, Thomas E. Camuti, Andrew Scudiero, Irving Welzer, Jesse Kirtzman, Russell Halley, Spencer Bradley, Bob Altman, Joanna Bennett, Gayle Lewis, Gaetano Lisi, Luke Walter, Ed Deacy, Larry Silvestri, John 'Cha Cha' Ciarcia, Vito Picone, Janis Corsair, Frank Aquilino, Lisa D'Apolito, Michael Calandrino, Vito Antuofermo, Vito Balsamo, Peter Fain, Vincent Gallo, Gaetano LoGiudice, Garry Pastore, Nicole Burdette, Stella Keitel, Dominique DeVito, Michaelangelo Graziano, Paula Kcira, Nadine Kay, Tony Ellis, Peter Onorati, Jamie De Roy, Joel Blake, H. Clay Dear, Thomas Hewson, Gene Canfield, Margaux Guerard, Violet Gaynor, Tobin Bell, Berlinda Tolbert, Nancy Cassaro, Adam Wandt, Joe Gioco, Isiah Whitlock Jr., Alyson Jones, Ruby Gaynor, Bo Dietl, Steve Baker, Lisa Bostnar, Linda Carola, Anthony Caso, Frank Cassini, Joe Chiaramonte, Lionel Douglass, Doug Ferony, Frank Ferruccio, George Gerard, Matthew T. Gitkin, Richard Goteri, Debbee Hinchcliffe, Al Jolson, Diane Kimbrell, Anibal O. Lleras, Joseph Oliveira, Charles Pendelton, Louis Perez, Jeffrey Rollins, Colette Savage, Robert Sedona, Jill Senter, Barry Squitieri, Drew Stanley, Frank Stellato, Billy L. Sullivan, Nick Vallelonga", "dbpedia_uri": "http://dbpedia.org/resource/Goodfellas", "dbpedia_label": "Goodfellas"}, {"movielens_id": "186", "imdb_id": "0080455", "title": "The Blues Brothers", "plot": "Jake Blues, just released from prison, puts together his old band to save the Catholic home where he and his brother Elwood were raised.", "genres": "Action, Adventure, Comedy, Crime, Music, Musical", "year": "1980", "rating": "7.9", "directors": "John Landis", "cast": "Tom Erhart, Gerald Walling, John Belushi, Walter Levine, Frank Oz, Dan Aykroyd, Kathleen Freeman, Cab Calloway, Donald Dunn, Alonzo Atkins, James Brown, Chaka Khan, Southern California Community Choir, Armand Cerami, Steven Williams, Stephen Bishop, Carrie Fisher, John Landis, Kristi Oleson, Gary McLarty, Joe Cuttone, Layne Britton, John Candy, Toni Fleming, Murphy Dunne, Steve Cropper, Willie Hall, Tom Malone, Judith Belushi-Pisano, Rosie Shuster, Alan Rubin, Paul Reubens, Ben Piazza, Gwen Banta, Lari Taylor, Cindy Fisher, Elizabeth Hoy, Tony M. Conde, Henry Gibson, Eugene J. Anthony, Dean Hill, Gary Houston, Jack Orend, Gene Schuldt, Charles Mountain, John Lee Hooker, Walter Horton, Pinetop Perkins, Willie 'Big Eyes' Smith, Luther 'Guitar Jr.' Johnson, Calvin 'Fuzz' Jones, Aretha Franklin, Lou Marini, Matt Murphy, Carolyn Franklin, Brenda Bryant Corbett, Margaret Branch, Ray Charles, De'voreaux White, Sheilah Wells, Jeff Morris, Lou Perryman, Stan Mazin, Charles Napier, Russ Bruzek, Blair Burrows, Jack Callahan, Gene Janson, Gil Pearson, Steve Lawrence, Aaron Jais, Lemetrius Daniels, Jeff Cahill, Curt Clendenin, Steve Cruz, Leonard Daniels, Sean Hayden, Babatunde Myers, Gary Patzik, J. Bernard Walton, Butch Williams, Wally Engelhardt, Twiggy, Michael Klenfner, Ralph Foody, Leonard R. Garner Jr., Andrew Goodman, Eddy Donno, Steven Spielberg, Joe Walsh, Shirley Levine, Paul Butler, James Avery, Philip Bartlett, Luis Contreras, David Daniel, Raven De La Croix, Michael DeBartolo, James DuMont, Brent Dunsford, Tony Farella, Ryan Folsey, Walter Grant III, Gary Greene, George Holmes, James Huffman, Kevin Huotari, D'Janine King-Lasky, Cynthia Kinman, Jeff Lawrence, Paul LeClair, Norman Matlock, Richard Morava, Mr. T, Sam Nickens, Joni Palmer, Dan Pattarson, Scott Perry, Vicki Petite, Bruce Pobanz, Leoda Richards, John Ring, Arnold Roberts, Steven Rozic, George Sasaki, George Simmons, Paul Swearingen, Bill Telfer, Paul Van", "dbpedia_uri": "http://dbpedia.org/resource/The_Blues_Brothers_(film)", "dbpedia_label": "The Blues Brothers (film)"}, {"movielens_id": "194", "imdb_id": "0070735", "title": "The Sting", "plot": "Two grifters team up to pull off the ultimate con.", "genres": "Comedy, Crime, Drama", "year": "1973", "rating": "8.3", "directors": "George Roy Hill", "cast": "Paul Newman, Robert Redford, Robert Shaw, Charles Durning, Ray Walston, Eileen Brennan, Harold Gould, John Heffernan, Dana Elcar, Jack Kehoe, Dimitra Arliss, Robert Earl Jones, James Sloyan, Charles Dierkop, Lee Paul, Sally Kirkland, Avon Long, Arch Johnson, Ed Bakey, Brad Sullivan, John Quade, Larry D. Mann, Leonard Barr, Paulene Myers, Joe Tornatore, Jack Collins, Tom Spratley, Kenneth O'Brien, Ken Sansom, Ta-Tanisha, William 'Billy' Benedict, Jack Berle, Nick Borgani, Patricia Bratcher, Robert Brubaker, Robert Buckingham, Peter Paul Eastman, Richard Elmore, Bob Folkerson, Kathleen Freeman, Susan French, Sig Frohlich, Ralph Gambina, Clarke Gordon, Jack Griffin, Bob Harks, George Holmes, Sid Kane, Bruce Kimball, Mike Lally, Alexander Lockwood, Tom McDonough, Jim Michael, Chuck Morrell, Byron Morrow, Richard Niehaus, Jessica Rains, Al Roberts, Edwin Rochelle, Clark Ross, Pearl Shear, Arthur Tovey, Guy Way", "dbpedia_uri": "http://dbpedia.org/resource/The_Sting", "dbpedia_label": "The Sting"}, {"movielens_id": "196", "imdb_id": "0097165", "title": "Dead Poets Society", "plot": "Maverick teacher John Keating uses poetry to embolden his boarding school students to new heights of self-expression.", "genres": "Comedy, Drama", "year": "1989", "rating": "8.1", "directors": "Peter Weir", "cast": "Robin Williams, Robert Sean Leonard, Ethan Hawke, Josh Charles, Gale Hansen, Dylan Kussman, Allelon Ruggiero, James Waterston, Norman Lloyd, Kurtwood Smith, Carla Belver, Leon Pownall, George Martin, Joe Aufiery, Matt Carey, Kevin Cooney, Jane Moore, Lara Flynn Boyle, Colin Irving, Alexandra Powers, Melora Walters, Welker White, Steve Mathios, Alan Pottinger, Pamela Burrell, Allison Hedges, Christine D'Ercole, John Cunningham, Debra Mooney, John Martin Bradley, Charles Lord, Kurt Leitner, Richard Stites, James J. Christy, Catherine Soles, Hoover Sutton, James Donnell Quinn, Simon Mein, Ashton W. Richards, Robert Gleason, Bill Rowe, Robert J. Zigler III, Keith Snyder, Nicholas K. Gilhool, Jonas Stiklorius, Craig Johnson, Chris Hull, Jason Woody, Sam Stegeman, Andrew Hill, Serena Ebhardt, Joel Fogel, Newton Gilchrist, Barry Godin, Kate Kearney-Patch, Jamie Kennedy, Nancy Kirk, Stephen Podolak, Jeffrey Santoro, James R. Stoddard", "dbpedia_uri": "http://dbpedia.org/resource/Dead_Poets_Society", "dbpedia_label": "Dead Poets Society"}, {"movielens_id": "198", "imdb_id": "0100263", "title": "Nikita", "plot": "Convicted felon, _Nikita_ (qv), isn't going to jail; she's given a new identity and trained, stylishly, as a top secret spy/assassin.", "genres": "Action, Thriller", "year": "1990", "rating": "7.3", "directors": "Luc Besson", "cast": "Anne Parillaud, Marc Duret, Patrick Fontana, Alain Lathière, Laura Chéron, Jacques Boudet, Helene Aligier, Pierre-Alain de Garrigues, Patrick Pérez, Bruno Randon, Vincent Skimenti, Roland Blanche, Joseph Teruel, Jacques Disses, Stéphane Fey, Philippe Dehesdin, Michel Brunot, Rodolph Freytt, Pavel Slabý, Tchéky Karyo, Jean-Luc Caron, Rénos Mandis, Jean-Marc Merchet, Jeanne Moreau, Philippe Leroy, Patrick Serrière, Iska Khan, Heike Fisher, Patrick Buiquangda, Eddie Gaydu, Jose Steinmann, Philippe Hernando, Gérard Touratier, Jean Bedin, Edith Perret, Jean-Hugues Anglade, Jean-Pierre Pauty, Michel Campa, Murray Gronwall, Pierrick Charpentier, Rafael Sultan, Hubert Gillet, Fausto Costantino, Roberto Talanno, Pétronille Moss, Eric Prat, Mia Frye, Olivier Hémon, Philippe du Janerand, Christian Gazio, Jérôme Chalou, Jean Reno, Jean-Claude Bolle-Reddat, Jean Bouise, Patrick Chauveau, Maurice Antoni, Mathieu Archer, Alexis Dupuy, Michèle Amiel, Guy Van Riet, Xavier Bonastre", "dbpedia_uri": "http://dbpedia.org/resource/Nikita_(film)", "dbpedia_label": "Nikita (film)"}, {"movielens_id": "200", "imdb_id": "0081505", "title": "The Shining", "plot": "A family heads to an isolated hotel for the winter where a sinister presence influences the father into violence, while his psychic son sees horrific forebodings from both past and future.", "genres": "Drama, Horror", "year": "1980", "rating": "8.4", "directors": "Stanley Kubrick", "cast": "Jack Nicholson, Shelley Duvall, Danny Lloyd, Scatman Crothers, Barry Nelson, Philip Stone, Joe Turkel, Anne Jackson, Tony Burton, Lia Beldam, Billie Gibson, Barry Dennen, David Baxt, Manning Redwood, Lisa Burns, Louise Burns, Robin Pappas, Alison Coleridge, Burnell Tucker, Jana Shelden, Kate Phelps, Norman Gay, Pauline Chamberlain, Ina Clare, Maxwell Craig, Paul Desbois, Lynda Fisher, Charlie Gray, Aidan Harrington, Alan Harris, George Holdcroft, Barrie Holland, Vivian Kubrick, Aileen Lewis, Bertha Lynn, Derek Lyons, Peter McNamara, Cathy Munroe, Eddie O'Dea, Chris Parsons, Glenn Rinker, Bunny Seaman, Guy Standeven, Reg Thomason", "dbpedia_uri": "http://dbpedia.org/resource/The_Shining_(film)", "dbpedia_label": "The Shining (film)"}, {"movielens_id": "203", "imdb_id": "0105695", "title": "Unforgiven", "plot": "Retired Old West gunslinger William Munny reluctantly takes on one last job, with the help of his old partner Ned Logan and a young man, The \"Schofield Kid.\"", "genres": "Drama, Western", "year": "1992", "rating": "8.2", "directors": "Clint Eastwood", "cast": "Clint Eastwood, Gene Hackman, Morgan Freeman, Richard Harris, Jaimz Woolvett, Saul Rubinek, Frances Fisher, Anna Thomson, David Mucci, Rob Campbell, Anthony James, Tara Frederick, Beverley Elliott, Liisa Repo-Martell, Josie Smith, Shane Meier, Aline Levasseur, Cherrilene Cardinal, Robert Koons, Ron White, Mina E. Mina, Henry Kope, Jeremy Ratchford, John Pyper-Ferguson, Jefferson Mappin, Walter Marsh, Garner Butler, Larry Reese, Blair Haynes, Frank C. Turner, Sam Karas, Lochlyn Munro, Ben Cardinal, Philip Maurice Hayes, Michael Charrois, William Davidson, Paul Anthony McLean, James Herman, Michael Maurer, Larry Joshua, George Orrison, Greg Goossen", "dbpedia_uri": "http://dbpedia.org/resource/Unforgiven", "dbpedia_label": "Unforgiven"}, {"movielens_id": "204", "imdb_id": "0088763", "title": "Back to the Future", "plot": "Marty McFly, a 17-year-old high school student, is accidentally sent thirty years into the past in a time-traveling DeLorean invented by his close friend, the eccentric scientist Doc Brown.", "genres": "Adventure, Comedy, Sci-Fi", "year": "1985", "rating": "8.5", "directors": "Robert Zemeckis", "cast": "Michael J. Fox, Christopher Lloyd, Lea Thompson, Crispin Glover, Thomas F. Wilson, Claudia Wells, Marc McClure, Wendie Jo Sperber, George DiCenzo, Frances Lee McCain, James Tolkan, J.J. Cohen, Casey Siemaszko, Billy Zane, Harry Waters Jr., Donald Fullilove, Lisa Freeman, Cristen Kauffman, Elsa Raven, Will Hare, Ivy Bethune, Jason Marin, Katherine Britton, Jason Hervey, Maia Brewton, Courtney Gains, Richard L. Duran, Jeff O'Haco, Johnny Green, Jamie Abbott, Norman Alden, Read Morgan, Sachi Parker, Robert Krantz, Gary Riley, Karen Petrasek, George 'Buck' Flower, Tommy Thomas, Granville 'Danny' Young, David Harold Brown, Lloyd L. Tolbert, Paul Hanson, Lee Brownfield, Robert DeLapp, Charles L. Campbell, Kiki Ebsen, Randy Feelgood, Hal Gausman, Deborah Harmon, D'Janine King-Lasky, Huey Lewis, John McCook, Richard Patrick, Tony Pope, Eric Stoltz, Ethel Sway, Tom Tangen, Arthur Tovey, Tom Willett", "dbpedia_uri": "http://dbpedia.org/resource/Back_to_the_Future", "dbpedia_label": "Back to the Future"}, {"movielens_id": "208", "imdb_id": "0072431", "title": "Young Frankenstein", "plot": "An American grandson of the infamous scientist, struggling to prove that his grandfather was not as insane as people believe, is invited to Transylvania, where he discovers the process that reanimates a dead body.", "genres": "Comedy", "year": "1974", "rating": "8.0", "directors": "Mel Brooks", "cast": "Gene Wilder, Peter Boyle, Marty Feldman, Madeline Kahn, Cloris Leachman, Teri Garr, Kenneth Mars, Richard Haydn, Liam Dunn, Danny Goldman, Oscar Beregi Jr., Arthur Malet, Richard A. Roth, Monte Landis, Rusty Blitz, Anne Beesley, Gene Hackman, John Madison, John Dennis, Rick Norman, Rolfe Sedan, Terence Pushman, Randolph Dobbs, Norbert Schiller, Pat O'Hara, Michael Fox, Lidia Kristen, Ian Abercrombie, Leon Askin, Benjie Bancroft, Mel Brooks, Robert Cole, Lou Cutell, Peter Paul Eastman, Sig Frohlich, Michael J. Grayson, Peter Halton, Bob Harks, Lars Hensen, George Holmes, Kathryn Janssen, Michael Jeffers, Dale Johnson, Berry Kroeger, Ethelreda Leopold, Bob Liddle, John Marlin, Jeff Maxwell, John Hugh McKnight, Ernesto Molinari, Monty O'Grady, Tony Regan, Leoda Richards, Clark Ross, Paul Russell, Maida Severn, Norman Stevans, Arthur Tovey, Clement von Franckenstein, Max Wagner", "dbpedia_uri": "http://dbpedia.org/resource/Young_Frankenstein", "dbpedia_label": "Young Frankenstein"}, {"movielens_id": "217", "imdb_id": "0103874", "title": "Dracula", "plot": "The centuries old vampire Count _Dracula_ (qv) comes to England to seduce his barrister Jonathan Harker's fiancée Mina Murray and inflict havoc in the foreign land.", "genres": "Horror", "year": "1992", "rating": "7.4", "directors": "Francis Ford Coppola", "cast": "Gary Oldman, Winona Ryder, Anthony Hopkins, Keanu Reeves, Richard E. Grant, Cary Elwes, Billy Campbell, Sadie Frost, Tom Waits, Monica Bellucci, Michaela Bercu, Florina Kendrick, Jay Robinson, I.M. Hobson, Laurie Franks, Maud Winchester, Octavian Cadia, Robert Getz, Dagmar Stansova, Eniko Öss, Nancy Linehan Charles, Tatiana von Fürstenberg, Jules Sylvester, Hubert Wells, Daniel Newman, Honey Lauren, Judi Diamond, Robert Buckingham, Cully Fredricksen, Ele Bardha, Alain Blazevic, Mark Borkowski, Mary Cornell, Tina Cote, Christina Fulton, Jeffery Thomas Johnson, John F. Kearney, Paul Klar, Michael Laren, Moreen Littrell, Joe Murkijanian, Paul Muterspaugh, Adamo Palladino, Philip Pucci, John Michael Quinn, Heidi Schooler, Damon Stout", "dbpedia_uri": "http://dbpedia.org/resource/Bram_Stoker's_Dracula_(1992_film)", "dbpedia_label": "Bram Stoker's Dracula (1992 film)"}, {"movielens_id": "218", "imdb_id": "0101540", "title": "Cape Fear", "plot": "A convicted rapist, released from prison after serving a fourteen-year sentence, stalks the family of the lawyer who originally defended him.", "genres": "Crime, Thriller", "year": "1991", "rating": "7.3", "directors": "Martin Scorsese", "cast": "Robert De Niro, Nick Nolte, Jessica Lange, Juliette Lewis, Joe Don Baker, Robert Mitchum, Gregory Peck, Martin Balsam, Illeana Douglas, Fred Thompson, Zully Montero, Craig Henne, Forest Burton, Edgar Allan Poe IV, Rod Ball, W. Paul Bodie, Joel Kolker, Antoni Corone, Tamara Jones, Roger Pretto, Parris Buckner, Margot Moreland, Will Knickerbocker, Robert L. Gerlach, Bruce E. Holdstein, Richard Wasserman, Paul Nagle Jr., Paul Froehler, Mary Ellen O'Brien, Jody Wilson, C.C. Costigan, Domenica Cameron-Scorsese, Gar Stephen, Billy D. Lucas, Ken Collins, Linda Perri, Libby Moyer, Catherine Scorsese, Charles Scorsese, Jackie Davis, George Grafas, Esther Rolle, Ken Waters", "dbpedia_uri": "http://dbpedia.org/resource/Cape_Fear_(1991_film)", "dbpedia_label": "Cape Fear (1991 film)"}, {"movielens_id": "226", "imdb_id": "0099423", "title": "Die Hard 2", "plot": "John McClane attempts to avert disaster as rogue military operatives seize control of Dulles International Airport in Washington, D.C.", "genres": "Action, Thriller", "year": "1990", "rating": "7.1", "directors": "Renny Harlin", "cast": "Bruce Willis, Bonnie Bedelia, William Atherton, Reginald VelJohnson, Franco Nero, William Sadler, John Amos, Dennis Franz, Art Evans, Fred Thompson, Tom Bower, Sheila McCarthy, Don Harvey, Tony Ganios, Peter Nelson, Robert Patrick, Mick Cunningham, John Leguizamo, Tom Verica, John Costelloe, Vondie Curtis-Hall, Mark Boone Junior, Ken Baldwin, Danny Weselis, Jeff Langton, Gregg Kovan, Danial Donai, Don Charles McGovern, Bob 'Rocky' Cheli, Vincent Mazella Jr., Dale Jacoby, Patrick O'Neal, Ben Lemon, Jason Ross-Azikiwe, Anthony Droz, Michael Francis Clarke, Steve Pershing, Tom Everett, Sherry Bilsing, Karla Tamburrelli, Jeanne Bates, Colm Meaney, Stephen Gregory Foster, James Lancaster, Amanda Hillwood, Felicity Waterman, Alan Berger, Vance Valencia, Gilbert Garcia, Julian Reyes, Richard Domeier, David Katz, Robert Lipton, Rob Steinberg, Paul Abascal, John Rubinow, Bob Braun, Dominique Jennings, Carol Barbee, Jerry E. Parrott, Martin Lowery, Robert Sacchi, Dick McGarvin, Edward Gero, Stafford Morgan, Robert J. Bennett, Nick Angotti, Jim Hudson, Tom Finnegan, Thomas Tofel, Earl Houston Bullock, Wynn Irwin, Rande Scott, Ken Smolka, Robert Costanzo, Lauren Letherer, Connie Lillo-Thieman, Ed DeFusco, Charles Lanyer, Bill Smillie, Dwayne Hargray, John Cade, Paul Bollen, Joseph Michael Roth, David Willis Sr., George Fisher, Dean Wein, Dru Berrymore, Robert M. Bouffard, Jorga Caye, Scott Cranford, Reggie Squirt Luck, Michael Luggio, Russell McConnell, Antonino Garcia Tony, Mark Van Woert, Dana Vargas, James Wellington", "dbpedia_uri": "http://dbpedia.org/resource/Die_Hard_2", "dbpedia_label": "Die Hard 2"}, {"movielens_id": "228", "imdb_id": "0084726", "title": "Star Trek II: The Wrath of Khan", "plot": "With the assistance of the Enterprise crew, Admiral Kirk must stop an old nemesis, Khan Noonien Singh, from using the life-generating Genesis Device as the ultimate weapon.", "genres": "Action, Adventure, Sci-Fi", "year": "1982", "rating": "7.7", "directors": "Nicholas Meyer", "cast": "William Shatner, Leonard Nimoy, DeForest Kelley, James Doohan, Walter Koenig, George Takei, Nichelle Nichols, Bibi Besch, Merritt Butrick, Paul Winfield, Kirstie Alley, Ricardo Montalban, Ike Eisenmann, John Vargas, John Winston, Paul Kent, Nicholas Guest, Russell Takaki, Kevin Rodney Sullivan, Joel Marston, Teresa E. Victor, Dianne Harper, David Ruprecht, Marcy Vosburgh, Laura Banks, Harve Bennett, Steve Bond, Fletcher Bryant, Bobby Burns, Brett Baxter Clark, Tim Culbertson, Eddy Donno, Richard Forinash, John Gibson, James Horner, Dennis Landry, Cristian Letelier, Jeff McBride, Jeff McBride, Roger Menache, Tom Morga, Jim Painter, Nanci Rogers, Kimberly L. Ryusaki, George Sasaki, Judson Scott, John Bear Staible, Deney Terrio, Philip Weyland", "dbpedia_uri": "http://dbpedia.org/resource/Star_Trek_II:_The_Wrath_of_Khan", "dbpedia_label": "Star Trek II: The Wrath of Khan"}, {"movielens_id": "230", "imdb_id": "0092007", "title": "Star Trek IV: The Voyage Home", "plot": "To save Earth from an alien probe, Admiral James T. Kirk and his fugitive crew go back in time to San Francisco in 1986 to retrieve the only beings who can communicate with it: humpback whales.", "genres": "Action, Adventure, Comedy, Sci-Fi", "year": "1986", "rating": "7.3", "directors": "Leonard Nimoy", "cast": "William Shatner, Leonard Nimoy, DeForest Kelley, James Doohan, George Takei, Walter Koenig, Nichelle Nichols, Jane Wyatt, Catherine Hicks, Mark Lenard, Robin Curtis, Robert Ellenstein, John Schuck, Brock Peters, Michael Snyder, Michael Berryman, Mike Brislane, Grace Lee Whitney, Jane Wiedlin, Vijay Amritraj, Majel Barrett, Nick Ramus, Thaddeus Golas, Marty Pistone, Scott DeVenney, Viola Kates Stimpson, Phil Rubenstein, John Miranda, Joe Knowland, Bob Sarlatte, Everett Lee, Richard Harder, Alex Henteloff, Tony Edwards, Eve Smith, Tom Mustin, Greg Karas, Raymond Singer, David Ellenstein, Judy Levitt, Teresa E. Victor, James Menges, Kirk R. Thatcher, Jeff Lester, Joe Lando, Newell Tarrant, Mike Timoney, Jeffrey Martin, Joseph Naradzay, Donald W. Zautcke, Joe Adamson, Cynthia Brian, Jay Crimp, Monique DeSart, Michael DiMente, Stephen Liska, Joel Marston, Mary D. Mascari, John C. Moran Sr., Ralph Moratz, Kimberly L. Ryusaki, Anthony J Sacco, Layla Sarakalo, Melanie Shatner, Madge Sinclair, Philip Weyland", "dbpedia_uri": "http://dbpedia.org/resource/Star_Trek_IV:_The_Voyage_Home", "dbpedia_label": "Star Trek IV: The Voyage Home"}, {"movielens_id": "231", "imdb_id": "0103776", "title": "Batman Returns", "plot": "While Batman deals with a deformed man calling himself the Penguin wreaking havoc across Gotham with the help of a cruel businessman, a female employee of the latter becomes the Catwoman with her own vendetta.", "genres": "Action, Crime, Fantasy", "year": "1992", "rating": "7.0", "directors": "Tim Burton", "cast": "Michael Keaton, Danny DeVito, Michelle Pfeiffer, Christopher Walken, Michael Gough, Michael Murphy, Cristi Conaway, Andrew Bryniarski, Pat Hingle, Vincent Schiavelli, Steve Witting, Jan Hooks, John Strong, Rick Zumwalt, Anna Katarina, Gregory Scott Cummins, Erika Andersch, Travis McKenna, Doug Jones, Branscombe Richmond, Paul Reubens, Diane Salinger, Stuart Lancaster, Cal Hoffman, Joan Jurige, Rosie O'Connor, Sean Whalen, Erik Onate, Joey DePinto, Steven Brill, Neal Lerner, Ashley Tillman, Elizabeth Sanders, Henry Kingi, Joan Giammarco, Lisa Guerrero, Frank DiElsi, Biff Yeager, Robert Gossett, Adam Drescher, Bobby Bell, Niki Botelho, Susan Rossitto, Margarita Farrell, Denise Killpack, Felix Silla, Debbie Lee Carrington, Lena Banks, Cheryl Chambers, Darla, Anthony De Longis, Flame, Tyler House, Jeff Langton, Richard Lawrence, Robert McPhalen, Mindi Miller, Jeff Mulvin, Kristine Rose, Steffanie Siebrand, Desi Singh, Michael Sutherland, Mark Taormino, Oliver Theess", "dbpedia_uri": "http://dbpedia.org/resource/Batman_Returns", "dbpedia_label": "Batman Returns"}, {"movielens_id": "232", "imdb_id": "0096487", "title": "Young Guns", "plot": "A group of young gunmen, led by Billy the Kid, become deputies to avenge the murder of the rancher who became their benefactor. But when Billy takes their authority too far, they become the hunted.", "genres": "Action, Western", "year": "1988", "rating": "6.9", "directors": "Christopher Cain", "cast": "Emilio Estevez, Kiefer Sutherland, Lou Diamond Phillips, Charlie Sheen, Dermot Mulroney, Casey Siemaszko, Terence Stamp, Jack Palance, Terry O'Quinn, Sharon Thomas Cain, Geoffrey Blake, Alice Carter, Brian Keith, Thomas Callaway, Patrick Wayne, Lisa Banes, Sam Gauny, Cody Palance, Gadeek, Victor Izay, Allen Keller, Craig Erickson, Jeremy Lepard, Danny Kamin, Richela Renkun, Pat Finn-Lee, Gary Kanin, Forrest Broadley, Alan Tobin, Joey Hamlin, Loyd Lee Brown, Elena Parres, Tomas Moore, John Pattison, W. Thomas Snyder, Lee Sollenberger, Randy Travis", "dbpedia_uri": "http://dbpedia.org/resource/Young_Guns_(film)", "dbpedia_label": "Young Guns (film)"}, {"movielens_id": "233", "imdb_id": "0105690", "title": "Under Siege", "plot": "An ex-Navy Seal turned cook is the only person who can stop a group of terrorists when they seize control of a U.S. battleship.", "genres": "Action, Thriller", "year": "1992", "rating": "6.5", "directors": "Andrew Davis", "cast": "Steven Seagal, Damian Chapa, Troy Evans, David McKnight, Lee Hinton, Patrick O'Neal, Gary Busey, Glenn Morshower, Leo Alexander, John Rottger, Brad Rea, Michael Welden, Bernie Casey, Rickey Pierre, Raymond Cruz, Duane Davis, Tommy Lee Jones, Erika Eleniak, Colm Meaney, Eddie Bo Smith Jr., Richard Andrew Jones, Tom Reynolds, Tom Muzila, Kirk Burroughs, George Cheung, Jim Chimento, Craig Dunn, Daniel Dupont, Frank Ferrara, Adam James, Michael Gaylord James, Miguel Nino, David Webster, Gene Barge, Tony Brown, Hiram Bullock, Chris 'Hambone' Cameron, Richard Davis, Tad Robinson, Wendall Wayne Stewart, Tom Wood, Jerome Wiggins, Joseph F. Kosala, Ousaun Elam, Peewee Piemonte, Daniel H. Friedman, Gregory G. Stump, David U. Hodges, Bruce Bozzi, Craig Pinkard, Sandy Ward, Conrad E. Palmisano, Luis J. Silva, Michael Des Barres, Nate Robinson, Gary Gardner, Nick Mancuso, Andy Romano, Dru Anne Carlson, Ralph Wesley Carey, Joseph R. John, Dennis Lipscomb, Dale Dye, Robert Nichols, E. Daniel Corte Jr., Jamie Avera, Barbara Bush, George Bush, Dick Cheney, Tommy Gotti Coleman, Bennett Wayne Dean Sr., Craig Deroche, Edmund Druilhet, Tom Druilhet, Jamie Gliddon, Kane Hodder, Kamel Krifa, John Laughlin, Brett Murray, Robert D. Parham, Michael Sansom, Michael Tomaso, Diego Wallraff, Kevin Wayne", "dbpedia_uri": "http://dbpedia.org/resource/Under_Siege", "dbpedia_label": "Under Siege"}, {"movielens_id": "235", "imdb_id": "0116996", "title": "Mars Attacks!", "plot": "Earth is invaded by Martians with unbeatable weapons and a cruel sense of humor.", "genres": "Comedy, Sci-Fi", "year": "1996", "rating": "6.3", "directors": "Tim Burton", "cast": "Jack Nicholson, Glenn Close, Annette Bening, Pierce Brosnan, Danny DeVito, Martin Short, Sarah Jessica Parker, Michael J. Fox, Rod Steiger, Tom Jones, Lukas Haas, Natalie Portman, Jim Brown, Lisa Marie, Sylvia Sidney, Paul Winfield, Pam Grier, Jack Black, Janice Rivera, Ray J, Brandon Hammond, Joe Don Baker, O-Lan Jones, Christina Applegate, Brian Haley, Jerzy Skolimowski, Timi Prulhiere, Barbet Schroeder, Chi Hoang Cai, Tommy Bush, Joseph Maher, Gloria M. Malgarini, Betty Bunch, Gloria Hoffmann, Willie Garson, John Roselius, Michael Reilly Burke, Valerie Wildman, Richard Irving, Jonathan Emerson, Tamara 'Gingir' Curry, Rebecca Broussard, Vinny Argiro, Steve Valentine, Coco Leigh, Jeffrey King, Enrique Castillo, Don Lamoth, C. Wayne Owens, Joseph Patrick Moynihan, Roger Peterson, John Finnegan, Ed Lambert, John Gray, Gregg Daniel, J. Kenneth Campbell, Rance Howard, Jeanne Mori, Richard Assad, Velletta Carlson, Kevin Mangan, Rebeca Silva, Josh Philip Weinstein, Julian Barnes, Ken Thomas, Darelle Porter Holden, Christi Black, Sharon Hendrix, Frank Welker, Jim Beatty, John Bradley, Colleen Ann Brah, Greg Bronson, Mac Canepi, Maria Celeste Genitempo, Geri Gilmore, Matt Gulbranson, Roger Jackson, Anthony Kopczynski, Walter Ludwig, Johnny Mansbach, Stephanie Masoner, Scott McKinley, Bob Pepper, Kelly Lynn Richards, David Sherrill, Skeleton, William Victor Skrabanek, Alexandra Smothers, Jay So, Edward Tubbs, Carl Washington, Don Winsor", "dbpedia_uri": "http://dbpedia.org/resource/Mars_Attacks!", "dbpedia_label": "Mars Attacks!"}, {"movielens_id": "249", "imdb_id": "0118655", "title": "Austin Powers: International Man of Mystery", "plot": "A world-class playboy and part-time secret agent from the 1960s emerges after thirty years in a cryogenic state to battle with his nemesis Dr. Evil.", "genres": "Adventure, Comedy", "year": "1997", "rating": "7.0", "directors": "Jay Roach", "cast": "Mike Myers, Elizabeth Hurley, Michael York, Mimi Rogers, Robert Wagner, Seth Green, Fabiana Udenio, Mindy Sterling, Paul Dillon, Charles Napier, Will Ferrell, Joann Richter, Anastasia Sakelaris, Afifi Alaouie, Monet Mazur, Mark Bringelson, Clint Howard, Elya Baskin, Carlton Lee Russell, Daniel Weaver, Neil Mullarkey, Lea Sullivan, Chekesha Van Putten, Heather Marie Marsden, Sarah Christine Smith, Laura Payne-Gabriel, Joe Son, Tyde Kierny, Larry Thomas, Cheryl Bartel, Cindy Margolis, Donna W. Scott, Barbara Moore, Cynthia LaMontagne, Brian George, Kaye Wade, Steve Monroe, Vince Melocchi, Patrick Bristow, Jim McMullan, Robin Gammell, Ted Kairys, Burt Bacharach, Douglas Aarniokoski, Lana Antonova, Tom Arnold, Johnathan Brownlee, Kira Burt, Neill Calabro, Bruno Campolo, Lois Chiles, Lisa Danielle, Elwood Edwards, Carrie Fisher, Dan Frenkel, Joe Grisaffi, Susanna Hoffs, Richard Joel, Stuart D. Johnson, Mike Judge, Sergio Kato, Hannah Kozak, Erik Liberman, Rob Lowe, Michael McDonald, John Michael, Alex Morissen, Stephane Nicoli, Cheri Oteri, Gwenda Perez, Ben Scott, John-Clay Scott, Christian Slater, Matthew Sweet, Patricia Tallman, Andreanna Veith, Isabella Vosmikova, Sterling Wolfe", "dbpedia_uri": "http://dbpedia.org/resource/Austin_Powers:_International_Man_of_Mystery", "dbpedia_label": "Austin Powers: International Man of Mystery"}, {"movielens_id": "250", "imdb_id": "0119116", "title": "The Fifth Element", "plot": "In the colorful future, a cab driver unwittingly becomes the central figure in the search for a legendary cosmic weapon to keep Evil and Mr. Zorg at bay.", "genres": "Action, Adventure, Sci-Fi", "year": "1997", "rating": "7.7", "directors": "Luc Besson", "cast": "Bruce Willis, Gary Oldman, Ian Holm, Milla Jovovich, Chris Tucker, Luke Perry, Brion James, Tom Lister Jr., Lee Evans, Charlie Creed-Miles, Tricky, John Neville, John Bluthal, Mathieu Kassovitz, Christopher Fairbank, Kim Chan, Richard Leaf, Julie T. Wallace, Al Matthews, Maïwenn, John Bennett, Ivan Heng, Sonita Henry, Tim McMullan, Hon Ping Tang, George Khan, John Hughes, Roberto Bryce, Said Talidi, Clifton Lloyd Bryan, Justin Lee Burrows, Richard Ashton, Jerome St. John Blake, Kevin Molloy, Bill Reimbold, Colin Brooks, Anthony Chinn, Sam Douglas, Derek Ezenagu, David Kennedy, David Barrass, Roger Monk, Mac McDonald, Mark Seaton, Jean-Luc Caron, Riz Meedin, Jerry Ezekiel, Indra Ové, Nicole Merry, Stacey McKenzie, Rachel Willis, Genevieve Maylam, Josie Perez, Natasha Brice, Sophia Goth, Martin McDougall, Pete Dunwell, Paul Priestley, Jason Salkey, Stewart Harvey-Wilson, David Fishley, Carlton Chance, Gin Clarke, Vladimir McCrary, Aron Paramor, Alan Ruscoe, Christopher Adamson, Eve Salvail, Kaleem Janjua, Tyrone Tyrell, Kevin Brewerton, Vincenzo Pellegrino, Ian Beckett, Sonny Caldinez, Zeta Graff, Eddie Ellwood, Yui, Laura De Palma, Michael Culkin, Lenny McLean, Robert Oates, John Sharian, Fred Williams, Sibyl Buck, Sarah Carrington, Ali Yassine, Sean Buckley, Dane Messam, Nathan Hamlett, Cecil Cheng, Scott Woods, Leon Dekker, David Garvey, Stanley Kowalski, Omar Williams, Robert Clapperton, Robert Alexander, Mia Frye, Leo Williams, C. Keith Martin, J.D. Dawodu, Patrick Nicholls, Shaun Davis, Roy Garcia, Alex Georgijev, Marie Guillard, Renee Montemayor, Stina Richardson, Gillian Berrow, Geoff Boothby, Kristen Fick, François Guillaume, Fitz Hall, Anita Koh, Kamay Lau, Inva Mula, Jill Mullan, Tracy Redington, Gito Santana, Frank Senger, Joss Skottowe, Fred Wood, Roger Wright", "dbpedia_uri": "http://dbpedia.org/resource/The_Fifth_Element", "dbpedia_label": "The Fifth Element"}, {"movielens_id": "258", "imdb_id": "0118884", "title": "Contact", "plot": "Dr. Ellie Arroway, after years of searching, finds conclusive radio proof of extraterrestrial intelligence, sending plans for a mysterious machine.", "genres": "Drama, Mystery, Sci-Fi, Thriller", "year": "1997", "rating": "7.5", "directors": "Robert Zemeckis", "cast": "Jena Malone, David Morse, Jodie Foster, Geoffrey Blake, William Fichtner, Sami Chester, Timothy McNeil, Laura Elena Surillo, Matthew McConaughey, Tom Skerritt, Henry Strozier, Max Martini, Larry King, Thomas Garner, Conroy Chino, Dan Gifford, James Woods, Vance Valencia, Angela Bassett, Donna Kelley, Leon Harris, Claire Shipman, Behrooz Afrakhan, Saemi Nakamura, Maria Celeste Arraras, Tabitha Soren, Geraldo Rivera, Ian Whitcomb, Jay Leno, Natalie Allen, Robert D. Novak, Geraldine A. Ferraro, Ann Druyan, Rob Lowe, Jake Busey, Kathleen Kennedy, Michael Albala, Ned Netterville, Leo Lee, John Hurt, William Jordan, David St. James, Jill Dougherty, Haynes Brooke, John Holliman, Bobbie Battista, Dee Dee Myers, Bryant Gumbel, Linden Soles, Steven Ford, Alexander Zemeckis, Janie Peterson, Philippe Bergeron, Jennifer Balgobin, Anthony Hamilton, Rebecca T. Beucler, Marc Macaulay, Pamela Wilsey, Tucker Smallwood, Jeffery Thomas Johnson, Yuji Okumoto, Gerry Griffin, Brian Alston, Rob Elk, Mark Thomason, José Rey, Todd Patrick Breaugh, Alex Veadov, Alice Kushida, Robin Gammell, Richardson Morse, Seiji Okamura, Bernard Shaw, Mak Takano, Hiroshi Tom Tanaka, Catherine Dao, Kristoffer Ryan Winters, Valorie Armstrong, Jim Hild, William L. Thomas, Diego Montoya, Jonathan Adler, Robert Aguilar Jr., Neil Armstrong, Mark Bailey, Matt Bennett, Tony Boldi, Christopher Boyer, Christine Brady, Ray Buffer, Mark Byrne, Candice T. Cain, Aixa Clemente, Bill Clinton, Derrick Damions, Elaina Erika Davis, Joey Dente, Michael Egan, Jeff Elmore, Pamela Fischer, Carl Gilliard, Adolf Hitler, William B. Kaplan, Martin Luther King, Boris Lee Krutonog, Ming Lo, Sunshine Logroño, Denise Loveday, Douglas MacArthur, Neal Matarazzo, Joseph McCarthy, Cassidy McMillan, Molly Mueller, Richard Nixon, Paul L. Nolan, Marisa Petroro, Errica Poindexter, J.A. Preston, Frank Principe, Billy Quinn, Thomas Reid, Leo Rogstad, Franklin D. Roosevelt, Russell Sanderlin Sr., Kelli Schloemer, Frank Silva, John A. Taylor, Todd Thompson, Cenk Uygur, Holly Cross Vagley, Richard Allen Waite, Eric Alan Wendell, Delaney Williams, Gregory L. Williams, Walter Winchell", "dbpedia_uri": "http://dbpedia.org/resource/Contact_(1992_film)", "dbpedia_label": "Contact (1992 film)"}, {"movielens_id": "259", "imdb_id": "0119190", "title": "George of the Jungle", "plot": "A man raised in the jungle by apes falls in love with a wealthy American heiress.", "genres": "Action, Adventure, Comedy, Family, Romance", "year": "1997", "rating": "5.5", "directors": "Sam Weisman", "cast": "Brendan Fraser, Leslie Mann, Thomas Haden Church, Richard Roundtree, Greg Cruttwell, Abraham Benrubi, Holland Taylor, Kelly Miracco, John Bennett Perry, John Cleese, Michael Chinyamurindi, Abdoulaye NGom, Lydell M. Cheshier, Keith Scott, Spencer Garrett, Jon Pennell, Lauren Bowles, Afton Smith, Samantha Harris, Joseph, Kaleb, Bongo, Tai, Tookie, Scooper, Hopper, Binx, Zakery, Emely, Nicholas Kadi, Hans Schoeber, Alexander Denk, Sven-Ole Thorsen, Rodney Louis Johnson, Peter F. Giddings, Terilyn Joe, Michel Camus, Valerie Perri, Willie Brown, Carrie Zanoline, Garrett Griffin, Harve Cook, Richard Elfman, Noah John Cardoza, Benjamin John Cardoza, Denise Holland, Anne Fletcher, Kristie Capozzoli, Sal Vassalo, Melanie Gage, Aurorah Allain, Diane Mizota, Lisa Ratzin, Joie Shettler, Sharon Ferrol-Young, Tara Nicole Hughes, Robin Tasha-Ford, Margo Blas, Jake Gentry, Tim Glenn, Jewel McDonald, Crystal the Monkey, Bob Quinn, Mary Ann Schmidt", "dbpedia_uri": "http://dbpedia.org/resource/George_of_the_Jungle_(film)", "dbpedia_label": "George of the Jungle (film)"}, {"movielens_id": "268", "imdb_id": "0118842", "title": "Chasing Amy", "plot": "Holden and Banky are comic book artists. Everything's going good for them until they meet Alyssa, also a comic book artist. Holden falls for her, but his hopes are crushed when he finds out she's a lesbian.", "genres": "Comedy, Drama, Romance", "year": "1997", "rating": "7.2", "directors": "Kevin Smith", "cast": "Ethan Suplee, Ben Affleck, Scott Mosier, Jason Lee, Casey Affleck, Dwight Ewell, Joey Lauren Adams, Guinevere Turner, Carmen Llywelyn, Brian O'Halloran, Matt Damon, Alexander Goebbel, Tony Torn, Rebecca Waxman, Paris Petrick, Welker White, Kelli Simpkins, John Willyung, Tse-Mach Washington, Ernest O'Donnell, Jason Mewes, Kevin Smith, Kristin Mosier, Virginia Smith, Mike Allred, Illeana Douglas, 'Krazy Joe' Fiore, Walter Flanagan, Monica Hampton, Robert Hawk, Brian Jude, John Launder, Brian Lynch, Jeff Millstein, Vincent Pereira, Joe Quesada, Damian Young", "dbpedia_uri": "http://dbpedia.org/resource/Chasing_Amy", "dbpedia_label": "Chasing Amy"}, {"movielens_id": "269", "imdb_id": "0119164", "title": "The Full Monty", "plot": "Six unemployed steel workers form a male striptease act. The women cheer them on to go for \"the full monty\" - total nudity.", "genres": "Comedy, Drama", "year": "1997", "rating": "7.2", "directors": "Peter Cattaneo", "cast": "Robert Carlyle, Mark Addy, Wim Snape, Steve Huison, Tom Wilkinson, Paul Barber, Hugo Speer, Lesley Sharp, Emily Woof, Deirdre Costello, Paul Butterworth, Dave Hill, Bruce Jones, Andrew Livingston, Vinny Dhillon, Kate Layden, Joanna Swain, Diane Lane, Kate Rutter, June Broughton, Glenn Cunningham, Chris Brailsford, Steve Garti, Malcolm Pitt, Dennis Blanch, Daryl Fishwick, David Lonsdale, Muriel Hunte, Fiona Watts, Theresa Maduemezia, Fiona Nelson, The British Steel Stocksbridge Band, Marie Jackman, Arnold Montey, Enn Reitel, Elaine Young", "dbpedia_uri": "http://dbpedia.org/resource/The_Full_Monty", "dbpedia_label": "The Full Monty"}, {"movielens_id": "276", "imdb_id": "0113627", "title": "Leaving Las Vegas", "plot": "Ben Sanderson, a Hollywood screenwriter who lost everything because of his alcoholism, arrives in Las Vegas to drink himself to death. There, he meets and forms an uneasy friendship and non-interference pact with prostitute Sera.", "genres": "Drama, Romance", "year": "1995", "rating": "7.5", "directors": "Mike Figgis", "cast": "Nicolas Cage, Elisabeth Shue, Julian Sands, Richard Lewis, Steven Weber, Kim Adams, Emily Procter, Stuart Regen, Valeria Golino, Graham Beckel, Albert Henderson, Shashi Bhatia, Carey Lowell, Anne Lange, Thomas Kopache, Vincent Ward, Lucinda Jenney, French Stewart, Ed Lauter, Waldemar Kalinowski, Mike Figgis, David Kriegel, Bill Thompson, Marek Stabrowski, R. Lee Ermey, Mariska Hargitay, Danny Huston, Laurie Metcalf, David Brisbin, Shawnee Smith, Paul Quinn, Julian Lennon, Tracy Thorne, Bob Rafelson, Susan Barnes, Marc Coppola, Michael A. Goorjian, Jeremy Jordan, Davidlee Willson, Xander Berkeley, Sergio Premoli, Gordon Michaels, Lou Rawls, Sunit Gupta, Camille King", "dbpedia_uri": "http://dbpedia.org/resource/Leaving_Las_Vegas", "dbpedia_label": "Leaving Las Vegas"}, {"movielens_id": "284", "imdb_id": "0117918", "title": "Tin Cup", "plot": "A washed up golf pro working at a driving range tries to qualify for the US Open in order to win the heart of his successful rival's girlfriend.", "genres": "Comedy, Drama, Romance, Sport", "year": "1996", "rating": "6.4", "directors": "Ron Shelton", "cast": "Kevin Costner, Rene Russo, Don Johnson, Cheech Marin, Linda Hart, Dennis Burkley, Rex Linn, Lou Myers, Richard Lineback, George Perez, Mickey Jones, Michael Milhoan, Gary McCord, Craig Stadler, Peter Jacobsen, Jim Nantz, Ken Venturi, Ben Wright, Frank Chirkinian, Lance Barrow, Brian Hammons, Mike Ritz, Peter Kostis, Jimmy Roberts, George Michael, Kris Ancira, Sharyn McCreedy, Gregory Avellone, Kevin Wilson, Susan A. Cabral, Del Roy, Sanford Gibbons, Arina Gasanova, Bill Caplan, Sharon Costner, Bill Costner, Joe Costner, Rob Harris, Nick Kiriazis, Tom Todoroff, Frederick Lewis, Jess King, Harold G. Herthum, William Utay, Allan Malamud, Melissa Young, Steven 'Sven' Lewison, Brad Britton, Corey Pavin, Phil Mickelson, Fred Couples, Jerry Pate, Lee Janzen, Billy Mayfair, Steve Elkington, John Cook, Andrew Magee, David Ogrin, John Mahaffey, Jeff Maggert, D.A. Weibring, Blaine McCallister, Tom Purtzer, Bruce Lietzke, Tommy Armour III, Gregory Buff White, Mike Standly, Jim McLean, Howard Twitty, Amy Alcott, Leon Alvarado, Charlotte Biggs, Charles Barton Bollfrass, Kevin Bowe, James Cotner, Margaret Dane, David Dman Escobar, Nikki Giavasis, William E. Johnson III, Randall Kahn, Vivian Kalinov, Will Klipstine, Amy Rene LaFavers, Jason Lessler, Johnny McCarthy, Johnny Miller, Debbie Overbey, Cliff Owens, Barrett Rakestraw, Mark \"Jeff\" Reed, Jennifer Sciole, Graham Sibley, Barry Strickland, Chaz Taylor, Jen Taylor, Mark Thomason, Darren VanCleef, Aaron Walden", "dbpedia_uri": "http://dbpedia.org/resource/Tin_Cup", "dbpedia_label": "Tin Cup"}, {"movielens_id": "285", "imdb_id": "0117589", "title": "Secrets & Lies", "plot": "Following the death of her adoptive parents, a successful young black optometrist establishes contact with her biological mother -- a lonely white factory worker living in poverty in East London.", "genres": "Comedy, Drama", "year": "1996", "rating": "8.0", "directors": "Mike Leigh", "cast": "Timothy Spall, Phyllis Logan, Brenda Blethyn, Claire Rushbrook, Marianne Jean-Baptiste, Elizabeth Berrington, Michele Austin, Lee Ross, Lesley Manville, Ron Cook, Emma Amos, Brian Bovell, Trevor Laird, Clare Perkins, Elias Perkins McCook, Jane Mitchell, Janice Acquah, Keylee Jade Flanders, Hannah Davis, Terence Harvey, Kate O'Malley, Joe Tucker, Richard Syms, Grant Masters, Annie Hayes, Jean Ainslie, Daniel Smith, Lucy Sheen, Frances Ruffelle, Felix Manley, Nitin Ganatra, Metin Marlow, Amanda Crossley, Su Elliot, Di Sherlock, Alex Squires, Lauren Squires, Sade Squires, Dominic Curran, Stephen Churchett, David Neilson, Peter Stockbridge, Peter Waddington, Rachel Lewis, Paul Trussell, Denise Orita, Margery Withers, Theresa Watson, Gordon Winter, Jonny Coyne, Bonzo, Texas, Peter Wight, Gary McDonald, Alison Steadman, Liz Smith, Sheila Kelley, Angela Curran, Linda Beckett, Phil Davis, Wendy Nottingham, Anthony O'Donnell, Ruth Sheen, Mia Soteriou, Andie Hicks, Anna Pernicci", "dbpedia_uri": "http://dbpedia.org/resource/Secrets_&_Lies_(film)", "dbpedia_label": "Secrets & Lies (film)"}, {"movielens_id": "289", "imdb_id": "0116250", "title": "Evita", "plot": "The hit musical based on the life of 'Eva Perón' (qv) (_Evita_ (qv) Duarte), a B-picture Argentinian actress who eventually became the wife of Argentinian president 'Juan Domingo Perón' (qv), and the most beloved and hated woman in Argentina.", "genres": "Biography, Drama, History, Musical", "year": "1996", "rating": "6.3", "directors": "Alan Parker", "cast": "Madonna, Antonio Banderas, Jonathan Pryce, Jimmy Nail, Victoria Sus, Julian Littman, Olga Merediz, Laura Pallas, Julia Worsley, María Luján Hidalgo, Servando Villamil, Andrea Corr, Peter Polycarpou, Gary Brooker, Maite Yerro, Adrià Collado, Gabriel Kraisman, Martin Drogo, Venesa Weis, Veronica Ferrari Risler, Aldana García Soler, Domingo Chiofalo, Ismael Osorio, Lidia Catalano, John Coverdale, Roderick Hart, Ian Hill, Rob Levy, Teddy Peiro, Joe Townsend, Mark Ryan, Gordon Neville, Frederick Warder, Albin Pahernik, Luca Tommassini, Denis Tremblay, Éva Vári, Zsanett Farkas, Sergio Lerer, Mara Bestelli, Mónica Lairana, Bettina Menegazzo, Laura Miller, Marcelo Alejandro Auchelli, Luis Alday, Luis Boccia, Vera Fogwill, Alfredo Martín, Diego Leske, Francisco Nápoli, Eduardo Ruderman, Fabián Stratas, David Henry, Fernando Agustín Henin, Alan Parker, Denis Lill, Balázs Tardy, Nick Holder, Brian Cobby, George Little, Ana Justo, Victor Satchwell, Sally Bourne, Rachel Izen, Susan Raasay, Nickolas Grace, Peter Hughes, John Gower, Charles Lewsen, Ian Good, Troy Jackson, Marcos Woinsky, András Komlós, Ricardo Aliaga, Eileen Booth, John Byrnes, Iris Christy, Ina Clare, Anna De Freitas, Alison Del Rio, Eduardo del Río, Dan Dorlin, Anne Frankel, Els Gevaert, Fabiana Giudicotti, Diomar Giraldo, Edward Grundy, Jackie Hall, Peter Jessup, Asad Khan, Geoff Lambert, Barry Levhar, Richard Marcel, Lawrence Merry, Tony Meredith, Osvaldo Hector Miranda, Myriam Ojedo, Kerry Ribchester, Peta Roby, Carmela Romero, Warren Smith, Diana Syrat, Ariadne C. Villareal, Mem Ferda, Maria Bergman, Harry Fielder, Alexander Hall, Csaba Kelemen, Tony Lima, Héctor Malamud, Anahí Martella, Billie Piper, Jorge Sabate, Gábor Salinger, Lucinda Rhodes Thakrar, Norberto Trujillo, Tamás Wandracsek", "dbpedia_uri": "http://dbpedia.org/resource/Evita_(film)", "dbpedia_label": "Evita (film)"}, {"movielens_id": "290", "imdb_id": "0119115", "title": "Fierce Creatures", "plot": "Zookeepers struggle to deal with the policies of changing directors.", "genres": "Comedy", "year": "1997", "rating": "6.4", "directors": "Fred Schepisi, Robert Young", "cast": "John Cleese, Jamie Lee Curtis, Kevin Kline, Michael Palin, Ronnie Corbett, Carey Lowell, Robert Lindsay, Bille Brown, Derek Griffiths, Cynthia Cleese, Richard Ridings, Maria Aitken, Michael Percival, Fred Evans, Lisa Hogan, Choy-Ling Man, Tim Potter, Jenny Galloway, Kim Vithana, Sean Francis, Julie Saunders, Susie Blake, Pat Keen, Denis Lill, Gareth Hunt, Ron Donachie, Paul Haigh, Kenneth Price, Leon Herbert, Stewart Wright, Kerry Shale, Mac McDonald, Amanda Walker, Terence Conoley, Tom Georgeson, John Bardon, Anthony Pedley, Jennie Goossens, Georgia Reece, Hilary Gish, Brian King, Peter Silverleaf, Kevin Moore, Leslie Lowe, Iain Mitchell, Valerie Edmond, Nick Bartlett, Ricco Ross, Kate Harper, Nicholas Hutchison, Kate Alderton, Jack Davenport, Jo Ann Geary, William Grove, Francis Pope, Jacqui Marchant-Adams, Grahame Wood, John Alexander, Peter Elliott, Tessa Crockett, Phillip Hill, Holly Hoffman, Mario Kalli, Tina Maskell, Elizabeth O'Brien, Ailsa Berk, Robert Firth, Holli Hoffman, Noah Lee Margetts, John Shearer, Tina Simmons, John Triplett", "dbpedia_uri": "http://dbpedia.org/resource/Fierce_Creatures", "dbpedia_label": "Fierce Creatures"}, {"movielens_id": "292", "imdb_id": "0120036", "title": "Rosewood", "plot": "A dramatization of a 1923 horrific racist lynch mob attack on an African-American community.", "genres": "Action, Drama, History", "year": "1997", "rating": "7.2", "directors": "John Singleton", "cast": "Jon Voight, Ving Rhames, Don Cheadle, Bruce McGill, Loren Dean, Esther Rolle, Elise Neal, Robert Patrick, Michael Rooker, Catherine Kellner, Akosua Busia, Paul Benjamin, Kevin Jackson, Mark Boone Junior, Muse Watson, Badja Djola, Kathryn Meisle, Jaimz Woolvett, James Edward Coleman II, Tristan Hook, Benea Ousley, Isabell O'Connor, Bridgid Coulter, Gabie Chavis, Vanessa Baden, Marcus Barrington, Matthew Davison, Brett Rice, Ric Reitz, Ken Sagoes, Phil Moore, Lowell Fenner, Andrew 'J.R.' Tarver, Harold G. Crawford, Marc Macaulay, Clarence Thomas, Blaine Farmer, Valerie Herald, Susan Gallagher, Steven Tyler, Danny Hanemann, Eldrid Foye, Michael Galloway, Macon McCalman, Tom Schuster, Peggy Sheffield, Steve Raulerson, Henry Laurence, Flint Beverage, Jeff Greer, Micah May, Matt Mitchell, Mindy Meriweather Morton, Katie Seeley, Wesley Smith, Michael Wayne Thomas, Todd Thompson, Kokoa Woodget Aubert", "dbpedia_uri": "http://dbpedia.org/resource/Rosewood_(film)", "dbpedia_label": "Rosewood (film)"}, {"movielens_id": "293", "imdb_id": "0119008", "title": "Donnie Brasco", "plot": "An FBI undercover agent infiltrates the mob and finds himself identifying more with the mafia life, at the expense of his regular one.", "genres": "Biography, Crime, Drama", "year": "1997", "rating": "7.7", "directors": "Mike Newell", "cast": "Al Pacino, Johnny Depp, Michael Madsen, Bruno Kirby, James Russo, Anne Heche, Zeljko Ivanek, Gerry Becker, Robert Miano, Brian Tarantina, Rocco Sisto, Zach Grenier, Walt MacPherson, Ronnie Farer, Terry Serpico, Gretchen Mol, Tony Lip, George Angelica, Val Avery, Madison Arnold, Delanie Fitzpatrick, Katie Sagona, Sara Gold, Larry Romano, Tim Blake Nelson, Paul Giamatti, James McCauley, James Bulleit, Andrew Parks, Keenan Shimizu, Rocco Musacchia, Joe Francis, Sal Jenco, Billy Capucilli, Laura Cahill, Doreen Murphy, Elle Alexander, Denise Faye, Elaine del Valle, John Horton, Dan Brennan, LaJuan Carter, Sandy Barber, Joyce Stovall, Frank Pesce, Randy Jurgensen, John Di Benedetto, Richard Zavaglia, Tony Ray Rossi, Edward Black, Gaetano LoGiudice, Carmelo Musacchia, Pat Vecchio, Caleb, Flint Beverage, Frank Bonsangue, Mark Todd Bruner, Gregory D'Angelo, Christopher Del Gaudio, Stephen Emirzian, Teresa Giudice, Barry Hirschberg, Jim Lavin, Jeff Millstein, James Morricone, Peter O'Hara, Davell j Owens, Antone Pagán, Lisa Panagos, Garry Pastore, Felicia Peluso, Dale Resteghini, Larry Tobias, Vinny Vella, Edward Williams", "dbpedia_uri": "http://dbpedia.org/resource/Donnie_Brasco_(film)", "dbpedia_label": "Donnie Brasco (film)"}, {"movielens_id": "301", "imdb_id": "0119360", "title": "In & Out", "plot": "A midwestern teacher questions his sexuality after a former student makes a comment about him at the Academy _Awards_ (qv).", "genres": "Comedy, Romance", "year": "1997", "rating": "6.4", "directors": "Frank Oz", "cast": "Kevin Kline, Joan Cusack, Tom Selleck, Matt Dillon, Debbie Reynolds, Wilford Brimley, Bob Newhart, Gregory Jbara, Shalom Harlow, Shawn Hatosy, Zak Orth, Lauren Ambrose, Alexandra Holden, Lewis J. Stadlen, Deborah Rush, J. Smith-Cameron, Kate McGregor-Stewart, Debra Monk, Ernie Sabella, John Cunningham, Gus Rogerson, Dan Hedaya, Joseph Maher, William Parry, William Duell, Richard Woods, Kevin Chamberlin, Wally Dunn, Larry Clarke, June Squibb, Alice Drummond, Mary Diveny, Anne Russell, Patrick Garner, Adam LeFevre, Bill Camp, Scott Robertson, John Christopher Jones, MacIntyre Dixon, Joanna Wolff, Chris McKenna, Mark Ballou, Charlie Newmark, Andrew Levitas, Jon Hershfield, D.J. Dierker, Seth Ullian, Greg Siff, Ryan Janis, Jane Hoffman, Becky Ann Baker, Bill Hoag, Daniel B. Canton, Selma Blair, Patricia Guinan, Nesbitt Blaisdell, Samantha Buck, Lauren Fox, Lizzy Mahon, Simone Marean, Michael McGruther, Niki Roma, Jacqueline Manning, Patrick Mylod, Virginia Williams, Joshua Wade, Jill Horner, Lauren Ward, Julie Entwisle, Clare Kramer, Miranda Kent, Tara Carnes, Arden Myrin, Ian Sherwood, Kevin Keating, Kathy Lyn Cavanaugh, Jo-Jo Lowe, Lisa Emery, Gary DeWitt Marshall, Marla Sucharetza, Ronald Rand, Ross de Marco, Joanne DiMauro, Tony Jones, Grace DeSena, Bruce Bennetts, Tracy Appleton, Jim Taylor McNickle, Laura Caulfield, Mimi Stuart, Dinah Gravel, Peter Barmonde, Anthony Ruivivar, Glenn Close, Stephanie Dale, Joy Decker, Charles Dumas, Whoopi Goldberg, Geoffrey Gould, Jeannette Gould, John F. Hall, Cara Jedell, Lloyd LeBaron, Jay Leno, Patrick Thomas McCarthy, Reid Mihalko, James M. Palombo, Ric Sechrest, Todd Stockman, Jovanna Vitiello, Valeria Von Leczycki Goncharova Barrett", "dbpedia_uri": "http://dbpedia.org/resource/In_&_Out", "dbpedia_label": "In & Out"}, {"movielens_id": "307", "imdb_id": "0118971", "title": "The Devil's Advocate", "plot": "An exceptionally adept Florida lawyer is offered a job at a high-end New York City law firm with a high-end boss - the biggest opportunity of his career to date.", "genres": "Drama, Mystery, Thriller", "year": "1997", "rating": "7.5", "directors": "Taylor Hackford", "cast": "Keanu Reeves, Al Pacino, Charlize Theron, Jeffrey Jones, Judith Ivey, Connie Nielsen, Craig T. Nelson, Tamara Tunie, Ruben Santiago-Hudson, Debra Monk, Vyto Ruginis, Laura Harrington, Pamela Gray, George Wyner, Chris Bauer, Connie Embesi, Jonathan Cavallary, Heather Matarazzo, Murphy Guyer, Leo Burmester, Bill Moor, Neal Jones, Eddie Aldridge, Mark Deakins, Rony Clanton, George Gore II, Alan Manson, Brian Poteat, Daniel Oreskes, Kim Chan, Caprice Benedetti, Don King, Ray Garvey, Rocco Musacchia, Susan Kellermann, James Saito, Harsh Nayyar, Mohammad Ghaffari, Nicki Cochrane, Fenja Klaus, Gino Lucci, Novella Nelson, Vincent Laresca, Benny Nieves, Franci Leary, Gloria Lynne Henry, Jorge Navarro, Tomatito, Antonio Vargas Cortés, Elena Camunez Andújar, Monica Keena, Linda Atkinson, William Hill, Juan Carlos Hernández, Wei Mei Wong, E. Katherine Kerr, Liza Harris, Bill Boggs, Bo Rucker, Michael Lombard, Marc Manfro, J. Nester, John Rothman, George Sperdakos, Hollis Granville, Edward Seamon, Patrick Joseph Byrnes, Gregory Lichtenson, Socorro Santiago, Marcia DeBonis, Marie Stuart Vassallo, Tom Riis Farrell, Harold Surratt, Alfonse D'amato, Charles A. Gargano, Lou Rudin, Ernie Grunfeld, Alan Grubman, Al Cerullo, Cadillac Moon, Rich Campbell, Cliff Hackford, Dave Noyes, Mike Nugent, Al Santoriello, Nikita Ager, Allan Wayne Anderson, Paul Benedict, Lauren Collins, Christopher Del Gaudio, Joyce Garland, Millena Gay, Roy Jones Jr., Christopher King, Omar Koury, Adrian Lee, Frank Licari, Delroy Lindo, Anibal O. Lleras, Cindy Malika, Dennis Mallen, Doris McCarthy, Dale Resteghini, Bonnie Rose, Todd Wall, Victor Warren", "dbpedia_uri": "http://dbpedia.org/resource/The_Devil's_Advocate_(1977_film)", "dbpedia_label": "The Devil's Advocate (1977 film)"}, {"movielens_id": "314", "imdb_id": "0118539", "title": "3 Ninjas: High Noon at Mega Mountain", "plot": "The three unstoppable Ninja brothers fight to save their hero (Hulk Hogan) and Mega Mountain Amusement Park from the vicious kid-hating Medusa (Loni Anderson).", "genres": "Action, Adventure, Comedy, Family", "year": "1998", "rating": "3.0", "directors": "Sean McNamara", "cast": "Hulk Hogan, Loni Anderson, Jim Varney, Mathew Botuchis, Michael O'Laskey II, James Paul Roeske II, Victor Wong, Alan McRae, Margarita Franco, Chelsey Earlywine, Lindsay Felton, Syntrell Ryder, Joseph Ackler, Brian Anglin, Kirk Baily, Travis McKenna, Brendan O'Brien, Dwayne Carrington, Pat Mahoney, Dan Shadwell, James Gale, Dawn Merrick, Lawrence E. Galleoos, Patrick Adamson, Roy Yerbey, Denis Berkfeldt, Holly Johnson, Rick Wiles, Jim Dirker, Charles Hudson, Robert Himber, Carl L. Williams, Jacquie Palisi, Craig Shugart, Emily Roeske, Michael Vecqueray, Aimee J. Nelson, Craig Price, Ed Anderson, Mary Jasionowski, Jeff Krebs, Greg Backstrom, Kenneth Hogue, J. Bryan Morse, Andrea Zondler, Anthony Fiorino, Duke Jackson, Henry Pawlak, Kim Richard Draves, Julian Brewster, Andrea Hessig, Donevon Martinez, Ryan Gardner Smith, Mark Swanson", "dbpedia_uri": "http://dbpedia.org/resource/3_Ninjas:_High_Noon_at_Mega_Mountain", "dbpedia_label": "3 Ninjas: High Noon at Mega Mountain"}, {"movielens_id": "318", "imdb_id": "0108052", "title": "Schindler's List", "plot": "In German-occupied Poland during World War II, industrialist 'Oskar Schindler' (qv) gradually becomes concerned for his Jewish workforce after witnessing their persecution by the Nazis.", "genres": "Biography, Drama, History", "year": "1993", "rating": "8.9", "directors": "Steven Spielberg", "cast": "Liam Neeson, Ben Kingsley, Ralph Fiennes, Caroline Goodall, Jonathan Sagall, Embeth Davidtz, Malgorzata Gebel, Shmuel Levy, Mark Ivanir, Béatrice Macola, Andrzej Seweryn, Friedrich von Thun, Krzysztof Luft, Harry Nehring, Norbert Weisser, Adi Nitzan, Michael Schneider, Miri Fabian, Anna Mucha, Albert Misak, Michael Gordon, Aldona Grochal, Jacek Wójcicki, Beata Paluch, Piotr Polk, Ezra Dagan, Beata Deskur, Rami Heuberger, Leopold Kozlowski, Jerzy Nowak, Uri Avrahami, Adam Siemion, Magdalena Dandourian, Pawel Delag, Shabtai Konorti, Oliwia Dabrowska, Henryk Bista, Tadeusz Bradecki, Wojciech Klata, Elina Löwensohn, Ewa Kolasinska, Bettina Kupfer, Grzegorz Kwas, Vili Matula, Stanislaw Koczanowicz, Hans-Jörg Assmann, Geno Lechner, August Schmölzer, Ludger Pistor, Beata Rybotycka, Branko Lustig, Artus Maria Matthiessen, Hans-Michael Rehberg, Eugeniusz Priwieziencew, Michael Z. Hoffmann, Erwin Leder, Jochen Nickel, Andrzej Welminski, Daniel Del-Ponte, Marian Glinka, Grzegorz Damiecki, Stanislaw Brejdygant, Olaf Lubaszenko, Haymon Maria Buttinger, Peter Appiano, Jacek Pulanecki, Tomasz Dedek, Slawomir Holland, Martin Semmelrogge, Tadeusz Huk, Alexander Held, Piotr Cyrwus, Joachim Paul Assböck, Osman Ragheb, Maciej Orlos, Marek Wrona, Zbigniew Kozlowski, Marcin Grzymowicz, Dieter Witting, Magdalena Komornicka, Agnieszka Krukówna, Anemona Knut, Jeremy Flynn, Agnieszka Wagner, Jan Jurewicz, Wieslaw Komasa, Maciej Kozlowski, Martin Bergmann, Wilhelm Manske, Peter Flechtner, Sigurd Bemme, Etl Szyc, Lucyna Zabawa, Ruth Farhi, Jerzy Sagan, Dariusz Szymaniak, Dirk Bender, Maciej Winkler, Radoslaw Krzyzowski, Jacek Lenczowski, Hanna Kossowska, Maja Ostaszewska, Sebastian Skalski, Ryszard Radwanski, Piotr Kadlcik, Lech Niebielski, Thomas Morris, Sebastian Konrad, Lidia Wyrobiec-Bank, Ravit Ferera, Agnieszka Korzeniowska, Dominika Bednarczyk, Alicja Kubaszewska, Danny Marcu, Hans Rosner, Edward Linde-Lubaszenko, Alexander Strobele, Georges Kern, Alexander Buczolich, Michael Schiller, Götz Otto, Wolfgang Seidenberg, Hubert Kramar, Razia Israeli, Dorit Seadia, Esti Yerushalmi, Marta Bizon, Eric Bruno Borgman, Blythe Daniel, Janek Dresner, Pamela Fischer, Ryszard Horowitz, Maciej Kowalewski, Kamil Krawiec, Zuzanna Lipiec, Bonnie Loev, Maria Peszek, Leopold Pfefferberg, Paul Rausmussen, Leopold Rosner, Emilie Schindler, Katarzyna Smiechowicz, Ben Talar, Katarzyna Tlalka, Harrison White", "dbpedia_uri": "http://dbpedia.org/resource/Schindler's_List", "dbpedia_label": "Schindler's List"}, {"movielens_id": "319", "imdb_id": "0116242", "title": "Everyone Says I Love You", "plot": "A New York girl sets her father up with a beautiful woman in a troubled marriage while her stepsister gets engaged.", "genres": "Comedy, Musical, Romance", "year": "1996", "rating": "6.7", "directors": "Woody Allen", "cast": "Edward Norton, Drew Barrymore, Diva Gray, Ami Almendral, Madeline Balmaceda, Vivian Cherry, Tommie Baxter, Jeff DeRocker, Cherylyn Jones, Tina Paul, Vikki Schnurr, Natasha Lyonne, Kevin Hagan, Alan Alda, Gaby Hoffmann, Natalie Portman, Lukas Haas, Trude Klein, Goldie Hawn, Itzhak Perlman, Navah Perlman, Barbara Hollander, John Griffin, Julia Roberts, Waltrudis Buck, Patrick Cranshaw, Isiah Whitlock Jr., Woody Allen, Edward Hibbert, Kevin Bogue, Colleen Dunn, Pamela Everett, Susan Misner, Gregory Mitchell, Dana Moore, Troy Myers, Joe Orrach, Michael O'Steen, Luis Martin Perez, Krissy Richmond, Frederick Rolf, Timothy Jerome, Daisy Prince, Linda Kuriloff, Helen Miles, Arlene Martell Martin, Rene Ceballos, Ruth Gottschall, Colton Green, Lisa LeGuillou, Joe Locarro, Monica McSwain, Jill Nicklaus, Andrew Pacho, John Selya, Myra Lucretia Taylor, Jo Telford, Paolo Seganti, Andrea Piedimonte Bodini, Robert Knepper, Billy Crudup, Robert Khakh, Tim Roth, Scotty Bloch, David Ogden Stiers, Gerry Burkhardt, Eileen Casey, Shelley Frankel, Fred Mann III, Kathy Sanson, Valda Setterfield, Frank Pietri, Robert Walker, Devalle Hayes, Damon McCloud, Tony Sirico, Ray Garvey, Tommy John, Lindsy Canuel, Richard Cummings, Kristen Pettet, Patrick Lavery, Christy Carlson Romano, Jonathan Giordano, Gabriel Millman, Ed Hodson, Michel Moinot, Don Correia, Sean Grant, Roland Hayes, Darren Lee, Delphine T. Mantz, Joanne McHugh, John Mineo, Cynthia Onrubia, Willie Rosario, Jerome Vivona, Nancy Ticotin, Emily Bindiger, Cindy Cobitt, Al Dana, Kevin De Simone, Paul Evans, Chrissy Faith, Jeff Lyons, Michael Mark, Jenna Miles, Robert Ragaini, Lenny Roberts, Annette Sanders, Terry Textor, Vanéese Y. Thomas, Ashley H. Wilkinson, Lisa Cangelosi, Chris Cardona, Malinda Farrington, Olivia Hayman", "dbpedia_uri": "http://dbpedia.org/resource/Everyone_Says_I_Love_You", "dbpedia_label": "Everyone Says I Love You"}, {"movielens_id": "322", "imdb_id": "0119731", "title": "Murder at 1600", "plot": "A young woman is murdered in the White House. Homicide detective Regis ('Wesley Snipes' (qv)) investigates while Secret Service works against him. He's assigned agent Chance ('Diane Lane' (qv)). She eventually cooperates after a man's framed.", "genres": "Action, Crime, Drama, Mystery, Thriller", "year": "1997", "rating": "6.1", "directors": "Dwight H. Little", "cast": "Wesley Snipes, Diane Lane, Daniel Benzali, Dennis Miller, Alan Alda, Ronny Cox, Diane Baker, Tate Donovan, Harris Yulin, Tom Wright, Nicholas Pryor, Charles Rocket, Nigel Bennett, Tamara Gorski, Douglas O'Keeffe, Tony Nappo, Mary Moore, George R. Robertson, Ho Chow, James Millington, John Bourgeois, Peter James Haworth, David Gardner, Cliff McMullen, Keith Williams, Grace Armas, David Fraser, George Sperdakos, Sandra Caldwell, Frank Moore, Richard Blackburn, James Gallanders, Victor Ertmanis, Richard Fitzpatrick, Michael Ricupero, Chris Gillett, J. Craig Sandy, Robert Bidaman, Carol Anderson, Christopher Kennedy, Michael Kinney, Mike Hambrick, Jackie Bensen, Maureen Bunyan, Kathryn Klvana, Dan Duran, Sheldon Turcott, Sandi Stahlbrand, Tom Urich, Tino Monte, Raven Dauda, Michael Dyson, Aron Tager, Doris E. McMillon, Lewis Grenville, Mo Kelso, Junior Williams, Howard Hoover, Bryan Renfro, Markus Parilo, Leigh Bianco, Len Wagner, Peter Ellery, Ray Paisley, Brian King, Donald Jones, Marco Bianco, Matt Birman, Eric Bryson, Walter Masko, Branko Racki, Mike Chute, Tye Tyukodi, Michael G. Brown, Lee Eskey, Babs Hopkinson, Steve Lucescu, Chris Northup, Aj Stoan, Ryan Weichel", "dbpedia_uri": "http://dbpedia.org/resource/Murder_at_1600", "dbpedia_label": "Murder at 1600"}, {"movielens_id": "323", "imdb_id": "0118928", "title": "Dante's Peak", "plot": "A vulcanologist arrives at a countryside town recently named the second most desirable place to live in America, and discovers that the long dormant volcano, _Dante's Peak_ (qv), may wake up at any moment.", "genres": "Action, Adventure, Thriller", "year": "1997", "rating": "6.0", "directors": "Roger Donaldson", "cast": "Pierce Brosnan, Linda Hamilton, Jamie Renée Smith, Jeremy Foley, Elizabeth Hoffman, Charles Hallahan, Grant Heslov, Kirk Trutner, Arabella Field, Tzi Ma, Brian Reddy, Lee Garlington, Bill Bolender, Carole Androsky, Peter Jason, Jeffrey L. Ward, Tim Haldeman, Walker Brandt, Hansford Rowe, Susie Spear Purcell, David Lipper, Heather Stephens, R.J. Burns, Tammy L. Smith, Christopher Murray, Justin Williams, Donna Ostrom, Tom Magnuson, Marilyn Leubner, Ed Stone, Adam William Douglas Bennett, Mike Butters, Ingo Neuhaus, Tod Rainey", "dbpedia_uri": "http://dbpedia.org/resource/Dante's_Peak", "dbpedia_label": "Dante's Peak"}, {"movielens_id": "329", "imdb_id": "0118966", "title": "Desperate Measures", "plot": "Frank Conner is an honest police officer who desperately needs to save his son's life. However, after losing all hope, he finds out that a criminal Peter McCabe in jail is his only savior.", "genres": "Action, Crime, Drama, Thriller", "year": "1998", "rating": "6.1", "directors": "Barbet Schroeder", "cast": "Michael Keaton, Andy Garcia, Brian Cox, Marcia Gay Harden, Erik King, Efrain Figueroa, Joseph Cross, Janel Moloney, Richard Riehle, Tracey Walter, Peter Weireter, Keith Diamond, Steve Park, Steven Schub, Neal Matarazzo, Dennis Cockrum, Charles Noland, Randy Thompson, Michael Shamus Wiles, Darren Pearce, Eric Tignini, Billy Kane, Christine Ashe, Donna M. Duffy, Troy Robinson, Robert Baier, David Flick, Joe Drago, Josh Kemble, Scott Colomby, Howard Meehan, Tim Kelleher, Cliff Fleming, Dana Kristen Vahle, Craig Hosking, Jack Gill, Scott Waugh, Danny Rogers, John Meier, Norman Howell, John Rottger, Donna Keegan, Jonathan Adler, Tony Amen, John Lizzi, Neil O'Neill, Elizabeth Ann Peternel, Dwayne Pintoff, Dan Rosenberg", "dbpedia_uri": "http://dbpedia.org/resource/Desperate_Measures_(film)", "dbpedia_label": "Desperate Measures (film)"}, {"movielens_id": "331", "imdb_id": "0119051", "title": "The Edge", "plot": "An intellectual billionaire and two other men struggle to band together and survive after getting stranded in the Alaskan wilderness with a blood-thirsty Kodiak Bear hunting them down.", "genres": "Action, Adventure, Drama, Thriller", "year": "1997", "rating": "6.9", "directors": "Lee Tamahori", "cast": "Anthony Hopkins, Alec Baldwin, Elle Macpherson, Harold Perrineau, Bart the Bear, L.Q. Jones, Kathleen Wilhoite, David Lindstedt, Mark Kiely, Eli Gabay, Larry Musser, Brian Arnold, Bob Boyd, Kelsa Kinsly, Gordon Tootoosis, Randy Birch, Lawrence Lefebvre, Bennato Pennella, Brian Steele", "dbpedia_uri": "http://dbpedia.org/resource/The_Edge_(1997_film)", "dbpedia_label": "The Edge (1997 film)"}, {"movielens_id": "333", "imdb_id": "0119174", "title": "The Game", "plot": "After a wealthy banker is given an opportunity to participate in a mysterious game, his life is turned upside down when he becomes unable to distinguish between the game and reality.", "genres": "Drama, Mystery, Thriller", "year": "1997", "rating": "7.8", "directors": "David Fincher", "cast": "Michael Douglas, Sean Penn, Deborah Kara Unger, James Rebhorn, Peter Donat, Carroll Baker, Anna Katarina, Armin Mueller-Stahl, Charles Martinet, Scott Hunter McGuire, Florentine Mocanu, Elizabeth Dennehy, Caroline Barclay, Daniel Schorr, John Aprea, Harrison Young, Kimberly Russell, Joe Frank, James Brooks, Gerry Becker, Jarion Monroe, Tommy Flanagan, Bill Flannery, Kat Kilkenny, John Cassini, Harris Savides, Aaron Lucich, Victor Talmadge, Marc Siegler, André Brazeau, Keena Turner, Carlos Hoy, Edward Campbell, Sean Lanthier, Curtis Vanterpool, Jay Gordon, Jeffrey Michael Young, Owen Masterson, Yuji Okumoto, Hideo Kimura, Rachel Flanagan, Mark Boone Junior, Joy Ann Ryan, Peter Davidian, Jack Kehoe, Christopher John Fields, Linda Manz, Vic Ferreira, Duffy Gaver, Bob Stephenson, Sean Moloney, John Hammil, Rachel Steinberg, George Maguire, Trish Summerville, Jason Kristofer, Lily Soh Froehlich, Tammy Koehler, Michael Lynwood, Alex Lynwood, Charles Branklyn, Spike Jonze, Michael Massee, Sara Davallou, Stephen Cowee, Gypsy Boots, Christopher Cory, Tom Crowl, Ted David, Bob Dini, Terence Ford, Will Jones, Anni Long, Tracie May-Wagner, Jamie Midgley, J. Anthony Pena, Bob Quinn, Elise Robins, Bob Scott, Jason Uson", "dbpedia_uri": "http://dbpedia.org/resource/The_Game_(1997_film)", "dbpedia_label": "The Game (1997 film)"}, {"movielens_id": "338", "imdb_id": "0118689", "title": "Bean", "plot": "The bumbling Mr. _Bean_ (qv) travels to America when he is given the responsibility of bringing a highly valuable painting to a Los Angeles museum.", "genres": "Adventure, Comedy, Family", "year": "1997", "rating": "6.5", "directors": "Mel Smith", "cast": "Rowan Atkinson, Peter MacNicol, John Mills, Pamela Reed, Harris Yulin, Burt Reynolds, Larry Drake, Danny Goldring, Johnny Galecki, Chris Ellis, Andrew Lawrence, Peter Egan, Peter Capaldi, June Brown, Peter James, Clive Corner, Rob Brownstein, Julia Pearlstein, Tom McGowan, Sandra Oh, Tricia Vessey, Alison Goldie, Dakin Matthews, Scott Charles, Thomas Mills, Ronnie Yeskel, Richard Gant, Priscilla Shanks, Richard Hicks, Gigi Fields, Lela Ivey, David Doty, Robert Curtis Brown, April Grace, Perry Anzilotti, Janni Brenn, Annette Helde, Richard Irving, Chris Lowe, Paul McMichael, Louis E. Rosas, Maridean Mansfield Shepard, Teddy, Reg Thomason", "dbpedia_uri": "http://dbpedia.org/resource/Bean_(film)", "dbpedia_label": "Bean (film)"}, {"movielens_id": "357", "imdb_id": "0073486", "title": "One Flew Over the Cuckoo's Nest", "plot": "A criminal pleads insanity and is admitted to a mental institution, where he rebels against the oppressive nurse and rallies up the scared patients.", "genres": "Drama", "year": "1975", "rating": "8.7", "directors": "Milos Forman", "cast": "Michael Berryman, Peter Brocco, Dean R. Brooks, Alonzo Brown, Scatman Crothers, Mwako Cumbuka, Danny DeVito, William Duell, Josip Elic, Lan Fendors, Louise Fletcher, Nathan George, Ken Kenny, Mel Lambert, Sydney Lassick, Kay Lee, Christopher Lloyd, Dwight Marfield, Ted Markland, Louisa Moritz, Jack Nicholson, William Redfield, Philip Roth, Will Sampson, Mimi Sarkisian, Vincent Schiavelli, Mews Small, Delos V. Smith Jr., Tin Welch, Brad Dourif, Aurore Clément, Bill Gratton, Anjelica Huston, Ingeborg Kjeldsen, Audrey Landers, Tom McCall, James V. Shore, Saul Zaentz", "dbpedia_uri": "http://dbpedia.org/resource/One_Flew_Over_the_Cuckoo's_Nest_(film)", "dbpedia_label": "One Flew Over the Cuckoo's Nest (film)"}, {"movielens_id": "360", "imdb_id": "0120529", "title": "Wonderland", "plot": "", "genres": "Documentary", "year": "1997", "rating": "7.0", "directors": "John O'Hagan", "cast": "Bill Griffith, John McGarr, Eddie Money", "dbpedia_uri": "http://dbpedia.org/resource/Wonderland_(1999_film)", "dbpedia_label": "Wonderland (1999 film)"}, {"movielens_id": "367", "imdb_id": "0112697", "title": "Clueless", "plot": "Shallow, rich and socially successful Cher is at the top of her Beverly Hills high school's pecking scale. Seeing herself as a matchmaker, Cher first coaxes two teachers into dating each other.", "genres": "Comedy, Romance", "year": "1995", "rating": "6.8", "directors": "Amy Heckerling", "cast": "Alicia Silverstone, Stacey Dash, Brittany Murphy, Paul Rudd, Donald Faison, Elisa Donovan, Breckin Meyer, Jeremy Sisto, Dan Hedaya, Aida Linares, Wallace Shawn, Twink Caplan, Justin Walker, Sabastian Rashidi, Herb Hall, Julie Brown, Susan Mohun, Nicole Bilderback, Ron Orbach, Sean Holland, Roger Kabler, Jace Alexander, Josh Lozoff, Carl Gottlieb, Joseph D. Reitman, Anthony Beninati, Micki Duran, Gregg Russell, Jermaine Montell, Danielle Eckert, Dicky Barrett, Marcello Bloisi, Christopher E. Cooper, Monica Eva Foster, Amy Heckerling, Pamela Holt, Michael Klesic, John Kricfalusi, Sam Macaroni, Craig Ponder, Bobbie Sunday Starr, Billy West", "dbpedia_uri": "http://dbpedia.org/resource/Clueless_(film)", "dbpedia_label": "Clueless (film)"}, {"movielens_id": "385", "imdb_id": "0111503", "title": "True Lies", "plot": "A fearless, globe-trotting, terrorist-battling secret agent has his life turned upside down when he discovers his wife might be having an affair with a used-car salesman while terrorists smuggle nuclear war heads into the United States.", "genres": "Action, Comedy, Thriller", "year": "1994", "rating": "7.2", "directors": "James Cameron", "cast": "Arnold Schwarzenegger, Jamie Lee Curtis, Tom Arnold, Bill Paxton, Tia Carrere, Art Malik, Eliza Dushku, Grant Heslov, Marshall Manesh, James Allen, Dieter Rauter, Jane Morris, Katsy Chappell, Crystina Wyler, Ofer Samra, Paul Barselou, Charles A. Tamburro, Jean-Claude Parachini, Uzi Gal, Majed Ibrahim, Armen Ksajikian, Mike Akrawi, Mike Cameron, Charles Cragin, Louai Mardini, Gino Salvano, Scott Dotson, Tom Isbell, John Bruno, Joe Abby, Sayed Badreya, Ray Buffer, Greg Chopoorian, Don Dailey, Max Daniels, Tony De Leon, Mary A. DeBriae, Elliot Durant III, Joan Quinn Eastman, Michael Garvey, Kim Giancaterino, Richard Givens, Charlton Heston, Loren Janes, Al Kamarr, Sergio Kato, Dave Knight, Takao Komine, Cassidy McMillan, Jody Millard, Douglas M. Nelson, Andre Nirmel, Joseph Oliveira, Erik Parillo, Manny Perry, Charlie Picerni, Dale Resteghini, William Shipman, Matt Sigloch, Aj Stoan, Mark Winn, Ryken Zane", "dbpedia_uri": "http://dbpedia.org/resource/True_Lies", "dbpedia_label": "True Lies"}, {"movielens_id": "393", "imdb_id": "0107614", "title": "Mrs. Doubtfire", "plot": "After a bitter divorce, an actor disguises himself as a female housekeeper to spend time with his children held in custody by his former wife.", "genres": "Comedy, Drama, Family", "year": "1993", "rating": "7.0", "directors": "Chris Columbus", "cast": "Robin Williams, Sally Field, Pierce Brosnan, Harvey Fierstein, Polly Holliday, Lisa Jakub, Matthew Lawrence, Mara Wilson, Robert Prosky, Anne Haney, Scott Capurro, Sydney Walker, Joe Bellan, Martin Mull, Terence McGovern, Karen Kahn, Eva Gholson, James Cunningham, Ralph Peduto, Scott Beach, Juliette Marshall, Drew Letchworth, Jessica Myerson, Sharon Lockwood, Jim Cullen, Kenneth Loo, Jeff Loo, Betsy Monroe, Joseph Narducci, James Cranna, Dr. Toad, Adele Proom, Rick Overton, Dan Spencer, Paul Guilfoyle, Molly McClure, Andy Prosky, William Newman, Christopher Pray, Geoff Bolt, Dick Bright, Adam Bryant, Tavia Cathcart, C. Beau Fitzsimons, Jeff Moeller, Benne Alder, Laura Collins, Margaret de Jesus, Raja Gosnell, Garrett Griffin, Smadar Hanson, Marshal Hilton, Mary Mackey, Erika Pearson, Tim Silano, Nikky Smedley", "dbpedia_uri": "http://dbpedia.org/resource/Mrs._Doubtfire", "dbpedia_label": "Mrs. Doubtfire"}, {"movielens_id": "402", "imdb_id": "0099653", "title": "Ghost", "plot": "After a young man is murdered, his spirit stays behind to warn his lover of impending danger, with the help of a reluctant psychic.", "genres": "Drama, Fantasy, Romance, Thriller", "year": "1990", "rating": "7.1", "directors": "Jerry Zucker", "cast": "Patrick Swayze, Demi Moore, Tony Goldwyn, Stanley Lawrence, Christopher J. Keene, Susan Breslau, Martina Deignan, Rick Kleber, Macka Foley, Rick Aviles, Phil Leeds, John Hugh, Sam Tsoutsouvas, Sharon Breslau, Vincent Schiavelli, Angelina Estrada, Armelia McQueen, Gail Boggs, Whoopi Goldberg, Thom Curley, Stephen Root, Laura Drake, Augie Blunt, Alma Beltran, Vivian Bonnell, Derek Thompson, J. Christopher Sullivan, Charlotte Zucker, Tom Finnegan, Bruce Jarchow, Sondra Rubin, Faye Brenner, William Cort, Minnie Summers Lindsey, Mabel Lockridge, Said Faraj, William L. Arance, Arsenio Hall, Steven-Charles Jaffe, Mike Jittlov, Billy Marshall Thompson, Burton Zucker", "dbpedia_uri": "http://dbpedia.org/resource/Ghost_(1990_film)", "dbpedia_label": "Ghost (1990 film)"}, {"movielens_id": "423", "imdb_id": "0083866", "title": "E.T. the Extra-Terrestrial", "plot": "A troubled child summons the courage to help a friendly alien escape Earth and return to his home world.", "genres": "Family, Sci-Fi", "year": "1982", "rating": "7.8", "directors": "Steven Spielberg", "cast": "Dee Wallace, Henry Thomas, Peter Coyote, Robert MacNaughton, Drew Barrymore, K.C. Martel, Sean Frye, C. Thomas Howell, Erika Eleniak, David M. O'Dell, Richard Swingler, Frank Toth, Robert Barton, Michael Darrell, David Berkson, David Carlberg, Milt Kogan, Alexander Lampone, Rhoda Makoff, Robert Murphy, Richard Pesavento, Tom Sherry, Susan Cameron, Will Fowler Jr., Barbara Hartnett, Diane Lampone, Mary Stein, Mitch Suskin, Corey Burton, Ted Grossman, Jean-Paul Hellendall, Kevin Jessup, James Kahn, Michael Lepre, Anne Lockhart, Melissa Mathison, Gary Ordog, Chuck Riley, Robert W. Scholler, Quinn Smith, Jonathan Wasserberger, Richard S. Weisman, Pat Welsh, Debra Winger", "dbpedia_uri": "http://dbpedia.org/resource/E.T._the_Extra-Terrestrial", "dbpedia_label": "E.T. the Extra-Terrestrial"}, {"movielens_id": "432", "imdb_id": "0032455", "title": "Fantasia", "plot": "A collection of animated interpretations of great works of Western classical music.", "genres": "Animation, Family, Fantasy, Music, Musical", "year": "1940", "rating": "7.7", "directors": "James Algar, Samuel Armstrong, Ford Beebe Jr., Norman Ferguson, David Hand, Jim Handley, T. Hee, Wilfred Jackson, Hamilton Luske, Bill Roberts, Paul Satterfield, Ben Sharpsteen", "cast": "Deems Taylor, Leopold Stokowski, The Philadelphia Orchestra, Corey Burton, Walt Disney, Hugh Douglas, James MacDonald, Tim Matheson, Julietta Novis, Paul J. Smith", "dbpedia_uri": "http://dbpedia.org/resource/Fantasia_(film)", "dbpedia_label": "Fantasia (film)"}, {"movielens_id": "436", "imdb_id": "0082010", "title": "An American Werewolf in London", "plot": "Two American college students on a walking tour of Britain are attacked by a werewolf that none of the locals will admit exists.", "genres": "Comedy, Horror", "year": "1981", "rating": "7.5", "directors": "John Landis", "cast": "Joe Belcher, David Naughton, Griffin Dunne, David Schofield, Brian Glover, Lila Kaye, Rik Mayall, Sean Baker, Paddy Ryan, Jenny Agutter, Anne-Marie Davies, John Woodvine, Frank Oz, Don McKillop, Paul Kember, Colin Fernandes, Albert Moses, Jim Henson, Michele Brisigotti, Mark Fisher, Gordon Sterne, Paula Jacobs, Claudine Bowyer, Johanna Crayden, Nina Carter, Geoffrey Burridge, Brenda Cavendish, Christopher Scoular, Mary Tempest, Cynthia Powell, Sydney Bromley, Frank Singuineau, Will Leighton, Michael Carter, Elizabeth Bradley, Rufus Deakin, Lesley Ward, George Hilsdon, Gerry Lewis, Dennis Fraser, Alan Ford, Peter Ellis, Denise Stephens, Christine Hargreaves, Linzi Drew, Lucien Morgan, Dave Cooper, Susan Spencer, Bob Babenia, Ken Sicklen, John Salthouse, John Altman, Keith Hodiak, John Owens, Roger Rowland, Lewis Alexander, Jack Armstrong, Vic Armstrong, Alan Austen, Kevin Brennan, John Cannon, Ina Clare, Simon van Collem, Harry Fielder, Noel Flanagan, Alan Flyng, Ryan Folsey, Laurie Goode, Dave Griffiths, Brendan Hughes, John Ketteringham, John Landis, Aileen Lewis, Tommy Little, Derek Lyons, Ralph G. Morse, James Muir, George Oliver, James Payne, Quentin Pierre, Alecia St Leger, John Timberlake, Terry Walsh", "dbpedia_uri": "http://dbpedia.org/resource/An_American_Werewolf_in_London", "dbpedia_label": "An American Werewolf in London"}, {"movielens_id": "449", "imdb_id": "0079945", "title": "Star Trek: The Motion Picture", "plot": "When an alien spacecraft of enormous power is spotted approaching Earth, Admiral James T. Kirk resumes command of the overhauled USS Enterprise in order to intercept it.", "genres": "Adventure, Mystery, Sci-Fi", "year": "1979", "rating": "6.4", "directors": "Robert Wise", "cast": "William Shatner, Leonard Nimoy, DeForest Kelley, James Doohan, George Takei, Majel Barrett, Walter Koenig, Nichelle Nichols, Persis Khambatta, Stephen Collins, Grace Lee Whitney, Mark Lenard, Billy Van Zandt, Roger Aaron Brown, Gary Faga, David Gautreaux, John Gowans, Howard Itzkowitz, Jon Rashad Kamal, Marcy Lafferty, Michele Billy Povill, Jeri McBride, Terrence O'Connor, Michael Rougas, Susan O'Sullivan, Ralph Brannen, Ralph Byers, Paula Crist, Iva Lane, Franklyn Seales, Momo Yashima, Jimmie Booth, Joel Kramer, Bill McIntosh, Dave Moordigian, Tom Morga, Tony Rocco, Joel Schultz, Craig Thomas, Edna Glover, Norman Stuart, Paul Weber, Joshua Gallegos, Lisa Chess, Leslie C. Howard, Sayra Hummel, Junero Jennings, Doug Hale, Richard Arnold, Fred Bronson, Celeste Cartier, Price Coetzee, Vern Dietsche, Christopher Doohan, Montgomery Doohan, John Dresden, Scott Dweck, Dennis Fischer, Cassandra Foster, Barnetta Fowler, Ryan Frazier, David Gerrold, William Guest, Sharon Hesky, James T. Kirk, Steven Lance, Donald J. Long, Joel Marston, Winnie McCarthy, John Hugh McKnight, Barbara Minster, Ve Neill, Denise Okuda, Rod Perry, Gene Allan Poe, Susan Sackett, Frank Salsedo, George Sebastian, Louise Stange-Wahl, Bjo Trimble, Scott Whitney, Millicent Wise, J. Adam Young", "dbpedia_uri": "http://dbpedia.org/resource/Star_Trek:_The_Motion_Picture", "dbpedia_label": "Star Trek: The Motion Picture"}, {"movielens_id": "452", "imdb_id": "0077766", "title": "Jaws 2", "plot": "Police chief Brody must protect the citizens of Amity after a second monstrous shark begins terrorizing the waters.", "genres": "Adventure, Horror, Thriller", "year": "1978", "rating": "5.8", "directors": "Jeannot Szwarc", "cast": "Roy Scheider, Lorraine Gary, Murray Hamilton, Joseph Mascolo, Jeffrey Kramer, Collin Wilcox Paxton, Ann Dusenberry, Mark Gruner, Barry Coe, Susan French, Gary Springer, Donna Wilkes, Gary Dubin, John Dukakis, G. Thomas Dunlop, David Elliott, Marc Gilpin, Keith Gordon, Cindy Grover, Ben Marley, Martha Swatek, Billy Van Zandt, Gigi Vorgan, Jerry M. Baxter, Jean Coulter, Daphne Dibble, Christine Freeman, April Gilpin, William Griffith, Gregory Harris, Coll Red McLean, Susan O. McMillan, David Owsley, Allan L. Paddack, Oneida Rollins, Frank James Sparks, Thomas A. Stewart, David Tintle, Jim Wilson, Kathy Wilson, Herb Muller, Fritzi Jane Courtney, Alfred Wilde, Cyprian R. Dube, Mary A. Gaffney, Bill Green, George Buck, Chris Burke, Robin Eddins, Michael Smith", "dbpedia_uri": "http://dbpedia.org/resource/Jaws_2", "dbpedia_label": "Jaws 2"}, {"movielens_id": "471", "imdb_id": "0115956", "title": "Courage Under Fire", "plot": "A U.S. Army officer, despondent about a deadly mistake he made, investigates a female chopper commander's worthiness for the Medal of Honor.", "genres": "Action, Drama, Mystery, Thriller, War", "year": "1996", "rating": "6.6", "directors": "Edward Zwick", "cast": "Denzel Washington, Meg Ryan, Lou Diamond Phillips, Michael Moriarty, Matt Damon, Bronson Pinchot, Seth Gilliam, Regina Taylor, Zeljko Ivanek, Scott Glenn, Tim Guinee, Tim Ransom, Sean Astin, Armand Darrius, Mark Adair-Rios, Ned Vaughn, Manny Perez, David McSwain, Sean Patrick Thomas, Ken Jenkins, Kathleen Widdoes, Christina Stojanovich, Lucky Luciano, Erica C. Newman, Jamal A. Mays, Ashlee Jordan Pryor, Michole Briana White, Jeffrey Waid, Patrick Young, Jimmy Ray Pickens, Jack Watkins, Matt Sigloch, Jim Morse, Bruce McGill, Rory J. Aylward, Kyle Mickaelian, Michael Dolan, John Roarke, Tom Schanley, Robert Apisa, Daniel Gonzalez, Albert Hall, Richard Venture, Diane Baker, Amy Hathaway, Reed Frerichs, Julius Carter, Peter Arnett, George Bush, Korey Coleman, Steven Derek, Saddam Hussein, Pete Janssen, Larry King, James LaMarr, Robert Brent Lappin, Michael Mills, Colin Powell, Norman Schwarzkopf, Jenni Tooley", "dbpedia_uri": "http://dbpedia.org/resource/Courage_Under_Fire", "dbpedia_label": "Courage Under Fire"}, {"movielens_id": "472", "imdb_id": "0116136", "title": "DragonHeart", "plot": "The last dragon and a disillusioned dragonslaying Knight must cooperate to stop an evil King, who was given partial immortality.", "genres": "Action, Adventure, Fantasy", "year": "1996", "rating": "6.5", "directors": "Rob Cohen", "cast": "Dennis Quaid, David Thewlis, Pete Postlethwaite, Dina Meyer, Jason Isaacs, Brian Thompson, Lee Oakes, Wolf Christian, Terry O'Neill, Peter Hric, Eva Vejmelková, Milan Bahúl, Sandra Kovacicova, Kyle Cohen, Thom Baker, Julie Christie, Sean Connery, John Gielgud, Buddy Quaid", "dbpedia_uri": "http://dbpedia.org/resource/Dragonheart", "dbpedia_label": "Dragonheart"}, {"movielens_id": "477", "imdb_id": "0117008", "title": "Matilda", "plot": "This film adaptation of a Roald Dahl work tells the story of _Matilda_ (qv) Wormwood, a gifted girl forced to put up with a crude, distant father and mother.", "genres": "Comedy, Family, Fantasy", "year": "1996", "rating": "6.9", "directors": "Danny DeVito", "cast": "Mara Wilson, Danny DeVito, Rhea Perlman, Embeth Davidtz, Pam Ferris, Paul Reubens, Tracey Walter, Brian Levinson, Jean Speegle Howard, Sara Magdalin, R.D. Robb, Gregory R. Goliath, Fred Parnes, Kiami Davael, Leor Livneh Hackel, Jacqueline Steiger, Jimmy Karz, Michael Valentine, Liam Kearns, Mark Watson, Kira Spencer Cook, J.C. Alexander, Malone Brinton, Marion Dugan, Joshua Alvarez, Max E. Blum, Erin M. Gray, Misty L. Oppenheim, Christopher Shepard Hughes, Rachel Snow, Craig Lamar Traylor, Jennifer Key, Marty Bautista, Anthony Hernandez, Raina Cease, Jonathan Osser, Vinnie Buffolino, Marcella Sassano, Johnny Thomas III, Shannon Hughes, Christel Khalil, Cassie Colaw, Austin Stout, Cindy Tran, Jonathan Feyer, Alyssa Graham, Amanda Graham, Trevor Gallagher, James Gallagher, Kayla Fredericks, Kelsey Fredericks, Amanda Fein, Caitlin Fein, Nicholas Cox, Amanda Summers, Kristyn Summers, Phoebe Garcia-Pearl, Kathy Barbour, Donna Spangler, Marianne Curan, Penny Holland, Richard E. Coe, Sabrina Bryan, Trevor Coppola, Simon Jones, Jon Lovitz, Katelyn Rosen, Zoey Rosen, Christopher Villar", "dbpedia_uri": "http://dbpedia.org/resource/Matilda_(1996_film)", "dbpedia_label": "Matilda (1996 film)"}, {"movielens_id": "478", "imdb_id": "0032904", "title": "The Philadelphia Story", "plot": "When a rich woman's ex-husband and a tabloid-type reporter turn up just before her planned remarriage, she begins to learn the truth about herself.", "genres": "Comedy, Romance", "year": "1940", "rating": "7.9", "directors": "George Cukor", "cast": "Cary Grant, Katharine Hepburn, James Stewart, Ruth Hussey, John Howard, Roland Young, John Halliday, Mary Nash, Virginia Weidler, Henry Daniell, Lionel Pape, Rex Evans, King Baggot, Hillary Brooke, Veda Buckland, Lita Chevret, Russ Clark, Sally Cleaves, David Clyde, Oliver Cross, Robert De Bruce, Dorothy Fay, Dick Gordon, Sam Harris, Claude King, Eric Mayne, Florine McKinney, Frank McLure, Lee Phelps, Hilda Plowright, Paul Power, Helene Reynolds, Mildred Shay, Joseph Sweeney, Ellinor Vanderveer, Florence Wix", "dbpedia_uri": "http://dbpedia.org/resource/The_Philadelphia_Story_(film)", "dbpedia_label": "The Philadelphia Story (film)"}, {"movielens_id": "482", "imdb_id": "0053291", "title": "Some Like It Hot", "plot": "After two male musicians witness a mob hit, they flee the state in an all-female band disguised as women, but further complications set in.", "genres": "Comedy, Music, Romance", "year": "1959", "rating": "8.2", "directors": "Billy Wilder", "cast": "Marilyn Monroe, Tony Curtis, Jack Lemmon, George Raft, Pat O'Brien, Joe E. Brown, Nehemiah Persoff, Joan Shawlee, Billy Gray, George E. Stone, Dave Barry, Mike Mazurki, Harry Wilson, Beverly Wills, Barbara Drew, Edward G. Robinson Jr., Sam Bagley, Alex Ball, Brandon Beach, Phil Bloom, Willie Bloom, Al Breneman, Steve Carruthers, James J. Casino, Noble 'Kid' Chissell, Beulah Christian, Ted Christy, Robert Cole, Marian Collier, Pat Comiskey, Bing Conley, Paul Cristo, Harry Denny, Jimmy Dime, Franklyn Farnum, Joan Fields, Duke Fishman, Mary Foley, George Ford, Paul Frees, Joanne Genthon, Bobby Gilbert, Joseph Glick, Jack Gordon, Joe Gray, Stuart Hall, Sam Harris, Harold 'Tommy' Hart, Ted Hook, Shep Houghton, John Indrisano, Tom Kennedy, Joseph La Cava, George Lake, Carl M. Leviness, King Lockwood, John Logan, Hank Mann, Tiger Joe Marsh, Jack Mather, Tipp McClure, Penny McGuiggan, Frank McLure, Laurie Mitchell, William H. O'Brien, Colleen O'Sullivan, Joe Palma, Helen Perry, Jack Perry, Danny Richards Jr., Edwin Rochelle, John Roy, Cosmo Sardo, Scott Seaton, Sammy Shack, Fred Sherman, Carl Sklover, Bert Stevens, Arthur Tovey, Sid Troy, Ralph Volkie, Tito Vuolo, Sandra Warner, Billy Wayne, Grace Lee Whitney", "dbpedia_uri": "http://dbpedia.org/resource/Some_Like_It_Hot", "dbpedia_label": "Some Like It Hot"}, {"movielens_id": "483", "imdb_id": "0034583", "title": "Casablanca", "plot": "A cynical expatriate American cafe owner struggles to decide whether or not to help his former lover and her fugitive husband escape the Nazis in French Morocco.", "genres": "Drama, Romance, War", "year": "1942", "rating": "8.5", "directors": "Michael Curtiz", "cast": "Humphrey Bogart, Ingrid Bergman, Paul Henreid, Claude Rains, Conrad Veidt, Sydney Greenstreet, Peter Lorre, S.Z. Sakall, Madeleine Lebeau, Dooley Wilson, Joy Page, John Qualen, Leonid Kinskey, Curt Bois, Abdullah Abbas, Enrique Acosta, Ed Agresti, Arnet Amos, Louis V. Arco, Frank Arnold, Brandon Beach, Leon Belasco, Nino Bellini, Trude Berliner, Oliver Blake, Monte Blue, Eugene Borden, Dick Botiller, Maurice Brierre, Anita Camargo, George M. Carleton, Spencer Chan, Melie Chang, Tex Cooper, Gino Corrado, Franco Corsaro, Adrienne D'Ambricourt, Marcel Dalio, Helmut Dantine, Jean De Briac, George Dee, Jean Del Val, Carl Deloro, Joseph DeVillard, Arthur Dulac, William Edmunds, Herbert Evans, O.K. Ford, Martin Garralaga, Gregory Gaye, Gregory Golubeff, Ilka Grüning, Creighton Hale, Winifred Harris, Jamiel Hasson, Arthur Stuart Hull, Olaf Hytten, Paul Irving, Kay Koury, Charles La Torre, George J. Lewis, Max Linder, Manuel Lopez, Jacques Lory, Lou Marcelle, Michael Mark, Tony Martelli, Frank Mazzola, George Meeker, Lal Chand Mehra, Hercules Mendez, Louis Mercier, Torben Meyer, Mike Morelli, Alberto Morin, Leo Mostovoy, Corinna Mura, Sol Murgi, Barry Norton, Monty O'Grady, Lotte Palfi Andor, Paul Panzer, Manuel París, Alexander Pollard, Paul Porcasi, Frank Puglia, Georges Renavent, Dewey Robinson, Victor Romito, Henry Rowland, Richard Ryen, Dan Seymour, Nick Shaid, Lester Sharpe, Bhogwan Singh, Dina Smirnova, Gerald Oliver Smith, George Sorel, Geoffrey Steele, Ludwig Stössel, Mike Tellegen, Sid Troy, Rafael Trujillo, Jacques Vanaire, Ellinor Vanderveer, Norma Varden, Hans Heinrich von Twardowski, Leo White, Jack Wise, Jean Wong, Wolfgang Zilzer", "dbpedia_uri": "http://dbpedia.org/resource/Casablanca_(film)", "dbpedia_label": "Casablanca (film)"}, {"movielens_id": "490", "imdb_id": "0048728", "title": "To Catch a Thief", "plot": "A retired jewel thief sets out to prove his innocence after being suspected of returning to his former occupation.", "genres": "Mystery, Romance, Thriller", "year": "1955", "rating": "7.4", "directors": "Alfred Hitchcock", "cast": "Cary Grant, Grace Kelly, Jessie Royce Landis, John Williams, Charles Vanel, Brigitte Auber, Jean Martinelli, Georgette Anys, George Adrian, John Alderson, Martha Bamattre, René Blancard, Eugene Borden, Nina Borget, George Boyce, John Breen, Margaret Brewster, Ralph Brooks, Lewis Charles, Jack Chefe, Frank Chelland, Beulah Christian, Wilson Cornell, Reinie Costello, Paul Cristo, Oliver Cross, William 'Wee Willie' Davis, Dominique Davray, Louise De Carlo, Guy De Vestel, Gloria Dee, George DeNormand, Kathleen Desmond, Lala Detolly, Minta Durfee, Dolores Ellsworth, George Ellsworth, Nestor Eristoff, Franklyn Farnum, Bess Flowers, Curt Furberg, Russell Gaige, Steven Geray, Michael Hadlow, Lars Hensen, Alfred Hitchcock, Gladys Holland, Jeshurun Howard, Jean Hébey, Barbara Jones, Beverly Ruth Jordan, Fred Kelsey, Lorraine Knight, Bela Kovacs, Jeanne Lafayette, Donald Lawton, Eddie Le Baron, Roland Lesaffre, Edward Manouk, Jonathan Marlowe, Jeri McKenna, Don Megowan, Louis Mercier, Hans Moebus, Mike Morelli, Alberto Morin, Sol Murgi, George Nardelli, Paul Newlan, Barry Norton, Monty O'Grady, George Paris, Manuel París, Joan Patti, Leonard Penn, Murray Pollack, Albert Pollet, Jose Portugal, John Powell, Paul Power, Paul Ravel, Mitchell Rhein, Ervin Richardson, Loulette Sablon, Cosmo Sardo, Otto F. Schulze, Bernard Sell, Charles Sherlock, Reginald Lal Singh, Earl Spainard, Betty Spotts, Adele St. Maur, Norman Stevans, Marie Stoddard, Aimee Torriani, Philip Van Zandt, Geni Whitlow, Phyllis Young", "dbpedia_uri": "http://dbpedia.org/resource/To_Catch_a_Thief", "dbpedia_label": "To Catch a Thief"}, {"movielens_id": "491", "imdb_id": "0029843", "title": "The Adventures of Robin Hood", "plot": "When Prince John and the Norman Lords begin oppressing the Saxon masses in King Richard's absence, a Saxon lord fights back as the outlaw leader of a rebel guerrilla army.", "genres": "Action, Adventure, Romance", "year": "1938", "rating": "7.9", "directors": "Michael Curtiz, William Keighley", "cast": "Errol Flynn, Olivia de Havilland, Basil Rathbone, Claude Rains, Patric Knowles, Eugene Pallette, Alan Hale, Melville Cooper, Ian Hunter, Una O'Connor, Herbert Mundin, Montagu Love, Leonard Willey, Robert Noble, Kenneth Hunter, Robert Warwick, Colin Kenny, Lester Matthews, Harry Cording, Ivan F. Simpson, Lowden Adams, Frank Baker, James Baker, Sidney Baron, Lionel Belmore, Wilson Benge, Charles Bennett, Hal Brazeale, George Bruggeman, George Bunny, David Cavendish, Phyllis Coghlan, Zebedy Colt, D'Arcy Corrigan, Nick De Ruiz, Jack Deery, Eddie Dew, Jimmy Dime, Harold Entwistle, Herbert Evans, Austin Fairman, Jack Gordon, Frank Hagney, Alec Harford, Ivo Henderson, Holmes Herbert, Howard Hill, Peter Hobbes, Leyland Hodgson, Harold Howard, George Huggins, Olaf Hytten, Charles Irwin, Robert M. Parrington Jackson, Dick Johnstone, Crauford Kent, Paul Kruger, Marten Lamont, Carole Landis, Connie Leon, Frank McCarroll, Charles McNaughton, Thomas R. Mills, Charles Morton, Leonard Mudie, Joseph North, Antonia Oland, Paul Power, Bob Reeves, Georges Renavent, Dick Rich, John J. Richardson, Gerald Rogers, Victor Romito, John Roy, Janet Shaw, Reginald Sheffield, Cap Somers, Ray Spiker, Robert St. Angelo, Ernie Stanton, Val Stanton, Robert R. Stephenson, William Sundholm, John Sutton, Cyril Thornton, David Thursby, Trigger, Claude Wisberg", "dbpedia_uri": "http://dbpedia.org/resource/The_Adventures_of_Robin_Hood_(film)", "dbpedia_label": "The Adventures of Robin Hood (film)"}, {"movielens_id": "507", "imdb_id": "0044081", "title": "A Streetcar Named Desire", "plot": "Disturbed Blanche DuBois moves in with her sister in New Orleans and is tormented by her brutish brother-in-law while her reality crumbles around her.", "genres": "Drama", "year": "1951", "rating": "8.0", "directors": "Elia Kazan", "cast": "Vivien Leigh, Marlon Brando, Kim Hunter, Karl Malden, Rudy Bond, Nick Dennis, Peg Hillias, Wright King, Richard Garrick, Ann Dere, Edna Thomas, Mickey Kuhn, Mel Archer, Walter Bacon, Dahn Ben Amotz, Joe Brooks, Marietta Canty, John George, John Gonetos, Chester Jones, Lyle Latell, Mike Morelli, William H. O'Brien, Maxie Thrower, Charles Wagenheim, John B. Williams, Buck Woods", "dbpedia_uri": "http://dbpedia.org/resource/A_Streetcar_Named_Desire_(1951_film)", "dbpedia_label": "A Streetcar Named Desire (1951 film)"}, {"movielens_id": "518", "imdb_id": "0100150", "title": "Miller's Crossing", "plot": "Tom Reagan, an advisor to a Prohibition-era crime boss, tries to keep the peace between warring mobs but gets caught in divided loyalties.", "genres": "Crime, Drama, Thriller", "year": "1990", "rating": "7.7", "directors": "Joel Coen, Ethan Coen", "cast": "Gabriel Byrne, Marcia Gay Harden, John Turturro, Jon Polito, J.E. Freeman, Albert Finney, Mike Starr, Al Mancini, Richard Woods, Tom Toner, Steve Buscemi, Mario Todisco, Olek Krupa, Michael Jeter, Lanny Flaherty, Jeanette Kontomitras, Louis Charles Mounicou III, John McConnell, Danny Aiello III, Helen Jolly, Hilda McLean, Monte Starr, Don Picard, Salvatore H. Tornabene, Kevin Dearie, Michael Badalucco, Charles Ferrara, Esteban Fernández, George Fernandez, Charles Gunning, Dave Drinkx, David Darlow, Robert LaBrosse, Carl Rooney, Jack Harris, Jery Hewitt, Sam Raimi, John Schnauder Jr., Zolly Levin, Joey Ancona, Bill Raye, William Preston Robertson, Michael P. Cahill, Sean Collins, Frances McDormand", "dbpedia_uri": "http://dbpedia.org/resource/Miller's_Crossing", "dbpedia_label": "Miller's Crossing"}, {"movielens_id": "521", "imdb_id": "0077416", "title": "The Deer Hunter", "plot": "An in-depth examination of the ways in which the U.S. Vietnam War impacts and disrupts the lives of people in a small industrial town in Pennsylvania.", "genres": "Drama, War", "year": "1978", "rating": "8.1", "directors": "Michael Cimino", "cast": "Robert De Niro, John Cazale, John Savage, Christopher Walken, Meryl Streep, George Dzundza, Chuck Aspegren, Shirley Stoler, Rutanya Alda, Pierre Segui, Mady Kaplan, Amy Wright, Mary Ann Haenel, Richard Kuss, Joe Grifasi, Christopher Colombi Jr., Victoria Karnafel, Jack Scardino, Joe Strnad, Helen Tomko, Paul D'Amato, Dennis Watlington, Charlene Darrow, Jane-Colette Disko, Michael Wollet, Robert Beard, Joe Dzizmba, Stephen Kopestonsky, John F. Buchmelter III, Frank Devore, Tom Becker, Lynn Kongkham, Nongnuj Timruang, Po Pao Pee, Dale Burroughs, Parris Hicks, Samui Muang-Intata, Sapox Colisium, Vitoon Winwitoon, Somsak Sengvilai, Charan Nusvanon, Jiam Gongtongsmoot, Chai Peyawan, Mana Hansa, Sombot Jumpanoi, Phip Manee, Ding Santos, Krieng Chaiyapuk, Ot Palapoo, Chok Chai Mahasoke, Hilary Brown, Joe Cummings, Gary Jones, Tom Madden, Antone Pagán, Michael Santiago, Joel Thingvall", "dbpedia_uri": "http://dbpedia.org/resource/The_Deer_Hunter", "dbpedia_label": "The Deer Hunter"}, {"movielens_id": "523", "imdb_id": "0061512", "title": "Cool Hand Luke", "plot": "A laid back Southern man is sentenced to two years in a rural prison, but refuses to conform.", "genres": "Crime, Drama", "year": "1967", "rating": "8.1", "directors": "Stuart Rosenberg", "cast": "Paul Newman, George Kennedy, J.D. Cannon, Lou Antonio, Robert Drivas, Strother Martin, Jo Van Fleet, Clifton James, Morgan Woodward, Luke Askew, Marc Cavell, Richard Davalos, Robert Donner, Warren Finnerty, Dennis Hopper, John McLiam, Wayne Rogers, Harry Dean Stanton, Charles Tyner, Ralph Waite, Anthony Zerbe, Buck Kartalian, Joy Harmon, Joe Don Baker, James Gammon, Norman Goodwins, Chuck Hicks, Rance Howard, James Jeter, Kim Kahana, Robert Luster, Donn Pearce, John Pearce, Cyril 'Chips' Robinson, Eddie Rosson, Rush Williams", "dbpedia_uri": "http://dbpedia.org/resource/Cool_Hand_Luke", "dbpedia_label": "Cool Hand Luke"}, {"movielens_id": "526", "imdb_id": "0052618", "title": "Ben-Hur", "plot": "After a Jewish prince is betrayed and sent into slavery by a Roman friend, he regains his freedom and comes back for revenge.", "genres": "Adventure, Drama, History", "year": "1959", "rating": "8.1", "directors": "William Wyler", "cast": "Charlton Heston, Jack Hawkins, Haya Harareet, Stephen Boyd, Hugh Griffith, Martha Scott, Cathy O'Donnell, Sam Jaffe, Finlay Currie, Frank Thring, Terence Longdon, George Relph, André Morell, Fortunato Arena, Bruno Ariè, Les Ballets Africains, Emma Baron, Ady Berber, Marina Berti, Hugh Billingsley, Jerry Brown, Robert Brown, Lando Buzzanca, Joe Canutt, Otello Capanna, Emile Carrer, Richard Coleman, Antonio Corevi, Michael Cosmo, Alfredo Danesi, David Davies, Carmen de Hohenlohe, Victor De La Fosse, Liana Del Balzo, Mino Doro, Michael Dugan, Franco Fantasia, Dino Fazio, Enzo Fiermonte, Bob Folkerson, Giuliano Gemma, John Glenn, José Greci, Richard Hale, Claude Heater, Prince Hohenlohe, John Horsley, Eddie Juaregui, William Kiehl, Duncan Lamont, Howard Lang, John Le Mesurier, Tutte Lemkow, Cliff Lyons, Luigi Marra, Ferdy Mayne, May McAvoy, Nona Medici, Furio Meniconi, Tiberio Mitri, Aldo Mozele, Thomas O'Leary, Remington Olmsted, Laurence Payne, Aldo Pial, Vladimiro Picciafuochi, Aldo Pini, Ferdinando Poggi, Diego Pozzetto, Prince Raimondo, Stella Rho, Edwin Richfield, Mario Rivoltella, Hector Ross, Emanuele Ruspoli, Amerigo Santarelli, Maxwell Shaw, Noel Sheldon, Aldo Silvani, Umberto Silvestri, Reginald Lal Singh, Gianni Solaro, John Stevenson Lang, Alfred Thomas, Pietro Tordi, Giuseppe Tosi, Ralph Truman, Raimondo Van Riel, Venantino Venantini, Dervis Ward, Irina Wassilchikoff, Joe Yrigoyen, Nazzareno Zamperla", "dbpedia_uri": "http://dbpedia.org/resource/Ben-Hur_(1959_film)", "dbpedia_label": "Ben-Hur (1959 film)"}, {"movielens_id": "529", "imdb_id": "0089606", "title": "My Life as a Dog", "plot": "A boy and his brother don't get along well. In order to let their ill mother rest, they're separated and sent each one with their relatives.", "genres": "Drama, Comedy", "year": "1985", "rating": "7.6", "directors": "Lasse Hallström", "cast": "Anton Glanzelius, Tomas von Brömssen, Anki Lidén, Melinda Kinnaman, Kicki Rundgren, Lennart Hjulström, Ing-Marie Carlsson, Leif Ericson, Christina Carlwind, Ralph Carlsson, Viveca Dahlén, Arnold Alfredsson, Fritz Elofsson, Didrik Gustafsson, Jan-Philip Hollström, Vivi Johansson, Per Ottosson, Magnus Rask, Tony Rix, Manfred Serner, Johanna Udéhn, Susanna Wetterholm, Klimpen, Olle Björklund, Lennart Hyland, Reidar Jönsson, Folke Olhagen", "dbpedia_uri": "http://dbpedia.org/resource/My_Life_as_a_Dog", "dbpedia_label": "My Life as a Dog"}, {"movielens_id": "531", "imdb_id": "0117631", "title": "Shine", "plot": "Pianist 'David Helfgott' (qv), driven by his father and teachers, has a breakdown. Years later he returns to the piano, to popular if not critical acclaim.", "genres": "Biography, Drama, Music, Romance", "year": "1996", "rating": "7.7", "directors": "Scott Hicks", "cast": "Geoffrey Rush, Justin Braine, Sonia Todd, Chris Haywood, Alex Rafalowicz, Gordon Poole, Armin Mueller-Stahl, Nicholas Bell, Danielle Cox, Rebecca Gooden, Marta Kaczmarek, John Cousins, Noah Taylor, Paul Linkson, Randall Berger, Ian Welbourne, Kelly Bottrill, Beverley Vaughan, Phyllis Burford, Daphne Grey, Edwin Hodgeman, Googie Withers, Maria Dafneros, Reis Porter, Stephen Sheehan, Brenton Whittle, Marianna Doherty, Camilla James, John Gielgud, David King, Danny Davies, Helen Dowell, Louise Dorling, Sean Carlsen, Richard Hansell, Robert Hands, Marc Warren, Neil Thomson, Joey Kennedy, Ellen Cressey, Beverley Dunn, Andy Seymour, Lynn Redgrave, Ella Scott Lynch, Jethro Heysen-Hicks, John Martin, Bill Boyley, Teresa La Rocca, Lindsey Day, Grant Doyle, Leah Jennings, Kathy Monaghan, Mark Lawrence, Gordon Coombes, Luke Dollman, Margaret Stone, Tom Carrig, Helen Ayres, Suzi Jarratt, Samantha McDonald, Peter Osborn, Sandi Roberts, Louise Siversen", "dbpedia_uri": "http://dbpedia.org/resource/Shine_(film)", "dbpedia_label": "Shine (film)"}, {"movielens_id": "538", "imdb_id": "0118617", "title": "Anastasia", "plot": "The last surviving child of the Russian Royal Family joins two con men to reunite with her grandmother, the Dowager Empress, while the undead Rasputin seeks her death.", "genres": "Animation, Adventure, Drama, Family, Fantasy, Musical, Mystery, Romance", "year": "1997", "rating": "7.2", "directors": "Don Bluth, Gary Goldman", "cast": "Meg Ryan, John Cusack, Kelsey Grammer, Christopher Lloyd, Hank Azaria, Bernadette Peters, Kirsten Dunst, Angela Lansbury, Rick Jones, Andrea Martin, Glenn Walker Harris Jr., Debra Mooney, Arthur Malet, Charity James, Liz Callaway, Lacey Chabert, Jim Cummings, Jonathan Dokuchitz, Brooks Almy, Ellen Bernfeld, Judith Blazer, Jeff Blumenkrantz, Ted Brunetti, Glen Burtnick, Vivian Cherry, Robin Clark, Victoria Clark, Madeline Doherty, Robert DuSold, Gregg Edelman, Al Fritsch, Kyle Gordon, Darius de Haas, Michael Louis Harvey, Jan Horvath, John Jellison, Kenny Karen, Curtis King Jr., Joseph Kolinski, Alix Korey, David Lowenstein, Cindy Mizelle, Bill Nolte, Michele Pawk, Billy Porter, Patrick Quinn, Karen Silver, J.K. Simmons, Frank Simms, Emily Skinner, Ted Sperling, Vanéese Y. Thomas, Lillias White, Emma Blackwell, Michael Tassoni", "dbpedia_uri": "http://dbpedia.org/resource/Anastasia_(1997_film)", "dbpedia_label": "Anastasia (1997 film)"}, {"movielens_id": "542", "imdb_id": "0114148", "title": "Pocahontas", "plot": "An English soldier and the daughter of an Algonquin chief share a romance when English colonists invade seventeenth century Virginia.", "genres": "Animation, Adventure, Drama, Family, Musical, Romance", "year": "1995", "rating": "6.7", "directors": "Mike Gabriel, Eric Goldberg", "cast": "Joe Baker, Christian Bale, Irene Bedard, Billy Connolly, James Apaumut Fall, Mel Gibson, Linda Hunt, John Kassir, Judy Kuhn, Danny Mann, Russell Means, David Ogden Stiers, Michelle St. John, Gordon Tootoosis, Frank Welker, Jim Cummings", "dbpedia_uri": "http://dbpedia.org/resource/Pocahontas_(1995_film)", "dbpedia_label": "Pocahontas (1995 film)"}, {"movielens_id": "546", "imdb_id": "0115759", "title": "Broken Arrow", "plot": "Terrorists steal nuclear warheads from the U.S. military but don't count on a pilot and park ranger spoiling their plans.", "genres": "Action, Adventure, Thriller", "year": "1996", "rating": "6.0", "directors": "John Woo", "cast": "John Travolta, Christian Slater, Samantha Mathis, Delroy Lindo, Bob Gunton, Frank Whaley, Howie Long, Vondie Curtis-Hall, Jack Thompson, Vyto Ruginis, Ousaun Elam, Shaun Toub, Casey Biggs, Jeffrey Stephan, Joey Box, Jon W. Kishi, Myke Schwartz, Jim Palmer, Vince Deadrick Sr., Charlie Brewer, Gary Epper, Mario Roberts, J.N. Roberts, Kurtwood Smith, Daniel von Bargen, Bruce Holman, Carmen Argenziano, James MacDonald, French Stewart, Jim Moyle, Chris Mulkey, Henry Murph, Tom Waddell, Rosemary Schoppman, Raymond Cruz, Tom Demille", "dbpedia_uri": "http://dbpedia.org/resource/Broken_Arrow_(1996_film)", "dbpedia_label": "Broken Arrow (1996 film)"}, {"movielens_id": "553", "imdb_id": "0114887", "title": "A Walk in the Clouds", "plot": "A married soldier returning from World War II poses as a pregnant woman's husband to save her from her father's anger and honor.", "genres": "Drama, Romance", "year": "1995", "rating": "6.7", "directors": "Alfonso Arau", "cast": "Keanu Reeves, Aitana Sánchez-Gijón, Anthony Quinn, Giancarlo Giannini, Angélica Aragón, Evangelina Elizondo, Freddy Rodríguez, Debra Messing, Febronio Covarrubias, Roberto Huerta, Juan Jiménez, Ismael Gallegos, Alejandra Flores, Gema Sandoval, Don Amendolia, Gregory Paul Martin, Mary Pat Gleason, John Dennis Johnston, Joseph Granda, Mark Matheisen, Macon McCalman, Ivory Ocean, Fred Burri, Stephanie Maislen, Brad Rea, Joe Troconis, Loren Zitomersky, Jana Rains Austinson, Jan Citron, Bret Culpepper, Anthony Fiorin, Julie Guevara, Erica Howard, Dana Walsh", "dbpedia_uri": "http://dbpedia.org/resource/A_Walk_in_the_Clouds", "dbpedia_label": "A Walk in the Clouds"}, {"movielens_id": "554", "imdb_id": "0114898", "title": "Waterworld", "plot": "In a future where the polar ice-caps have melted and Earth is almost entirely submerged, a mutated mariner fights starvation and outlaw \"smokers,\" and reluctantly helps a woman and a young girl try to find dry land.", "genres": "Action, Adventure, Sci-Fi", "year": "1995", "rating": "6.2", "directors": "Kevin Reynolds", "cast": "Kevin Costner, Chaim Jeraffi, Rick Aviles, R.D. Call, Zitto Kazann, Leonardo Cimino, Zakes Mokae, Luke Ka'ili Jr., Anthony DeMasters, Willy Petrovic, Jack Kehler, Jeanne Tripplehorn, Lanny Flaherty, Robert A. Silverman, Gerard Murphy, Tina Majorino, Sab Shimono, Rita Zohar, Henry Kapono Ka'aihue, Michael Jeter, August Neves, Tracy Anderson, Dennis Hopper, Neil Giuntoli, Robert Joy, John Fleck, David Finnegan, Greg Goossen, William Preston, Jack Black, John Toles-Bey, Kim Coates, Ari Barak, Chris Douridas, Alexa Jago, Sean Whalen, Robert LaSardo, Lee Arenberg, Doug Spinuzza, Victor Sánchez, Paul Bogh, Annie Costner, Hal Douglas, Anne Gaybis, Michael Haddad, Trent Hopkins, Todd Livdahl, Lisa Liz Long, Chris Moore, Tiffany Ariana Morrow, John Otrin, Delisa Sexton, Bobby Sussman, Jenny Tallent", "dbpedia_uri": "http://dbpedia.org/resource/Waterworld", "dbpedia_label": "Waterworld"}, {"movielens_id": "559", "imdb_id": "0110148", "title": "Interview with the Vampire: The Vampire Chronicles", "plot": "A vampire tells his epic life story: love, betrayal, loneliness, and hunger.", "genres": "Drama, Horror", "year": "1994", "rating": "7.5", "directors": "Neil Jordan", "cast": "Brad Pitt, Christian Slater, Virginia McCollam, John McConnell, Tom Cruise, Mike Seelig, Bellina Logan, Thandiwe Newton, Lyla Hay Owen, Lee E. Scharfstein, Indra Ové, Helen McCrory, Monte Montague, Kirsten Dunst, Nathalie Bloch-Lainé, Jeanette Kontomitras, Roger Lloyd Pack, George Kelly, Nicole DuBois Favre, Stephen Rea, Antonio Banderas, Micha Bergese, Rory Edwards, Marcel Iures, Susan Lynch, Louise Salter, Matthew Sim, François Testory, Andrew Tiernan, Simon Tyrrell, George Antoni, Sara Stockbridge, Laure Marsac, Katia Caballero, Louis Lewis-Smith, Domiziana Giordano, Kenneth Coombs, Reese Foster, Erika Ganier, Ben Gardiner, Rusty Gregoire, Jacquelyn Twodat Jackson, Doron Jacobs, Danny Kamin, Gustavo I. Ortiz, John Risso, Rafael Siegel, Greta Valenti, Erick Vinther, Glenn Webster, Robert 'Bobby Z' Zajonc", "dbpedia_uri": "http://dbpedia.org/resource/Interview_with_the_Vampire:_The_Vampire_Chronicles", "dbpedia_label": "Interview with the Vampire: The Vampire Chronicles"}, {"movielens_id": "562", "imdb_id": "0114214", "title": "The Quick and the Dead", "plot": "A female gunfighter returns to a frontier town where a dueling tournament is being held, which she enters in an effort to avenge her father's death.", "genres": "Action, Romance, Thriller, Western", "year": "1995", "rating": "6.4", "directors": "Sam Raimi", "cast": "Sharon Stone, Gene Hackman, Russell Crowe, Leonardo DiCaprio, Tobin Bell, Roberts Blossom, Kevin Conway, Keith David, Lance Henriksen, Pat Hingle, Gary Sinise, Mark Boone Junior, Olivia Burnette, Fay Masterson, Raynor Scheine, Woody Strode, Jerry Swindall, Scott Spiegel, Jonothon Gill, Sven-Ole Thorsen, Lennie Loftin, Matthew Gold, Arturo Gastelum, David Cornell, Josef Rainer, Stacy Linn Ramsower, Tony Lee Boggs, Scott Ryder, Timothy Patrick Quill, Solomon Abrams, John Cameron, Bruce Campbell, Michael Stone, Butch Molina, Greg Goossen, Mick Garris, Oliver Dear, Ruben Angelo, James Cotner, Daniel Fortman, Cindy Hundt, Jan Robinson, John A. Willingham", "dbpedia_uri": "http://dbpedia.org/resource/The_Quick_and_the_Dead_(1978_film)", "dbpedia_label": "The Quick and the Dead (1978 film)"}, {"movielens_id": "565", "imdb_id": "0114852", "title": "Village of the Damned", "plot": "A small town's women give birth to unfriendly alien children posing as humans.", "genres": "Horror, Sci-Fi, Thriller", "year": "1995", "rating": "5.7", "directors": "John Carpenter", "cast": "Christopher Reeve, Kirstie Alley, Linda Kozlowski, Michael Paré, Meredith Salenger, Mark Hamill, Pippa Pearthree, Peter Jason, Constance Forslund, Karen Kahn, Thomas Dekker, Lindsey Haun, Cody Dorkin, Trishalee Hardy, Jessye Quarry, Adam Robbins, Chelsea DeRidder Simms, Renee Rene Simms, Danielle Keaton, Hillary Harvey, Bradley Wilhelm, Jennifer Wilheim, George 'Buck' Flower, Squire Fridell, Darryl Jones, Ed Corbett, Ross Martineau, Skip Richardson, Tony Haney, Sharon Iwai, Robert Lewis Bush, Montgomery Hom, Steven Chambers, Ron Kaell, Lane Nishikawa, Michael Halton, Julie Eccles, Lois Saunders, Sidney Baldwin, Wendolyn Lee, Kathleen Turco-Lyon, Abigail Van Alyn, Roy Conrad, Dan Belzer, Dena Martinez, Alice Barden, John Brebner, Ralph Miller, John Carpenter, Annie Lore, Seth Meyers, Jeff Scott, Theodore Carl Soderberg", "dbpedia_uri": "http://dbpedia.org/resource/Village_of_the_Damned_(1995_film)", "dbpedia_label": "Village of the Damned (1995 film)"}, {"movielens_id": "570", "imdb_id": "0111756", "title": "Wyatt Earp", "plot": "From Wichita to Dodge City to the O.K. Corral in Tombstone, a man becomes a myth in this thrilling journey of romance, adventure and desperate, heroic action.", "genres": "Adventure, Biography, Crime, Drama, Western", "year": "1994", "rating": "6.7", "directors": "Lawrence Kasdan", "cast": "Kevin Costner, Dennis Quaid, Gene Hackman, David Andrews, Linden Ashby, Jeff Fahey, Joanna Going, Mark Harmon, Michael Madsen, Catherine O'Hara, Bill Pullman, Isabella Rossellini, Tom Sizemore, JoBeth Williams, Mare Winningham, James Gammon, Rex Linn, Randle Mell, Adam Baldwin, Annabeth Gish, Lewis Smith, Ian Bohen, Betty Buckley, Alison Elliott, Todd Allen, Mackenzie Astin, Jim Caviezel, Karen Grassle, John Dennis Johnston, Téa Leoni, Martin Kove, Jack Kehler, Kirk Fox, Norman Howell, Boots Southerland, Scotty Augare, Gabriel Folse, Kris Kamm, John Lawlor, Monty Stuart, Hugh Ross, Gregory Avellone, Michael McGrady, Mary Jo Niedzielski, Scott Paul, Oliver Hendrickson, Darwin Mitchell, Steve Kniesel, Larry Sims, Greg Goossen, Heath Kizzier, Clark Sanchez, Ed Beimfohr, Giorgio E. Tripoli, Ben Zeller, Rockne Tarkington, Scott Rasmussen, Ellen Blake, Steph Benseman, Bob 'Dutch' Holland, Steve Cormier, Matt Langseth, David Doty, Steven Gregory Tyler, Billy Streater, David L. Stone, Jake Walker, Matt O'Toole, Geo Cook, Dillinger Steele, Steve Lindsay, Dick Beach, Benny Manning, Kathleen O'Hara, Nick Benseman, Raymond McGraw, Luce Rains, Brett Cullen, Marlene D. Williams, Paul Ukena, Owen Roizman, Karen Schwartz, Glen Burns, John Furlong, Zack McGillis, Adam Taylor, Rusty Hendrickson, Hanley Smith, Jonathan Kasdan, Dale West, Michael Huddleston, Albert Trujillo, John Doe, Matt Beck, Gary Dueer, Roxana Benseman, Joe Bernier, Ivan Brutsche, Bryan David Wright, Shannon Denton, Elias Gallegos, Lawrence Kasdan, Tanit Lee Lascelles, Roger Marten, Steve Nessel, James 'JR' Pollard, John Pritchett, Mark Thomason, Tracy Weisert, Jim Wilson", "dbpedia_uri": "http://dbpedia.org/resource/Wyatt_Earp_(film)", "dbpedia_label": "Wyatt Earp (film)"}, {"movielens_id": "572", "imdb_id": "0109303", "title": "Blown Away", "plot": "An Irish bomber escapes from prison and targets a member of the Boston bomb squad.", "genres": "Action, Crime, Drama, Thriller", "year": "1994", "rating": "6.2", "directors": "Stephen Hopkins", "cast": "Jeff Bridges, Tommy Lee Jones, Suzy Amis, Lloyd Bridges, Forest Whitaker, Stephi Lineburg, John Finn, Caitlin Clarke, Christofer de Oni, Loyd Catlett, Ruben Santiago-Hudson, Lucinda Weist, Brendan Burns, Tricia Heine, Josh McLaglen, Ken Kerman, David U. Hodges, Robert 'Bobby Z' Zajonc, Alan D. Purwin, David B. Nowell, Dee Nelson, Judd Daniel King, Chris O'Neill, Whitney Cline, Michael Macklin, Sara Edwards, Evelyn Lee-Jones, Mark Berry, Faleena Hopkins, Michael J. Reynolds, Larry Reynolds, Terry O'Shea, George Landers, John Farrell, Jon Alex, Jesse Barrett-Mills, Eric Bruno Borgman, Brina, Jeffrey Corazzini, Brian Eggleston, Scott J. Fisher, Christopher Flockton, Cuba Gooding Jr., Frédéric Morin, Craig Richard Nelson, John Nesti, Ed O'Keefe, Bill Stanitsas, Mike Starr, Bill Thorpe, Dared Wright", "dbpedia_uri": "http://dbpedia.org/resource/Blown_Away_(1992_film)", "dbpedia_label": "Blown Away (1992 film)"}, {"movielens_id": "576", "imdb_id": "0106582", "title": "Cliffhanger", "plot": "A botched mid-air heist results in suitcases full of cash being searched for by various groups throughout the Rocky Mountains.", "genres": "Action, Adventure, Thriller", "year": "1993", "rating": "6.4", "directors": "Renny Harlin", "cast": "Sylvester Stallone, John Lithgow, Michael Rooker, Janine Turner, Rex Linn, Caroline Goodall, Leon, Craig Fairbrass, Gregory Scott Cummins, Denis Forest, Michelle Joyner, Max Perlich, Paul Winfield, Ralph Waite, Trey Brownell, Zach Grenier, Vyto Ruginis, Don S. Davis, Scott Hoxby, John Finn, Bruce McGill, Rosemary Dunsmore, Kim Robillard, Jeff McCarthy, Mike Weis, Duncan Prentice, Kevin Donald, Jeff Blynn, Thor, Billy D. Lucas", "dbpedia_uri": "http://dbpedia.org/resource/Cliffhanger_(film)", "dbpedia_label": "Cliffhanger (film)"}, {"movielens_id": "588", "imdb_id": "0101414", "title": "Beauty and the Beast", "plot": "A prince cursed to spend his days as a hideous monster sets out to regain his humanity by earning a young woman's love.", "genres": "Animation, Family, Fantasy, Musical, Romance", "year": "1991", "rating": "8.0", "directors": "Gary Trousdale, Kirk Wise", "cast": "Robby Benson, Jesse Corti, Rex Everhart, Angela Lansbury, Paige O'Hara, Jerry Orbach, Bradley Pierce, David Ogden Stiers, Richard White, Jo Anne Worley, Mary Kay Bergman, Brian Cummings, Alvin Epstein, Tony Jay, Alec Murphy, Kimmy Robertson, Hal Smith, Kath Soucie, Frank Welker, Jack Angel, Bruce Adler, Scott Barnes, Vanna Bonta, Maureen Brennan, Liz Callaway, Philip L. Clarke, Margery Daley, Jennifer Darling, Albert de Ruiter, George Dvorsky, Bill Farmer, Bruce Fifer, Johnson Flucker, Larry Hansen, Randy Hansen, Mary Ann Hart, Alix Korey, Phyllis Kubey, Herndon Lackey, Sherry Lynn, Mickie McGowan, Larry Moss, Panchali Null, Wilbur Pauley, Jennifer Perito, Caroline Peyton, Patrick Pinney, Cynthia Richards-Hewes, Phil Proctor, Susan Napoli, Gordon Stanley, Stephen Sturk, Brian Harvey, Joe Ranft", "dbpedia_uri": "http://dbpedia.org/resource/Beauty_and_the_Beast_(1987_film)", "dbpedia_label": "Beauty and the Beast (1987 film)"}, {"movielens_id": "597", "imdb_id": "0116213", "title": "Eraser", "plot": "A Witness Protection specialist becomes suspicious of his co-workers when dealing with a case involving high-tech weapons.", "genres": "Action, Drama, Thriller", "year": "1996", "rating": "6.1", "directors": "Chuck Russell", "cast": "Arnold Schwarzenegger, James Caan, Vanessa Williams, James Coburn, Robert Pastorelli, James Cromwell, Danny Nucci, Andy Romano, Nick Chinlund, Michael Papajohn, Joe Viterelli, Mark Rolston, John Slattery, Robert Miranda, Roma Maffia, Tony Longo, Gerry Becker, John Snyder, Melora Walters, Olek Krupa, Cylk Cozart, K. Todd Freeman, Rocco Sisto, Gerald Berns, Steven Ford, Ismael 'East' Carlo, Tommy J. Huff, Rick Batalla, Michael Gregory, Patrick Kilpatrick, James Short, A.J. Nay, Camryn Manheim, Skipp Sudduth, Anthony Fusco, Gregory McKinney, Craig Barnett, Corey Joshua Taylor, Rick Marzan, Brian Libby, Danny Wynands, David Fonteno, Sonny King, Edward Rote, Mike Cameron, Tim Colceri, Dieter R. Trippel, Matthew Mahaney, Denis Forest, Christopher Mankiewicz, Michael Stone, Kevin Fry, Sam Scarber, Richie Varga, Diana Morgan, Ben Shenkman, Dominic Marcus, Pat Collins, Dorin Seymour, Clayton Landey, Terry Beeman, M.G. Gong, Sebastian La Cause, Frank Minitello, Charles Chiquette, Glenndon Chatman, Camille Winbush, Vic Polizos, James Frank Clark, David Bilson, Al Cerullo, Rick Shuster, Frank Arcuri, Tom Billett, Jenny Inge Devaney, Mischa Hausserman, Patricia Holihan, Bruce Holman, Tom Lupo, Dave Mallow, David Novak, James Rekart, Sven-Ole Thorsen, Dan Warner", "dbpedia_uri": "http://dbpedia.org/resource/Eraser_(film)", "dbpedia_label": "Eraser (film)"}, {"movielens_id": "607", "imdb_id": "0032976", "title": "Rebecca", "plot": "A self-conscious woman juggles adjusting to her new role as an aristocrat's wife and avoiding being intimidated by his first wife's spectral presence.", "genres": "Drama, Mystery, Romance, Thriller", "year": "1940", "rating": "8.1", "directors": "Alfred Hitchcock", "cast": "Laurence Olivier, Joan Fontaine, George Sanders, Judith Anderson, Nigel Bruce, Reginald Denny, C. Aubrey Smith, Gladys Cooper, Florence Bates, Melville Cooper, Leo G. Carroll, Leonard Carey, Lumsden Hare, Edward Fielding, Philip Winter, Forrester Harvey, Bunny Beatty, Billy Bevan, Egon Brecher, Gino Corrado, Alfred Hitchcock, Leyland Hodgson, Alphonse Martell, William H. O'Brien, Ronald R. Rondell, Phyllis Woodward", "dbpedia_uri": "http://dbpedia.org/resource/Rebecca_(1940_film)", "dbpedia_label": "Rebecca (1940 film)"}, {"movielens_id": "611", "imdb_id": "0037008", "title": "Laura", "plot": "A police detective falls in love with the woman whose murder he is investigating.", "genres": "Drama, Film-Noir, Mystery", "year": "1944", "rating": "8.0", "directors": "Otto Preminger", "cast": "Gene Tierney, Dana Andrews, Clifton Webb, Vincent Price, Judith Anderson, Grant Mitchell, Dorothy Adams, Terry Adams, John Alban, Wally Albright, Bobby Barber, Edward Biby, Gary Breckner, James Carlisle, Harry Carter, Lane Chandler, Bill Chaney, Dorothy Christy, James Conaty, Kay Connors, John Dexter, Ralph Dunn, Nestor Eristoff, Jean Fenwick, Mary Field, Clyde Fillmore, James Flavin, Bess Flowers, Lee Tong Foo, William Forrest, Frances Gladwin, William Graeff Jr., Beatrice Gray, Sam Harris, Kathleen Howard, Yolanda Lacca, Frank LaRue, Kay Linaker, Gloria Marlen, Thomas Martin, Dominick Martino, Buster Miles, Harold Miller, Hans Moebus, Lew Morphy, Forbes Murray, Jane Nigh, Wedgwood Nowell, Paul Power, Aileen Pringle, Greg Rhinelander, Cyril Ring, Alexander Sascha, Harold Schlickenmayer, Scott Seaton, Larry Steers, Harry Strang, Ben Watson, Cara Williams, Eric Wilton", "dbpedia_uri": "http://dbpedia.org/resource/Laura_(1944_film)", "dbpedia_label": "Laura (1944 film)"}, {"movielens_id": "627", "imdb_id": "0102798", "title": "Robin Hood: Prince of Thieves", "plot": "When Robin and his Moorish companion come to England and the tyranny of the Sheriff of Nottingham, he decides to fight back as an outlaw.", "genres": "Action, Adventure, Drama, Romance", "year": "1991", "rating": "6.9", "directors": "Kevin Reynolds", "cast": "Kevin Costner, Morgan Freeman, Mary Elizabeth Mastrantonio, Christian Slater, Alan Rickman, Geraldine McEwan, Michael McShane, Brian Blessed, Michael Wincott, Nick Brimble, Soo Drouet, Daniel Newman, Daniel Peacock, Walter Sparrow, Harold Innocent, Jack Wild, Michael Goldie, Liam Halligan, Marc Zuber, Merelina Kendall, Imogen Bain, Jimmy Gardner, Bobby Parr, John H. Francis, John Hallam, Douglas Blackwell, Pat Roach, Andy Hockley, John Dallimore, Derek Deadman, Howard Lew Lewis, John Tordoff, Andrew Lawden, Susannah Corbett, Sarah Alexandra, Christopher Adamson, Richard Strange, Bryan Adams, Behrooz Afrakhan, David Bowles, Kenneth W Caravan, Jon Church-Fraser, Sean Connery, Mickey Curry, Alexander Hall, Larry Klein, Lucien Morgan, Bill Payne, Derek Pykett, Neil Riddaway, Graham Riddell, Keith Scott, John Simpkin, Mark Thomason, Fred Wood", "dbpedia_uri": "http://dbpedia.org/resource/Robin_Hood:_Prince_of_Thieves", "dbpedia_label": "Robin Hood: Prince of Thieves"}, {"movielens_id": "628", "imdb_id": "0117665", "title": "Sleepers", "plot": "After a prank goes disastrously wrong, a group of boys are sent to a detention center where they are brutalized. Thirteen years later, an unexpected random encounter with a former guard gives them a chance for revenge.", "genres": "Crime, Drama, Thriller", "year": "1996", "rating": "7.6", "directors": "Barry Levinson", "cast": "Kevin Bacon, Billy Crudup, Robert De Niro, Ron Eldard, Minnie Driver, Vittorio Gassman, Dustin Hoffman, Terry Kinney, Bruno Kirby, Frank Medrano, Jason Patric, Joe Perrino, Brad Pitt, Brad Renfro, Geoffrey Wigdor, Jonathan Tucker, Peter Appel, Joseph Attanasio, Gerry Becker, Casandra Brooks, William K. Butler, Eugene Byrd, Rose Caiola, Pasquale Cajano, Robert W. Castle, John Di Benedetto, Jeffrey Donovan, Drew Eliot, Reuben Larry Elliot, George Georgiadis, Marco Greco, Saverio Guerra, Don Hewitt, Ben Hammer, Paul Herman, Frank Inzerillo, Lennie Loftin, Chuck Low, Peter Mahoney, Ruth Maleczech, Juan Maria Jr., Danny Mastrogiorgio, Mary B. McCann, Pat McNamara, Peter McRobbie, Conrad Meertins Jr., Gina Menza, Dash Mihok, Michael P. Moran, Rocco Musacchia, Mick O'Rourke, Carmine Parisi, James Pickens Jr., Wendell Pierce, Salvatore Paul Piro, Monica Polito, Angela Rago, Sean Patrick Reilly, Peter Rini, Larry Romano, Gayle Scott, Tom Signorelli, John Slattery, Henry Stram, Ralph Tabakin, Mary Testa, Jenique Torres, Patrick Tull, Aida Turturro, Joe Urla, Zachary Ansley, Michael J. Burg, Maria Deasy, Brian Donahue, Peter Gerety, Carlo Giuliano, Justin Halliwell, Michael Harkins, Matthew Hoffman, Billy Malone, James Rosin, Todo Segalla, Anthony Sinopoli, Barry Squitieri, Kevin Richard Sullivan, George Vincent", "dbpedia_uri": "http://dbpedia.org/resource/Sleepers_(film)", "dbpedia_label": "Sleepers (film)"}, {"movielens_id": "641", "imdb_id": "0050825", "title": "Paths of Glory", "plot": "After refusing to attack an enemy position, a general accuses the soldiers of cowardice and their commanding officer must defend them.", "genres": "Drama, War", "year": "1957", "rating": "8.4", "directors": "Stanley Kubrick", "cast": "Kirk Douglas, Ralph Meeker, Adolphe Menjou, George Macready, Wayne Morris, Richard Anderson, Joe Turkel, Christiane Kubrick, Jerry Hausner, Peter Capell, Emile Meyer, Bert Freed, Kem Dibbs, Timothy Carey, Fred Bell, John Stein, Harold Benedict, Leon Briggs, Paul Bös, Herbert Ellis, Wally Friedrichs, Halder Hanson, James B. Harris, Rolf Kralovitz, Ira Moore, Marshall Rainer, Roger Vagnoid", "dbpedia_uri": "http://dbpedia.org/resource/Paths_of_Glory", "dbpedia_label": "Paths of Glory"}, {"movielens_id": "650", "imdb_id": "0050976", "title": "The Seventh Seal", "plot": "A man seeks answers about life, death, and the existence of God as he plays chess against the Grim Reaper during the Black Plague.", "genres": "Drama, Fantasy, History, Thriller", "year": "1957", "rating": "8.2", "directors": "Ingmar Bergman", "cast": "Gunnar Björnstrand, Bengt Ekerot, Nils Poppe, Max von Sydow, Bibi Andersson, Inga Gill, Maud Hansson, Inga Landgré, Gunnel Lindblom, Bertil Anderberg, Anders Ek, Åke Fridell, Gunnar Olsson, Erik Strandmark, Siv Aleros, Sten Ardenstam, Harry Asklund, Benkt-Åke Benktsson, Catherine Berg, Lena Bergman, Tor Borong, Gudrun Brost, Bengt Gillberg, Lars Granberg, Gunlög Hagberg, Gun Hammargren, Tor Isedal, Ulf Johansson, Tommy Karlsson, Uno Larsson, Lennart Lilja, Lars Lind, Monica Lindman, Gordon Löwenadler, Mona Malm, Josef Norman, Gösta Prüzelius, Helge Sjökvist, Georg Skarstedt, Marc Smith, Ragnar Sörman, Fritjof Tall, Lennart Tollén, Nils Whiten, Caya Wickström, Karl Widh", "dbpedia_uri": "http://dbpedia.org/resource/The_Seventh_Seal", "dbpedia_label": "The Seventh Seal"}, {"movielens_id": "651", "imdb_id": "0097441", "title": "Glory", "plot": "'Robert Gould Shaw' (qv) leads the U.S. Civil War's first all-black volunteer company, fighting prejudices from both his own Union Army, and the Confederates.", "genres": "Biography, Drama, History, War", "year": "1989", "rating": "7.8", "directors": "Edward Zwick", "cast": "Matthew Broderick, Denzel Washington, Cary Elwes, Morgan Freeman, Jihmi Kennedy, Andre Braugher, John Finn, Donovan Leitch Jr., JD Cullum, Alan North, Bob Gunton, Cliff De Young, Christian Baskous, RonReaco Lee, Jay O. Sanders, Richard Riehle, Daniel Jenkins, Michael Guess, Abdul Salaam El Razzac, Peter Michael Goetz, Pete Munro, Benji Wilhoite, Ethan Phillips, Mark A. Levy, Randell Haynes, Afemo Omilami, Keith Noble, Dan Biggers, Marc Gowan, Raymond Godshall Jr., Bob Minor, Joan Riordan, Saundra Dunson-Franks, Mark A. Jones, Peter Grandfield, Mark Margolis, Paul Desmond, Tom Barrington, Michael Fowler, Richard Wright, Joseph Alex, Jane Alexander, Frank Blair, Carla Brothers, Bill Chemerka, Sheila Cochran, Gary O. Crane, Rachel Lea Grundfast, Kevin R. Hershberger, Kevin Jarre, Jay Lance, Rick Leisenring, William Mathis, Barry J. Miller, Matthew Murdzak, Bill Nunn, Larry Peterson, Shane Pinson, Alejandro de Quesada, Roger Ragland, Ted Rupel, Raymond St. Jacques, Michael Wayne Thomas, Rodger Williamson", "dbpedia_uri": "http://dbpedia.org/resource/Glory_(1989_film)", "dbpedia_label": "Glory (1989 film)"}, {"movielens_id": "655", "imdb_id": "0092005", "title": "Stand by Me", "plot": "After the death of one of his friends, a writer recounts a childhood journey with his friends to find the body of a missing boy.", "genres": "Adventure, Drama", "year": "1986", "rating": "8.1", "directors": "Rob Reiner", "cast": "Wil Wheaton, River Phoenix, Corey Feldman, Jerry O'Connell, Kiefer Sutherland, Casey Siemaszko, Gary Riley, Bradley Gregg, Jason Oliver Lipsett, Marshall Bell, Frances Lee McCain, Bruce Kirby, William Bronder, Scott Beach, Richard Dreyfuss, John Cusack, Madeleine Swift, Popeye, Geanette Bobst, Art Burke, Matt Williams, Andy Lindberg, Dick Durock, O.B. Babbs, Charlie Owens, Kenneth Hodges, John Hodges, Susan Thorpe, Korey Scott Pollard, Rick Elliott, Kent W. Luttrell, Chance Quinn, Jason Naylor, Sky Siewerski", "dbpedia_uri": "http://dbpedia.org/resource/Stand_by_Me_(film)", "dbpedia_label": "Stand by Me (film)"}, {"movielens_id": "660", "imdb_id": "0101921", "title": "Fried Green Tomatoes", "plot": "A housewife who is unhappy with her life befriends an old lady in a nursing home and is enthralled by the tales she tells of people she used to know.", "genres": "Drama", "year": "1991", "rating": "7.7", "directors": "Jon Avnet", "cast": "Kathy Bates, Mary Stuart Masterson, Mary-Louise Parker, Jessica Tandy, Cicely Tyson, Chris O'Donnell, Stan Shaw, Gailard Sartain, Timothy Scott, Gary Basaraba, Lois Smith, Jo Harvey Allen, Macon McCalman, Richard Riehle, Raynor Scheine, Grace Zabriskie, Reid Binion, Afton Smith, Danny Nelson, Nancy Moore Atchison, Constance Shulman, Nick Searcy, Haynes Brooke, Ginny Parker, Tres Holton, Ronald McCall, Wallace Merck, David Dwyer, Lashondra Phillips, Kathy Larson, Missy Wolff, LaTanya Richardson Jackson, Grayson Fricke, Enjolik Oree, Genevieve Fisher, Tom Even, Bob Hannah, Ted Manson, Carol Mitchell-Leon, Evan Lockwood, Suzi Bass, Paul Armbruster, Jacob Avnet, Michael Burgess, Todd Eller, Bill Ewin, Fannie Flagg, Shelby Hofer, Barry Hopkins, Teretha G. Houston, James Mayberry, Shannon McCrory, Bob Penny, Leonard Shinew, Drew Wilkins, Marion Williams", "dbpedia_uri": "http://dbpedia.org/resource/Fried_Green_Tomatoes", "dbpedia_label": "Fried Green Tomatoes"}, {"movielens_id": "675", "imdb_id": "0013442", "title": "Nosferatu", "plot": "Vampire Count Orlok expresses interest in a new residence and real estate agent Hutter's wife.", "genres": "Fantasy, Horror", "year": "1922", "rating": "7.9", "directors": "F.W. Murnau", "cast": "Max Schreck, Gustav von Wangenheim, Greta Schröder, Georg H. Schnell, Ruth Landshoff, Gustav Botz, Alexander Granach, John Gottowt, Max Nemetz, Wolfgang Heinz, Albert Venohr, Eric van Viele, Karl Etlinger, Guido Herzfeld, Hans Lanser-Rudolf, Loni Nest, Josef Sareny, Fanny Schreck, Hardy von Francois, Heinrich Witte", "dbpedia_uri": "http://dbpedia.org/resource/Nosferatu", "dbpedia_label": "Nosferatu"}, {"movielens_id": "680", "imdb_id": "0119484", "title": "Kull the Conqueror", "plot": "A barbarian warrior becomes a king when he defeats a king in armed combat and the king's heir conspire to overthrow him and reclaim the throne by resurrecting an evil sorceress.", "genres": "Action, Adventure, Fantasy", "year": "1997", "rating": "4.9", "directors": "John Nicolella", "cast": "Kevin Sorbo, Tia Carrere, Thomas Ian Griffith, Litefoot, Roy Brocksmith, Harvey Fierstein, Karina Lombard, Edward Tudor-Pole, Douglas Henshall, Joe Shaw, Sven-Ole Thorsen, Terry O'Neill, Pat Roach, John Hallam, Peter Petruna, Boris Bacik, Paul Kynman, Paul Weston", "dbpedia_uri": "http://dbpedia.org/resource/Kull_the_Conqueror", "dbpedia_label": "Kull the Conqueror"}, {"movielens_id": "685", "imdb_id": "0116253", "title": "Executive Decision", "plot": "When terrorists seize control of an airliner, an intelligence analyst accompanies a commando unit for a midair boarding operation.", "genres": "Action, Adventure, Thriller", "year": "1996", "rating": "6.4", "directors": "Stuart Baird", "cast": "Kurt Russell, Steven Seagal, Halle Berry, John Leguizamo, Oliver Platt, Joe Morton, David Suchet, BD Wong, Len Cariou, Whip Hubley, Andreas Katsulas, Mary Ellen Trainor, Marla Maples, J.T. Walsh, Ingo Neuhaus, William James Jones, Paul Collins, Nicholas Pryor, Stanley Grover, Eugene Roche, Ken Jenkins, Charles Hallahan, Dey Young, Richard Riehle, Robert Apisa, Granville Hatcher, Christopher Maher, Jay Tavare, Ahmed Ahmed, Shaun Toub, Majed Ibrahim, Jon Huertas, Joey Naber, Ray Baker, Michael Milhoan, Julie Wright, Sunni Boswell, Gregg Artz, Will Schaub, Yvonne Zima, Marianne Muellerleile, Brad Blaisdell, Don Fischer, John Rixey Moore, Warren Munson, Lance August, Maggie Egan, James C. Victor, Tim Kelleher, David Birznieks, Paul Bollen, Nick Jameson, Juan Fernández, Todd Jeffries, Joe Cook, Ilia Volok, Blair Valk, Joseph Makkar, Damon Lee, Magdalene St. Michaels, Robert Londberg, Edmond Brown, Michelle Boudreau, Kurt Kohler, Anna Carolina Alvim, Sayed Badreya, Greg Bronson, Craig E. Dunn, Monica Huntington, Jaime Irizarry, Casey Lowe, Dana Schick, Scott D. Stewart", "dbpedia_uri": "http://dbpedia.org/resource/Executive_Decision", "dbpedia_label": "Executive Decision"}, {"movielens_id": "696", "imdb_id": "0115907", "title": "City Hall", "plot": "The accidental shooting of a boy in New York leads to an investigation by the Deputy Mayor, and unexpectedly far-reaching consequences.", "genres": "Drama, Thriller", "year": "1996", "rating": "6.2", "directors": "Harold Becker", "cast": "Al Pacino, John Cusack, Bridget Fonda, Danny Aiello, Martin Landau, David Paymer, Anthony Franciosa, Richard Schiff, Lindsay Duncan, Nestor Serrano, Mel Winkler, Luna Lauren Velez, Chloe Morris, Ian Quinlan, Roberta Peters, Angel David, Larry Romano, Rob LaBelle, Ray Aranha, Jaliyl Lynn, John C. Vennema, Steve Aronson, Jerome X. O'Donovan, Mark Lonow, Murphy Guyer, John Finn, Richard Gant, Tamara Tunie, Fran Brill, Brian Murray, John Slattery, Benny Nieves, Miguel Sierra, Sylvia Kauders, Brenda Thomas, Gerry Vichi, Ernest F. Hollings, Jordan Baker, Leonard Chapman, Tony Capone, Jennifer Prescott, Joseph A. Kelly, Harry Bugin, Ron L. Cox, Kaity Tong, Amy Atkins, Brenda Pressley, Michael O'Looney, Carl White, Mary Murphy, Justin Ashforth, Charles Gemmill, Gina Rice, Roma Torre, Jack Cafferty, Lewis Dodley, Ed Koch, Stanley Anderson, Sally Mayes, Lucia Mendoza, Geoffrey Wade, Gloria K. Smith, James F. Gainer, David Wenzel, Alex Ballar, Sedly Bloomfield, Michael Carrara, Gloria Cuomo, Mary L. Davis, Nancy Duerr, Brian Ferrari, Harrison Freed, Philippe Hartmann, Dorinda Katz, Kent Klineman, Marshall Dancing Elk Lucas, Michael Luceri, Michael Luggio, Doris McCarthy, Frances Mignano, Romano Mosca, Chris Place, Joseph C. Reyes, Michelle Rouhani, Andrew D. Schwartz, Ralph A. Villani, John Haynes Walker", "dbpedia_uri": "http://dbpedia.org/resource/City_Hall_(film)", "dbpedia_label": "City Hall (film)"}, {"movielens_id": "699", "imdb_id": "0110367", "title": "Little Women", "plot": "The March sisters live and grow in post-Civil War America.", "genres": "Drama, Family, Romance", "year": "1994", "rating": "7.3", "directors": "Gillian Armstrong", "cast": "Winona Ryder, Gabriel Byrne, Trini Alvarado, Samantha Mathis, Kirsten Dunst, Claire Danes, Christian Bale, Eric Stoltz, John Neville, Mary Wickes, Susan Sarandon, Florence Paterson, Robin Collins, Corrie Clark, Rebecca Toolan, Curt Willington, Billie Pleffer, Louella Pleffer, Janne Mortil, Sarah Strange, Ahnee Boyce, Michele Goodger, Marco Roy, A.J. Unger, Janie Woods-Morris, Patricia Leith, Christine Lippa, Kristina West, Nicole Babuick, Jenna Percy, Alan Robertson, Mar Andersons, Cameron Labine, Matthew Walker, Bethoe Shirkoff, Marilyn Norry, Andrea Libman, Tegan Moss, Janet Craig, Beverley Elliott, James Leard, Charles Baird, Jay Brazeau, Demetri Goritsas, Kate Robbins, David Adams, Donal Logue, Scott Bellis, John Shaw, Irene Miscisco, Peter Haworth, Natalie Friisdahl, Kristy Friisdahl, Bryan Finn, Sean Finn, Eric Bruno Borgman, Mark Marriott, Donald Mitchell, Daniel Olsen, Dale Resteghini, Jerry Robbins, Colette Savage", "dbpedia_uri": "http://dbpedia.org/resource/Little_Women_(1994_film)", "dbpedia_label": "Little Women (1994 film)"}, {"movielens_id": "705", "imdb_id": "0045152", "title": "Singin' in the Rain", "plot": "A silent film production company and cast make a difficult transition to sound.", "genres": "Comedy, Musical, Romance", "year": "1952", "rating": "8.3", "directors": "Stanley Donen, Gene Kelly", "cast": "Gene Kelly, Donald O'Connor, Debbie Reynolds, Jean Hagen, Millard Mitchell, Cyd Charisse, Douglas Fowley, Rita Moreno, Dawn Addams, John Albright, Betty Allen, Sue Allen, John Angelo, Marie Ardell, Bette Arlen, David Bair, Jimmy Bates, Mary Bayless, Marcella Becker, Margaret Bert, Madge Blake, Lulu Mae Bohrman, Gail Bonney, Chet Brandenburg, Tex Brodus, Barbara Carroll, Gwen Carter, Bill Chatham, Lyle Clark, Mae Clarke, Dorinda Clifton, Harry Cody, Chick Collins, Pat Conway, Jeanne Coyne, Ruby C. Currie, Fred Datig Jr., Bert Davidson, Robert Dayo, Gloria Dea, Patricia Denise, Harry Denny, Kay Deslys, John Dodsworth, King Donovan, Michael Dugan, Phil Dunham, Helen Eby-Rock, Marietta Elliott, Richard Emory, Betty Erbes, Charles Evans, Luigi Faccuito, Tommy Farrell, Don Fields, Ernie Flatt, Bess Flowers, George Ford, Robert Fortier, Dan Foster, Robert Foulk, Clair Freeman, Kathleen Freeman, Lance Fuller, Doris Fulton, Jeanne Gail, Glen Gallagher, Jon Gardner, Diane Garrett, Jack George, John George, Kenneth Gibson, Shirley Glickman, Mickey Golden, Inez Gorman, A. Cameron Grant, Beatrice Gray, Marion Gray, Robert Haines, William Hamel, Betty Hannon, Sam Harris, Jean Harrison, Timmy Hawkins, Jack Hendricks, Lars Hensen, Dean Henson, Jean Heremans, Stuart Holmes, Joyce Horne, Don Hulbert, Frank Hyers, Patricia Jackson, Ivor James, Morgan Jones, David Kasday, Jan Kayne, Jimmy Kelly, Kenner G. Kemp, Mike Lally, Judy Landon, Joi Lansing, Janet Lavis, Virginia Lee, Meredith Leeds, William F. Leicester, Peggy Leon, Diki Lerner, Bill Lewin, Sylvia Lewis, King Lockwood, John Logan, Leon Lontoc, Shirley Lopez, Leota Lorraine, Joan Maloney, Paul Maxey, Dorothy McCarty, Ann McCrea, Philo McCullough, Ray McDonald, Johnny McGovern, Joseph Mell, Sheila Meyers, Wade Miller, Carl Milletaire, Gloria Moore, Marilyn Moore, Forbes Murray, Peggy Murray, Sally Musick, Anne Neyland, Ruth Packard, Dorothy Patrick, Allen Pinson, 'Snub' Pollard, Angi O. Poulos, George Reeder, Charles Regan, Shirley Jean Rickert, Joanne Rio, Joel Robinson, Joette Robinson, Tony Rocke, Victor Romito, Dennis Ross, Paul Salata, Cosmo Sardo, Audrey Saunders, Russell Saunders, William Schallert, Phil Schumacher, Betty Scott, David Sharpe, Bert Spencer, Elaine Stewart, Ben Strobach, Brick Sullivan, Allen Sutherland, Julius Tannen, Harry Tenbrook, Beverly Thomas, Beverly Thompson, Jimmy Thompson, Dee Turnell, Lana Turner, Dorothy Tuttle, Tyra Vaughn, Pat Walker, Tommy Walker, Audrey Washburn, Bobby Watson, Camille Williams, Chalky Williams, Robert B. Williams, Wilson Wood, Adam York, Norma Zimmer", "dbpedia_uri": "http://dbpedia.org/resource/Singin'_in_the_Rain", "dbpedia_label": "Singin' in the Rain"}, {"movielens_id": "717", "imdb_id": "0116731", "title": "The Juror", "plot": "A juror in a Mafia trial is forced to convince the other jurors to vote not guilty by an obsessive mob enforcer.", "genres": "Crime, Drama, Thriller", "year": "1996", "rating": "5.7", "directors": "Brian Gibson", "cast": "Demi Moore, Alec Baldwin, Joseph Gordon-Levitt, James Gandolfini, Lindsay Crouse, Anne Heche, Tony Lo Bianco, Michael Constantine, Matt Craven, Todd Susman, Michael Rispoli, Julie Halston, Frank Adonis, Matthew Cowles, Polly Adams, Jack Gilpin, Chuck Cooper, Charle Landry, Tom Signorelli, Frances Foster, Robin Moseley, Rosemary De Angelis, Joe Perrino, James McCauley, William Hill, Randy Jurgensen, Chuck Zito, Steve Santosusso, Peter Rini, Gayle Scott, Gary R. Wordham, Anne Bobby, Fiona Gallagher, Luisa Huertas, Daniel Martínez, Melissa Murray-Mutch, Brett Barsky, Denise Burse, Jose Senteno, Kalani Queypo, Alejandro García, Rauol Morales, Marco Quazzo, Jose Jara, Al Cerullo, Robert Covarrubias, Andy Davoli, Marilyn Dobrin, John Louis Fischer, Carlo Giuliano, Philippe Hartmann, Kent Klineman, Dori Rosenthal, Ben Ryan, Todo Segalla, Eddie Sicoli", "dbpedia_uri": "http://dbpedia.org/resource/The_Juror", "dbpedia_label": "The Juror"}, {"movielens_id": "720", "imdb_id": "0113071", "title": "First Knight", "plot": "Lancelot falls in love with Guinevere, who is due to be married to King Arthur. Meanwhile, a violent warlord tries to seize power from Arthur and his Knights of the Round Table.", "genres": "Action, Adventure, Drama, Romance", "year": "1995", "rating": "6.0", "directors": "Jerry Zucker", "cast": "Sean Connery, Richard Gere, Julia Ormond, Ben Cross, Liam Cunningham, Christopher Villiers, Valentine Pelka, Colin McCormack, Ralph Ineson, John Gielgud, Stuart Bunce, Jane Robbins, Jean Marie Coffey, Paul Kynman, Tom Lucy, John Blakey, Robert Gwyn Davin, Sean Blowers, Alexis Denisof, Daniel Naprous, Jonathan Cake, Paul Bentall, Jonty Miller, Rose Keegan, Mark Ryan, Jeffery Dench, Neville Phillips, Oliver Lewis, Wolf Christian, Angus Wright, Jonathan Jaynes, Eric Stone, Ryan Todd, Albie Woodington, Richard Claxton, Dido Miles, Michael Hodgson, Susannah Corbett, Susan Breslau, Kate Zucker, Bob Zucker, Charlotte Zucker, Burton Zucker, Charlotte Barwick, Sacha Bennett, Rob Brydon, Kenneth W Caravan, Simon Collins, Rick  Davy, Michael Dickins, Tim Faraday, Harry Fielder, Owain Griffiths, Jonathan Hackett, Martin Herdman, Bernard Hill, Leslie Maier, Richard Nunn, Richard Bellamy Nunn, Derek Pykett, Antonio Rochira, Tony Rycyk, Guy Standeven", "dbpedia_uri": "http://dbpedia.org/resource/First_Knight", "dbpedia_label": "First Knight"}, {"movielens_id": "732", "imdb_id": "0106673", "title": "Dave", "plot": "An uncanny Presidential lookalike named _Dave_ (qv) is recruited by the Secret Service to become a momentary stand-in for the President of the United States.", "genres": "Comedy, Romance", "year": "1993", "rating": "6.8", "directors": "Ivan Reitman", "cast": "Kevin Kline, Sigourney Weaver, Frank Langella, Kevin Dunn, Ving Rhames, Ben Kingsley, Charles Grodin, Faith Prince, Laura Linney, Bonnie Hunt, Parley Baer, Stefan Gierasch, Anna Deavere Smith, Charles Hallahan, Tom Dugan, Alba Oms, Steve Witting, Kellen Sampson, Lexie Bigham, Frederic W. Barnes, Ronald Brownstein, Eleanor Clift, Chris Dodd, Tom Harkin, Bernard Kalb, Larry King, Michael Kinsley, Morton Kondracke, Jay Leno, Frank Mankiewicz, Chris Matthews, John McLaughlin, Howard Metzenbaum, Abner J. Mikva, Robert D. Novak, Tip O'Neill, Richard Reeves, Arnold Schwarzenegger, Paul Simon, Alan Simpson, Ben Stein, Oliver Stone, Kathleen Sullivan, Jeff Tackett, Helen Thomas, Nina Totenberg, Sander Vanocur, John Yang, Stephen Root, Catherine Reitman, Dawn Arnemann, Marianna Harris, Sarah Marshall, Ralph Manza, George Martin, Laurie Franks, Tom Kurlander, Dendrie Taylor, Joe Kuroda, Geneviève Robert, Jason Reitman, Ruth Goldway, Frank Birney, Paul Collins, Peter White, Robin Gammell, Heather Hewitt, Gary Ross, Jeff Joseph, Bonnie Bartlett, Robert Walsh, William Pitts, Dan Butler, Wendy Gordon, Ben Patrick Johnson, Steve Kmetko, Bob Bergen, Tom Bysiek, Tory Christopher, Dave Droge, F. Pierre Gatling, Dalton Gray, Ryal Haakenson, T.J. Jones, Kirk Jordan, Mary Kircher, Aaron Michael Lacey, Keith Lewis, Melissa S. Markess, Michael Noel, Pam Pruitt-McGeary, William Shipman, Paul Speaks, Debbie Tsamoudakis, Sam Wells", "dbpedia_uri": "http://dbpedia.org/resource/Dave_(film)", "dbpedia_label": "Dave (film)"}, {"movielens_id": "738", "imdb_id": "0111418", "title": "Threesome", "plot": "A girl named Alex is by mistake housed with 2 guys, Stuart and Eddy, in a college dorm suite. After initial problems they become friends. Stuart has the hots for Alex, Alex for Eddy and Eddy for Stuart. Can it work?", "genres": "Comedy, Drama, Romance", "year": "1994", "rating": "6.3", "directors": "Andrew Fleming", "cast": "Lara Flynn Boyle, Stephen Baldwin, Josh Charles, Alexis Arquette, Martha Gehman, Mark Arnold, Michele Matheson, Joanne Baron, Jennifer Lawler, Jack Breschard, Jillian Johns, Amy Ferioli, Jason Workman, Katherine Kousi, Kathleen Beaton, Anna Marie O'Donnell, Mike Breyer, Michael Haboush, Mary Ann Schmidt", "dbpedia_uri": "http://dbpedia.org/resource/Threesome_(film)", "dbpedia_label": "Threesome (film)"}, {"movielens_id": "742", "imdb_id": "0117438", "title": "Ransom", "plot": "Multi-millionaire Tom Mullen's son is kidnapped, but after initially agreeing to pay the ransom Mullen then decides to use the ransom money as a bounty.", "genres": "Action, Crime, Thriller", "year": "1996", "rating": "6.7", "directors": "Ron Howard", "cast": "Mel Gibson, Rene Russo, Brawley Nolte, Gary Sinise, Delroy Lindo, Lili Taylor, Liev Schreiber, Donnie Wahlberg, Evan Handler, Nancy Ticotin, Michael Gaston, Kevin Neil McCready, Paul Guilfoyle, Allen Bernstein, José Zúñiga, Dan Hedaya, Iraida Polanco, John Ortiz, Mike Hodge, Paul Geier, Louisa Marie, Edward Francis Joseph, A.J. Benza, Peter Anthony Tambakis, Tony Hoty, Daniel May Wong, John Short, Ed Jupp Jr., Stephen Oates, Gene Harrison, Mick O'Rourke, Henry Kingi Jr., Roy Farfel, Lex D. Geddings, Donna Hanover, Rosanna Scotto, Tony Potts, John Finnerty, Todd Hallowell, Joe Bacino, Carl S. Redding, James Georgiades, Christian Maelen, David Vadim, Addie O'Donnell, Judy Hudson, Mitzie Pratt, Lynne Redding, Michael Countryman, Chris Lopata, John Hartmann, Anton Evangelista, Richard Price, Joseph Badalucco Jr., Dell Maara, Tommy Allen, John Dorish, Vincent J. Burns, Brad Brewer, Darren Brown, Marvin Brown, Glenn King, Cheryl Howard, James Ritz, Anna Marie Wieder, Joan D. Lowry, Craig Castaldo, Teodorina Bello, Jane Jenkins, Lori Tan Chinn, Carl Don, Nathaniel Freeman, Phil Parolisi, Rafael Osorio, Leslie Devlin, Lewis Dodley, John Brian Rogers, Jeffrey H. Kaufman, Mark Smith, James Patrick Whalen Sr., Kim Snyder, Panicker Upendran, Eric Attio, Steve Axelrod, Carl Burrows, Glenn J. Cohen, Gregory D'Angelo, Cynthia Daddona, Brian Donahue, Jeff Eigen, Todd Ellison, Philippe Hartmann, Toree Hill, Marshall Dancing Elk Lucas, Rawleigh Moreland, Christopher Tracy, Keith Leon Williams, Robert 'Bobby Z' Zajonc", "dbpedia_uri": "http://dbpedia.org/resource/Ransom!", "dbpedia_label": "Ransom!"}, {"movielens_id": "747", "imdb_id": "0106387", "title": "Benny & Joon", "plot": "A mentally ill young woman finds her love in an eccentric man who models himself after 'Buster Keaton' (qv).", "genres": "Comedy, Drama, Romance", "year": "1993", "rating": "7.2", "directors": "Jeremiah S. Chechik", "cast": "Johnny Depp, Mary Stuart Masterson, Aidan Quinn, Julianne Moore, Oliver Platt, CCH Pounder, Dan Hedaya, Joe Grifasi, William H. Macy, Liane Curtis, Eileen Ryan, Don Hamilton, Waldo Larson, Irvin Johnson, Shane Nilsson, Leslie Laursen, Faye Killebrew, Ramsin Amirkhas, Lynette Walden, Amy Alizabeth Sanford, Brian Keevy, John Grant Phillips, Tony Lincoln, Noon Orsatti, Dan Kamin, Gregory Cook, Aaron Haedt", "dbpedia_uri": "http://dbpedia.org/resource/Benny_&_Joon", "dbpedia_label": "Benny & Joon"}, {"movielens_id": "751", "imdb_id": "0120347", "title": "Tomorrow Never Dies", "plot": "James Bond sets out to stop a media mogul's plan to induce war between China and the UK in order to obtain exclusive global media coverage.", "genres": "Action, Adventure, Thriller", "year": "1997", "rating": "6.5", "directors": "Roger Spottiswoode", "cast": "Pierce Brosnan, Jonathan Pryce, Michelle Yeoh, Teri Hatcher, Ricky Jay, Götz Otto, Joe Don Baker, Vincent Schiavelli, Judi Dench, Desmond Llewelyn, Samantha Bond, Colin Salmon, Geoffrey Palmer, Julian Fellowes, Terence Rigby, Cecilie Thomsen, Nina Young, Daphne Deckers, Colin Stinton, Al Matthews, Mark Spalding, Bruce Alexander, Anthony Green, Christopher Bowen, Andrew Hawkins, Dominic Shaun, Julian Rhind-Tutt, Gerard Butler, Adam Barker, Michael Byrne, Pip Torrens, Hugh Bonneville, Jason Watkins, Eoin McCarthy, Brendan Coyle, David Ashton, William Scott-Masson, Laura Brattan, Nadia Cameron-Blakey, Liza Ross, Hugo Napier, Rolf Saxon, Vincent Wang, Phillip Chung-Fung Kwok, Nichola McAuliffe, Minna Aaltonen, Khan Bonfils, Ian Boo Khoo, Kacee DeMasi, Neil Finnighan, Romo Gorrara, Jeff Harding, Aidan Harrington, Anja Jensen, Kinue Kato, Stefan Kopiecki, Theo Kypri, Anthony Maddalena, Choy-Ling Man, Dennis Matsuki, Terence Plummer, Dinny Powell, Alex Reid, Terry Richards, Curtis Rivers, Antje Schmidt, Sophie Schütt, Sherry Stone, Rocky Taylor, Nicholas Whittingham, Michael G. Wilson", "dbpedia_uri": "http://dbpedia.org/resource/Tomorrow_Never_Dies", "dbpedia_label": "Tomorrow Never Dies"}, {"movielens_id": "763", "imdb_id": "0116483", "title": "Happy Gilmore", "plot": "A rejected hockey player puts his skills to the golf course to save his grandmother's house.", "genres": "Comedy, Sport", "year": "1996", "rating": "7.0", "directors": "Dennis Dugan", "cast": "Adam Sandler, Christopher McDonald, Julie Bowen, Frances Bay, Carl Weathers, Allen Covert, Robert Smigel, Bob Barker, Richard Kiel, Dennis Dugan, Joe Flaherty, Lee Trevino, Kevin Nealon, Verne Lundquist, Jared Van Snellenberg, Ken Camroux-Taylor, Rich Elwood, Nancy Hillis, Helena Yea, Will Sasso, Dee Jay Jackson, Ellie Harvie, Ian Boothby, Andrew Johnston, Kim Restell, Fred Perron, Helen Honeywell, Paul Raskin, William Samples, John Shaw, Ted Deekan, John Destry, James Crescenzo, Brett Armstrong, Peter Kelamis, Stephen Tibbetts, Ed Lieberman, Donnie MacMillan, Louis O'Donoghue, Lisanne Collett, Stephen Dimopoulos, Douglas Newell, Frank L. Frazier, David Kaye, Zachary Webb, Simon Webb, Mark Lye, Betty Linde, Dave Cameron, Louis Kliman, Brent Chapman, Jessica Gunn, Phillip Beer, Fat Jack, Michelle Holdsworth, Charles L. Brame, Valarie Trapp, Mark Falvo, Carrie Anne Fleming, Jack Giarraputo, Adam Khedheri, Brennan Kotowich, Donna Le Tourneau, Michael Roberds, Joe Sakic, Ben Stiller, Heath Young", "dbpedia_uri": "http://dbpedia.org/resource/Happy_Gilmore", "dbpedia_label": "Happy Gilmore"}, {"movielens_id": "777", "imdb_id": "0112643", "title": "Castle Freak", "plot": "A man struggles to save his family from the strange and deadly occurrences in the castle they've inherited.", "genres": "Drama, Horror, Mystery, Thriller", "year": "1995", "rating": "6.0", "directors": "Stuart Gordon", "cast": "Jeffrey Combs, Barbara Crampton, Jonathan Fuller, Jessica Dollarhide, Massimo Sarchielli, Elisabeth Kaza, Luca Zingaretti, Helen Stirling, Alessandro Sebastian Satta, Raffaella Offidani, Marco Stefanelli, Tunny Piras, Rolando Cortegiani, Carolyn Purdy-Gordon, Suzanna Gordon, Jillian Gordon, Margaret Gordon, Michael Todd", "dbpedia_uri": "http://dbpedia.org/resource/Castle_Freak", "dbpedia_label": "Castle Freak"}, {"movielens_id": "787", "imdb_id": "0114296", "title": "Roommates", "plot": "An elderly yet young-at-heart man moves in with his grandson and both their lives turn upside-down.", "genres": "Comedy, Drama", "year": "1995", "rating": "6.4", "directors": "Peter Yates", "cast": "Peter Falk, D.B. Sweeney, Julianne Moore, Ellen Burstyn, Jan Rubes, Joyce Reehling, Ernie Sabella, John Cunningham, Noah Fleiss, Lisa Davis, Rohn Thomas, Karl Mackey, Zygmund Szarnicki, Lee Alan McConnell, David Cutter, David Tom, Lillian Misko-Coury, Kate Young, Noah Abrams, Ilana Levine, Scott Cohen, Pattie Carlson, Adrienne Wodenka, Daniel Corbin Cox, Joel de la Fuente, Raymond Wong, Wanqing Wu, Zhe Sun, Mengze Shi, Ann Heekin, Scott Klace, Vicki Ross-Norris, Frankie Faison, Peter Klemens, Donald R. Wilson, Ron Jaye, Courtney Chase, Ryan Kelley, Kate Rogal, Willard Scott, Bernard Canepari, Dorothy Silver, Rosa Gamarra-Thomson, Gerry Becker, Nelle Stokes, Mary Marini, Robert S. Gardner, Robert Dyga, Jeff Howell, Tony Amen, John E. Blazier, Pat Cauley, Jesse Iwanonkiw, John W. Iwanonkiw, A.J. Laird, William H. Macy, Phil Nardozzi, Eric Porvaznik, Keith Schrader", "dbpedia_uri": "http://dbpedia.org/resource/Roommates_(1995_film)", "dbpedia_label": "Roommates (1995 film)"}, {"movielens_id": "789", "imdb_id": "0114594", "title": "Swimming with Sharks", "plot": "A young, naive Hollywood studio assistant finally turns the tables on his incredibly abusive producer boss.", "genres": "Comedy, Crime", "year": "1994", "rating": "7.1", "directors": "George Huang", "cast": "Kevin Spacey, Frank Whaley, Michelle Forbes, Benicio Del Toro, T.E. Russell, Roy Dotrice, Matthew Flint, Patrick Fischler, Jerry Levine, Sabryn Genet, Kyle Reed", "dbpedia_uri": "http://dbpedia.org/resource/Swimming_with_Sharks", "dbpedia_label": "Swimming with Sharks"}, {"movielens_id": "792", "imdb_id": "0109348", "title": "Bullets Over Broadway", "plot": "In New York in 1928, a struggling playwright is forced to cast a mobster's talentless girlfriend in his latest drama in order to get it produced.", "genres": "Comedy, Crime", "year": "1994", "rating": "7.4", "directors": "Woody Allen", "cast": "John Cusack, Dianne Wiest, Jennifer Tilly, Chazz Palminteri, Mary-Louise Parker, Jack Warden, Joe Viterelli, Rob Reiner, Tracey Ullman, Jim Broadbent, Harvey Fierstein, Stacey Nelkin, Malgorzata Zajaczkowska, Charles Cragin, Nina von Arx, Edie Falco, Hope W. Sacharoff, Debi Mazar, Brian McConnachie, Tony Sirico, Victor Colicchio, Louis Eppolito, Gene Canfield, Peter Castellotti, Tony Conforti, John Di Benedetto, John Ventimiglia, Lisa Arturo, Rachel Black Spaulding, Alison Cramer, Kelly Groninger, Jennifer Lamberts, Carol Lee Meadows, Jo Telford, Meghan Strange, Leigh Torlage, Debra Wiseman, Paul Herman, James Reno, Gerald Edward Dolezar, Shannah Laumeister Stern, Fran McGee, Annie Joe Edwards, Kernan Bell, Nick Iacovino, Frank Aquilino, Sohrab Ardeshir, Molly Regan, Phil Stein, John Doumanian, Dayle Haddon, Tony Darrow, Howard Erskine, Benay Venuta, Ken Roberts, Jennifer Van Dyck, Peter McRobbie, José Alvarez, John Hoyt, Jeff Mazzola, Bruce Roberts, Patty Sherman, Rick Washburn", "dbpedia_uri": "http://dbpedia.org/resource/Bullets_Over_Broadway", "dbpedia_label": "Bullets Over Broadway"}, {"movielens_id": "796", "imdb_id": "0111256", "title": "Speechless", "plot": "Two political speechwriters fall in love before they find out they are working for candidates on opposite sides.", "genres": "Comedy, Romance", "year": "1994", "rating": "5.8", "directors": "Ron Underwood", "cast": "Michael Keaton, Geena Davis, Christopher Reeve, Bonnie Bedelia, Ernie Hudson, Charles Martin Smith, Gailard Sartain, Ray Baker, Mitchell Ryan, Willie Garson, Paul Lazar, Richard Poe, Harry Shearer, Steven Wright, Jodi Carlisle, Cynthia Mace, Steve Gonzales, Robin Pearson Rose, David Cromwell, Marques Johnson, Frank DiElsi, Peter Mackenzie, Tim Perez, John Graney, Yasmine Abdul-Wahid, Mickey Cottrell, Cris Franco, Brad Blaisdell, Richard McGonagle, Michelle Holden, Tony Genaro, Loyda Ramos, Brendon Chad, Joan Stuart Morris, Brian John McMillan, Mary Pat Gleason, Rob LaBelle, Janette Andrade, Greg Bronson, Jon Favreau, Kristy Gottlob, Khris Kaneff, Tanit Lee Lascelles, Paul McMichael, Heather Medway, James 'JR' Pollard, Richard Schiff, Paul Speaks", "dbpedia_uri": "http://dbpedia.org/resource/Speechless_(film)", "dbpedia_label": "Speechless (film)"}, {"movielens_id": "836", "imdb_id": "0031725", "title": "Ninotchka", "plot": "A stern Russian woman sent to Paris on official business finds herself attracted to a man who represents everything she is supposed to detest.", "genres": "Comedy, Romance", "year": "1939", "rating": "7.9", "directors": "Ernst Lubitsch", "cast": "Greta Garbo, Melvyn Douglas, Ina Claire, Bela Lugosi, Sig Ruman, Felix Bressart, Alexander Granach, Gregory Gaye, Rolfe Sedan, Edwin Maxwell, Richard Carle, Dorothy Adams, Monya Andre, Nino Bellini, Wilda Bennett, Eumenio Blanco, Symona Boniface, Frederika Brown, Emilie Cabanne, Gino Corrado, George Davis, Paul Ellis, Harry Evans, Fred Farrell, Frank Fletcher, Bess Flowers, Charles Fogel, Mary Forbes, Rudy Frohlich, Jody Gilbert, George Golden, Dick Gordon, Herschel Graham, Lawrence Grant, Jennifer Gray, Winifred Harris, Ray Hendricks, William Irving, Hans Joby, Charles Judels, Armand Kaliz, Max Linder, Leota Lorraine, Ernst Lubitsch, Hans Moebus, Peggy Moran, Sandra Morgan, Lucille Pinson, Albert Pollet, Frank Reicher, Constantine Romanoff, Alexander Schoenberg, Harry Semels, Tamara Shayne, Florence Shirley, George Sorel, Edwin Stanley, Count Stefenelli, Kay Stewart, George Tobias, Jacques Vanaire, Ellinor Vanderveer, Paul Weigel, Elizabeth Williams, Marek Windheim, Wolfgang Zilzer", "dbpedia_uri": "http://dbpedia.org/resource/Ninotchka", "dbpedia_label": "Ninotchka"}, {"movielens_id": "846", "imdb_id": "0117924", "title": "To Gillian on Her 37th Birthday", "plot": "David's wife died 2 years ago. He, his teen daughter Rachel, her cute friend and 2 in-laws trying to fix him up with a friend, are all spending the weekend at his beach house. David still \"talks to his wife\" and neglects Rachel.", "genres": "Drama, Fantasy, Romance", "year": "1996", "rating": "5.8", "directors": "Michael Pressman", "cast": "Peter Gallagher, Michelle Pfeiffer, Claire Danes, Laurie Fortier, Wendy Crewson, Bruce Altman, Kathy Baker, Freddie Prinze Jr., Rachel Seidman-Lockamy, Lorielle New, Danny Crook, Seth Green, Todd Haven, Matt Mosher, J Schaefer", "dbpedia_uri": "http://dbpedia.org/resource/To_Gillian_on_Her_37th_Birthday", "dbpedia_label": "To Gillian on Her 37th Birthday"}, {"movielens_id": "851", "imdb_id": "0060304", "title": "2 or 3 Things I Know About Her", "plot": "A day in the life of a Parisian housewife/prostitute, interspersed with musings on the Vietnam War and other contemporary issues.", "genres": "Comedy, Drama", "year": "1967", "rating": "6.8", "directors": "Jean-Luc Godard", "cast": "Marina Vlady, Anny Duperey, Roger Montsoret, Raoul Lévy, Jean Narboni, Yves Beneyton, Juliet Berto, Helena Bielicic, Christophe Bourseiller, Marie Bourseiller, Marie Cardinal, Robert Chevassu, Joseph Gehrard, Jean-Luc Godard, Blandine Jeanson, Benjamin Jules-Rosette, Jean-Pierre Laverne, Jean-Patrick Lebel, Anna Manga, Claude Miller, Hélène Scott", "dbpedia_uri": "http://dbpedia.org/resource/Two_or_Three_Things_I_Know_About_Her", "dbpedia_label": "Two or Three Things I Know About Her"}, {"movielens_id": "854", "imdb_id": "0092610", "title": "Bad Taste", "plot": "The population of a small town disappears and is replaced by aliens that chase human flesh for their intergalactic fast-food chain.", "genres": "Comedy, Horror, Sci-Fi", "year": "1987", "rating": "6.6", "directors": "Peter Jackson", "cast": "Terry Potter, Pete O'Herne, Craig Smith, Mike Minett, Peter Jackson, Doug Wren, Dean Lawrie, Peter Vere-Jones, Ken Hammon, Robin Griggs, Michael Gooch, Peter Gooch, Laurie Yarrall, Shane Yarrall, Philip Lamey, Costa Botes, Graham Butcher, Bob Haliburton, Andrew McKay, Clive Haywood, John McTavish, John Nelson, Graham Nesbitt, Steven Smith, John Logan Jr., Matt Noonan, Cameron Chittock, Ray Battersby, Mike Appleby, Peter Appleby, Michael Kane, Robert Johnston, Scott Bradshaw, Mark Lamey, Giles Forrest, Grant Taylor, Carol Taylor, Dean Taylor, Kim Taylor, Dave Hamilton, Jock Fyfe, Tony Hiles, John Ruby, Kerry Underhill, Robin Watene, Garry A. Brown, Mark Jackson, Peter Henderson, Janine Riely, Margaret Byford", "dbpedia_uri": "http://dbpedia.org/resource/Bad_Taste", "dbpedia_label": "Bad Taste"}, {"movielens_id": "855", "imdb_id": "0082269", "title": "Diva", "plot": "Two tapes, two Parisian mob killers, one corrupt policeman, an opera fan, a teenage thief, and the coolest philosopher ever filmed all twist their way through an intricate and stylish French-language thriller.", "genres": "Music, Thriller", "year": "1981", "rating": "7.2", "directors": "Jean-Jacques Beineix", "cast": "Wilhelmenia Fernandez, Frédéric Andréi, Richard Bohringer, Thuy An Luu, Jacques Fabbri, Chantal Deruaz, Anny Romand, Roland Bertin, Gérard Darmon, Dominique Pinon, Jean-Jacques Moreau, Patrick Floersheim, Raymond Aquilon, Eugène Berthier, Gérard Chaillou, Andrée Champeaux, Nathalie Dalyan, Laurence Darpy, Michel Debrane, Etienne Draber, Laure Duthilleul, Nane Germon, Gabriel Gobin, Jim Adhi Limas, Louise Malapert, Dimo Mally, Vaneta Mally, Alain Marcel, Isabelle Mergault, Marthe Moudiki-Moreau, Jean-Luc Porraz, Robyn Bernard, Yann Roussel, Brigitte Lahaie, Jean-Louis Vitrac, Tania Zabaloieff, Dominique Besnehard, Vladimir Cosma", "dbpedia_uri": "http://dbpedia.org/resource/Diva_(1981_film)", "dbpedia_label": "Diva (1981 film)"}, {"movielens_id": "864", "imdb_id": "0117119", "title": "My Fellow Americans", "plot": "Two former U. S. Presidents, hated rivals, join forces to expose the current, corrupt President at the risk of their lives.", "genres": "Adventure, Comedy", "year": "1996", "rating": "6.5", "directors": "Peter Segal", "cast": "Jack Lemmon, James Garner, Dan Aykroyd, John Heard, Wilford Brimley, Lauren Bacall, Sela Ward, Everett McGill, Bradley Whitford, James Rebhorn, Esther Rolle, Conchata Ferrell, Jack Kehler, Connie Ray, Tom Everett, Mark Lowenthal, Jeff Yagher, Edwin Newman, Lynn Clark, Leigh Rose, Mihoko Tokoro, Ken Enomoto, Gunnar Peterson, Scott Burkholder, Wayne Duvall, Jack Garner, Gene Boland, Francesca Rollins, Paul Feig, Cathy Ladman, Tom Wright, Dana Gould, Scott Hoxby, Jonathan Osser, Mitch Braswell, E. Arthur Booth, Steve Carlisle, Todd McDurmont, Madison Wellington, David Malloy, Jennifer Leigh Jones, Rob Roy Fitzgerald, Jennifer Austin, Bobby Bass, Steven Chambers, Jimmy Nickerson, Cara Gooden, Matthew R. Zboyovski, Michael Peña, Alex Joganic, Ocie Pouncie, Neva Howell, Sheri Mann Stewart, Pete Penuel, John O'Leary, Leighanne Littrell, Rick Hall, Eric Siegel, Ann Cusack, Jean Speegle Howard, Dorothy Lucey, Jeff Mandon, Jim Bissell, Shawn D. Woodyard, Steve Wedan, Tom Sean Foley, Michael Russo, Christopher Kriesa, William Kerr, Peter Segal, Jeffrey J. Ayers, Greg Bronson, Tory Christopher, Scott Fowler, C. Michael Haynes, Marg Helgenberger, Jan Jackson, Stephen Kelly, Jesse G. Martin, Jennifer L. Ray, Robert Shepherd, Sam P. Whitehead", "dbpedia_uri": "http://dbpedia.org/resource/My_Fellow_Americans", "dbpedia_label": "My Fellow Americans"}, {"movielens_id": "887", "imdb_id": "0119080", "title": "Eve's Bayou", "plot": "What did little Eve see--and how will it haunt her? Husband, father and womanizer Louis Batiste is the head of an affluent family, but it's the women who rule this gothic world of secrets, lies and mystic forces.", "genres": "Drama", "year": "1997", "rating": "7.3", "directors": "Kasi Lemmons", "cast": "Jurnee Smollett, Meagan Good, Lynn Whitfield, Samuel L. Jackson, Debbi Morgan, Jake Smollett, Ethel Ayler, Diahann Carroll, Vondie Curtis-Hall, Roger Guenveur Smith, Lisa Nicole Carson, Branford Marsalis, Afonda Colbert, Lola Dalferes, Marcus Lyle Brown, Alverta Perkins Dunigan, Ron Flagge, Sharon K. London, Carol Sutton, Victoria Rowell, Oneal A. Isaac, Julian Dalcour, Leonard L. Thomas, Allen Toussaint, Billie Neal, Tamara Tunie, 2Meka Diaz, Beaux Sedwick, Greta Valenti", "dbpedia_uri": "http://dbpedia.org/resource/Eve's_Bayou", "dbpedia_label": "Eve's Bayou"}, {"movielens_id": "899", "imdb_id": "0120521", "title": "The Winter Guest", "plot": "A recent widow, who is determined to leave Scotland for Australia with her son, gets an unexpected visit from her aging mother.", "genres": "Drama", "year": "1997", "rating": "6.9", "directors": "Alan Rickman", "cast": "Phyllida Law, Emma Thompson, Sheila Reid, Sandra Voe, Arlene Cockburn, Gary Hollywood, Sean Biggerstaff, Douglas Murphy, Tom Watson, Jan Shand, Sandy Neilson, Billy McElhaney, Helen Devon, Harry Welsh, Christian Zanone, Ross Lewis, Alan Rickman", "dbpedia_uri": "http://dbpedia.org/resource/The_Winter_Guest", "dbpedia_label": "The Winter Guest"}, {"movielens_id": "903", "imdb_id": "0118566", "title": "Afterglow", "plot": "A handyman with marital problems meets a housewife with the same.", "genres": "Comedy, Drama, Romance", "year": "1997", "rating": "6.1", "directors": "Alan Rudolph", "cast": "Nick Nolte, Julie Christie, Lara Flynn Boyle, Jonny Lee Miller, Jay Underwood, Domini Blythe, Yves Corbeil, Alan Fawcett, Michèle-Barbara Pelletier, France Castel, Genevieve Bissonnette, Claudia Besso, Ivan Smith, Ellen David, Don Jordan, Bill Rowat, Cas Anvar, David Francis, John Dunn-Hill, Warren 'Slim' Williams, Jean-François Sauvageau, Bernard Tanguay, David McKeown, Vanya Rose, Mark Camacho, Amy Kadawaki, Salvatore Agostino, Pierre Gaudette, Serge Martineau, Houston Wong", "dbpedia_uri": "http://dbpedia.org/resource/Afterglow_(film)", "dbpedia_label": "Afterglow (film)"}, {"movielens_id": "921", "imdb_id": "0106332", "title": "Farewell My Concubine", "plot": "Two boys meet at an opera training school in Peking in 1924. Their resulting friendship will span nearly 70 years and will endure some of the most troublesome times in China's history.", "genres": "Drama, Music, Romance", "year": "1993", "rating": "8.1", "directors": "Kaige Chen", "cast": "Leslie Cheung, Fengyi Zhang, Gong Li, You Ge, Da Ying, Qi Lü, Han Lei, Di Tong, Zhi Yin, Mingwei Ma, Hailong Zhao, Yang Fei, Dan Li, Yongchao Yang, Fei Huang, Wenli Jiang, Yitong Zhi, Chun Li, David Wu", "dbpedia_uri": "http://dbpedia.org/resource/Farewell_My_Concubine_(film)", "dbpedia_label": "Farewell My Concubine (film)"}, {"movielens_id": "926", "imdb_id": "0116130", "title": "Down Periscope", "plot": "Lt. Cmdr. Tom Dodge is assigned as Captain to the USS Stingray, an old diesel driven submarine that has seen better days.", "genres": "Comedy", "year": "1996", "rating": "6.2", "directors": "David S. Ward", "cast": "Kelsey Grammer, Lauren Holly, Rob Schneider, Harry Dean Stanton, Bruce Dern, William H. Macy, Ken Hudson Campbell, Toby Huss, Duane Martin, Jonathan Penner, Bradford Tatum, Harland Williams, Rip Torn, James Martin Jr., Jordan Marder, Matt Landers, Joseph Latimore, Patton Oswalt, Joe Soto, John Shepherd, Pierrino Mascarino, Dennis Fimple, Ancel Cook, James Harper, Rudy Hornish, Tommy Terrell, Elliot Easton, Michael Connors, Paul Tranghese, Mitchell R. Danton, Jackson Sleet, Annie Talbot, Eugene Daniel, Bob Dini, Andrew Christian English, Steve Giralo, Robert Grochau, Jamie James, Joseph Keawkalaya, Todd Odom, Eric Anzalone, Brandon Ladd Burkey, Bruce Holman, Michael Koster, Danny Nero, Felipe Rose, Timothy D. Rossi, Theodore Carl Soderberg, Adrian Tafoya, Gary Tang, Gabrielle Wagner, Tirralan Watkins, Richard Yett", "dbpedia_uri": "http://dbpedia.org/resource/Down_Periscope", "dbpedia_label": "Down Periscope"}, {"movielens_id": "931", "imdb_id": "0116654", "title": "The Island of Dr. Moreau", "plot": "After being rescued and brought to an island, a man discovers that its inhabitants are experimental animals being turned into strange-looking humans, all of it the work of a visionary doctor.", "genres": "Horror, Sci-Fi, Thriller", "year": "1996", "rating": "4.5", "directors": "John Frankenheimer, Richard Stanley", "cast": "Marlon Brando, Val Kilmer, David Thewlis, Fairuza Balk, Daniel Rigney, Temuera Morrison, Nelson de la Rosa, Peter Elliott, Mark Dacascos, Ron Perlman, Marco Hofschneider, Miguel López, Neil Young, David Hudson, Clare Grant, Kitty Silver, Fiona Mahl, William Hootkins, Agoes Widjaya Soedjarwo, Ron Vreeken, Lou Horvath, Morgan Smallbone, Richard Stanley, Frank Welker", "dbpedia_uri": "http://dbpedia.org/resource/The_Island_of_Dr._Moreau_(1996_film)", "dbpedia_label": "The Island of Dr. Moreau (1996 film)"}, {"movielens_id": "934", "imdb_id": "0117372", "title": "The Preacher's Wife", "plot": "An angel comes to Earth to help a preacher save his church and his family.", "genres": "Comedy, Drama, Fantasy, Romance", "year": "1996", "rating": "5.6", "directors": "Penny Marshall", "cast": "Denzel Washington, Whitney Houston, Courtney B. Vance, Gregory Hines, Jenifer Lewis, Loretta Devine, Justin Pierre Edmund, Lionel Richie, Paul Bates, Lex Monson, Darvel Davis Jr., William James Stiggers Jr., Marcella Lowery, Cissy Houston, Aaron A. McConnaughey, Shyheim Franklin, Taral Hicks, Kennan Scott, Jernard Burks, Michael Alexander Jackson, Jamie Tirelli, Shari Headley, Lizan Mitchell, Robert Colston, Victor Williams, Juliehera Destefano, Charlotte d'Amboise, Delores Mitchell, David Langston Smyrl, Harsh Nayyar, Mervyn Warren, Roy Haynes, George Coleman, Ted Dunbar, Jamil Nasser, Helmar Augustus Cooper, Mary Bond Davis, Toukie Smith, Mozelle Hawkins Allen, Eloise Beasley, Yolanda Beasley-Prime, Cassondra M. Breedlove, Dirk Chaney, Brenda J. Childs, Anthony Dean Copeland, Hayward Cromartie, Betty Cromartie Davis, Valerie Inez Edwards, Kimberley M. Garrett, Rutha Harris, Carolyn Henry, Gary Nuckles-Holt, Teretha G. Houston, Angela L. Jones, Morris Vernon Jones, Rose Merry Jordan, Jacqueline Martin, Betty Matthews, Corey McGee, Naguanda Miller, Sharon A. Mitchell, Beverly S. Nixon, Krishna Presha, Jacqulyn V. Saunders, Constance Small, Troy L. Sneed Jr., Lawrence K. Thomas, Ulisa A. Thomas, V. Ranaldo Welcome, Berta J. Williams, Kimberly L. Wright, Steven Brown, Rick Carter, Sterling Holloman II, Kenneth Paden, Dwain L. White, Aaron Jordan, Yakin Manassah Jordan, Joshua Jordan, Tiffany Joseph, Jessica Malloy, Amia Hart, Tania McDonald-Tomlinson, Christopher Malloy, Andal Fequiere, Mark Gilbert, Michael Marshall, Shaun Purefoy, Tiffiny Monet Graham, Khalia Hamilton-Montoute, Marquis Bowen-Wallace, Lakeya Enos, Christine Lameisha Koon, Anthony Biggham, Taleah Enos, Jerry Brunsin, Anthony Burnett, Kevin Mitchell, Phillip Mitchell, Adam Alexi-Malle, Debbie Benitez, Anibal O. Lleras, David Madison, John Rowe Jr., Derrick Simmons, Ronald Sylvers", "dbpedia_uri": "http://dbpedia.org/resource/The_Preacher's_Wife", "dbpedia_label": "The Preacher's Wife"}, {"movielens_id": "939", "imdb_id": "0113870", "title": "Murder in the First", "plot": "An eager and idealistic young attorney defends an Alcatraz prisoner accused of murdering a fellow inmate. The extenuating circumstances: his client had just spent over three years in solitary confinement.", "genres": "Drama, Thriller", "year": "1995", "rating": "7.3", "directors": "Marc Rocco", "cast": "Christian Slater, Kevin Bacon, Gary Oldman, Embeth Davidtz, William H. Macy, Stephen Tobolowsky, Brad Dourif, R. Lee Ermey, Mia Kirshner, Ben Slack, Stefan Gierasch, Kyra Sedgwick, Alex Bookston, Richie Allan, Herb Ritts, Charles Boswell, David Michael Sterling, Michael Melvin, George Maguire, Nick Scoggin, Douglas Bennett, Joseph Richards, Julius Varnado, Tony Barr, Stuart Nisbet, Gary Ballard, Randy Pelish, Neil Summers, Sonny King, Eddie Bowz, Brian Leckner, Time Winters, James Keane, Lance Brady, Michael Merrins, Ray Quartermus, Lee Mathis, Wayne Parks, Warren Spottswood, Thomas Fenske, Robert Lee, Sheldon Feldner, Fred Franklin, Danny Kovacs, Joseph Lucas, William Hall, Bill Barretta, Randall Dudley, Wally Rose, Amanda Borden, Eve Brenner, Joseph Cole, Richard Kwong, Gary Lee Davis, Paul Abbaszadeh, Mel Allen, Cabran E. Chamberlain, Bundy Chanock, Tory Christopher, William Cleere, Annie Coffey, Sean Coffey, James Anthony Cotton, Charles Cyphers, Mike Ferrante, Laird Macintosh, Mary Mackey, Daniel Mandehr, Theo Mayes, Dennis Pappalardo, Douglas W. Randall, Bob Shuttleworth, Rafael Siegel, Joseph Quinn Simpkins, James A. Swan, Nicole Vigil, Erick Vinther, Ryken Zane", "dbpedia_uri": "http://dbpedia.org/resource/Murder_in_the_First", "dbpedia_label": "Murder in the First"}, {"movielens_id": "958", "imdb_id": "0110081", "title": "To Live", "plot": "After Fugui and Jiazhen lose their personal fortunes, they raise a family and survive difficult cultural changes during 1940s to 1970s China.", "genres": "Drama, War", "year": "1994", "rating": "8.3", "directors": "Yimou Zhang", "cast": "You Ge, Gong Li, Ben Niu, Wu Jiang, Deng Fei, Tao Guo, Tianchi Liu, Zongluo Huang, Yanjin Liu, Dahong Ni, Lian-Yi Li, Cong Xiao, Lu Zhang, Yan Su", "dbpedia_uri": "http://dbpedia.org/resource/To_Live_(film)", "dbpedia_label": "To Live (film)"}, {"movielens_id": "1008", "imdb_id": "0116594", "title": "I Shot Andy Warhol", "plot": "This is the story of Valerie Solanas who was a 60s radical preaching hatred toward men in her \"Scum\" manifesto. She wrote a screenplay for a film that she wanted Andy Warhol to produce. After many times of ignoring her, Valerie shot him.", "genres": "Biography, Drama", "year": "1996", "rating": "6.6", "directors": "Mary Harron", "cast": "Lili Taylor, Jared Harris, Martha Plimpton, Lothaire Bluteau, Anna Thomson, Peter Friedman, Tahnee Welch, Jamie Harrold, Donovan Leitch Jr., Michael Imperioli, Reg Rogers, Bill Sage, Jill Hennessy, Coco McPherson, Myriam Cyr, Danny Morgenstern, Lola Pashalinski, Lynn Cohen, Craig Chester, Stephen Dorff, James Lyons, Lorraine Farris, Victor Browne, Billy Erb, Kevin Rendon, Caroline Benezet-Brown, Anh Duong, Massimo Audiello, Christina McKay, Eugenie Vincent, Georgia Hubley, Ira Kaplan, James McNew, Tara Key, Mark Margolis, Dawn Didawick, Faith Geer, Jeff Webster, Henry Cabot Beck, Christopher Cook, Edoardo Ballerini, Gabriel Mann, Marian Quinn, John Ventimiglia, Fenton Lawless, Laura Ekstrand, Michelle Hurst, Michael Stumm, Justin Theroux, Eric Mabius, Isabel Gillies, Davis Hall, Paco Juanas, Steve Itkin, Bill Lin, Debbon Ayer, Anna Grace, Daniel Haughey, Joel Arandia, Curt Hayward, Rebecca Kramer, Marshall Dancing Elk Lucas, Vincent J. Mazella, Jennifer Miro, Charles Nassif, Gina Priano, Bruce Smolanoff, Dean Sponsele, Stan Tracy", "dbpedia_uri": "http://dbpedia.org/resource/I_Shot_Andy_Warhol", "dbpedia_label": "I Shot Andy Warhol"}, {"movielens_id": "1017", "imdb_id": "0117958", "title": "Trees Lounge", "plot": "Tommy is an unemployed mechanic who spends most of his time in a bar (_Trees Lounge_ (qv)) in a small blue collar town. He seems to always be thinking, \"If only X then I could stop drinking\".", "genres": "Comedy, Drama", "year": "1996", "rating": "7.1", "directors": "Steve Buscemi", "cast": "Carol Kane, Mark Boone Junior, Steve Buscemi, Bronson Dudley, Anthony LaPaglia, Michael Buscemi, Elizabeth Bracco, John Ventimiglia, Steven Randazzo, Suzanne Shepherd, Rockets Redglare, Joe Lisi, Debi Mazar, Eszter Balint, Richard Boes, Brooke Smith, Carina Finn, Seymour Cassel, Michael Storms, Irma St. Paule, Kevin Corrigan, Annette Arnold, Michael Imperioli, Daniella Rich, Marilyn Chris, Victor Arnold, Chloë Sevigny, Christine Gildea, Marissa Lanzello, Roberta Hanley, Samuel L. Jackson, Lawrence Gilliard Jr., Io Tillett Wright, Daniel Baldwin, Mimi Rogers, Lucian Buscemi, Bianca Hunter, Charlie Newmark, Thomas J. Churchill, Catherine Natale", "dbpedia_uri": "http://dbpedia.org/resource/Trees_Lounge", "dbpedia_label": "Trees Lounge"}, {"movielens_id": "1037", "imdb_id": "0084021", "title": "Grease 2", "plot": "A British student at a 1960s American high school must prove himself to the leader of a girls' gang whose members can only date greasers.", "genres": "Comedy, Drama, Musical, Romance", "year": "1982", "rating": "4.4", "directors": "Patricia Birch", "cast": "Maxwell Caulfield, Michelle Pfeiffer, Lorna Luft, Maureen Teefy, Alison Price, Pamela Adlon, Adrian Zmed, Peter Frechette, Christopher McDonald, Leif Green, Didi Conn, Eve Arden, Sid Caesar, Dody Goodman, Tab Hunter, Dick Patterson, Connie Stevens, Eddie Deezen, Matt Lattanzi, Jean Sagal, Liz Sagal, Dennis Stewart, Brad Jeffries, Vernon Scott, Steve M. Davison, Richard Epper, Pat Green, Freddie Hice, Steve Holladay, Gary Hymes, Michael Runyard, Scott Wilder, Helena Andreyko, Ivy Austin, Lucinda Dickey, Sandra Gray, Vicki Hunter, Donna King, Evelyn Tosi, Dallace Winkler, Dennis Daniels, John Robert Garrett, Bernard Hiller, Roy Luthringer, Charles McGowan, Aurelio Padrón, Andy Tennant, Tom Villard, John Allee, Hillary Carlip, Frank Clark, William N. Clark, Ty Crowley, David Daniel, Michael DiMente, Michael David Eilert, Mary Ann Hay, Janet Jones, Jenifer Newman, Stan Rodarte, USC Trojan Marching Band, Manny Weltman, Tom Willett", "dbpedia_uri": "http://dbpedia.org/resource/Grease_2", "dbpedia_label": "Grease 2"}, {"movielens_id": "1047", "imdb_id": "0117108", "title": "Multiplicity", "plot": "A man who never has enough time for the things he wants to do is offered the opportunity to have himself duplicated.", "genres": "Comedy, Romance, Sci-Fi", "year": "1996", "rating": "6.1", "directors": "Harold Ramis", "cast": "Michael Keaton, Andie MacDowell, Zack Duhame, Katie Schlossberg, Harris Yulin, Richard Masur, Eugene Levy, Ann Cusack, John de Lancie, Judith Kahan, Brian Doyle-Murray, Obba Babatundé, Julie Bowen, Dawn Maxey, Kari Coleman, Steven Kampmann, Michael Milhoan, Skip Stellrecht, Jim Piddock, Robin Duke, Suzanne Herrington, Robert Ridgely, Glenn Shadix, Dennis R. Lyell, Richard Plon, Harold Plon, George Wallace, Justine A. Johnston, Jan Citron, Michael Klesic", "dbpedia_uri": "http://dbpedia.org/resource/Multiplicity_(film)", "dbpedia_label": "Multiplicity (film)"}, {"movielens_id": "1054", "imdb_id": "0117102", "title": "Mr. Wrong", "plot": "A lonely single woman finds the seemingly-perfect man to date, but soon regrets it when his deranged, possessive other personality emerges and she cannot convince anyone else of his Jekyll-and-Hyde true nature.", "genres": "Comedy", "year": "1996", "rating": "3.8", "directors": "Nick Castle", "cast": "Ellen DeGeneres, Bill Pullman, Joan Cusack, Dean Stockwell, Joan Plowright, John Livingston, Robert Goulet, Ellen Cleghorne, Hope Davis, Brad William Henke, Christine Cattell, Peter White, Polly Holliday, Briant Wells, Camille Saviola, Maddie Corman, Jonathan Hernandez, Victoria Elena Flores, Louie Anderson, Casey Kasem, Jean Kasem, Hector Elias, Frank Roman, Shea Farrell, Frank Lugo, Johnny Miller, John Cothran, Wayne Alexander, Jamie McGurk, Christopher Kriesa, Frederick Dawson, Gilbert B. Combs, Charlene Castle, Robert Harvey, Mickey Harrison, Jenny Turnham, Ivor Shier, Michael George, Lana McKissack, Chris Moore, Danny Verduzco", "dbpedia_uri": "http://dbpedia.org/resource/Mr._Wrong", "dbpedia_label": "Mr. Wrong"}, {"movielens_id": "1224", "imdb_id": "0111094", "title": "The Scout", "plot": "The story of a baseball scout who discovers a talented but troubled baseball player.", "genres": "Comedy, Drama, Sport", "year": "1994", "rating": "5.4", "directors": "Michael Ritchie", "cast": "Albert Brooks, Brendan Fraser, Dianne Wiest, Anne Twomey, Lane Smith, Michael Rapaport, Barry Shabaka Henley, John Capodice, Art Garfield, Louis Giovannetti, Stephen Demek, Ralph Drischell, Brett Rickaby, Jack Rader, Marcia Rodd, Steve Eastin, Lee Weaver, John LaMotta, Luis Cortés, Chuck Waters, Antonio Lewis Todd, Abel Woolridge, Gabriel Pingarrón, Loló Navarro, Frank Slaten, Charlie Stavola, Jimmy Raitt, Larry Loonin, Harsh Nayyar, J.K. Simmons, Bruce Wright, Steven M. Porter, Josh Clark, Jordan Lage, Chris Willman, Bob Costas, John Roland, George M. Steinbrenner III, Rosanna Scotto, Tony Bennett, Carl White, Bobby Murcer, Steve Garvey, Tim McCarver, Tom Kelly, John B. Sterling, Ken Brett, Bret Saberhagen, Reggie Smith, Keith Hernandez, Roy Firestone, Bob Sheppard, Phil Pote, Bob Tewksbury, Ozzie Smith, Adam Boster, Ernie Charles, Matthew T. Gitkin, Bobby Harwell, John Maczko, Paul Vincent Rapisarda", "dbpedia_uri": "http://dbpedia.org/resource/The_Scout_(film)", "dbpedia_label": "The Scout (film)"}, {"movielens_id": "1406", "imdb_id": "0114916", "title": "When Night Is Falling", "plot": "An uptight and conservative woman, working on tenure as a literacy professor at a large urban university, finds herself strangely attracted to a free-spirited, liberal woman who works at a local carnival that comes to town.", "genres": "Drama, Romance", "year": "1995", "rating": "6.5", "directors": "Patricia Rozema", "cast": "Pascale Bussières, Rachael Crawford, Henry Czerny, David Fox, Don McKellar, Tracy Wright, Clare Coulter, Karyne Steben, Sarah Steben, Jonathan Potts, Tom Melissis, Stuart Clow, Richard W. Farrell, Fides Krucker, Thomas Sokolowski, Ruffian, Jennifer Roblin, Jacqueline Casey, Sigrid Johnson", "dbpedia_uri": "http://dbpedia.org/resource/When_Night_Is_Falling", "dbpedia_label": "When Night Is Falling"}, {"movielens_id": "1639", "imdb_id": "0115600", "title": "Azúcar amarga", "plot": "Gustavo is a young Havana Communist who believes in the revolution; he hopes for a scholarship to study aeronautical engineering in Prague. But his faith in the new Cuba is tested: his father, a psychiatrist, can make four times as much playing piano at a hotel for foreigners; his sweetheart, Yolanda, wants a career as a dancer and longs for the riches of Miami; his younger brother Bobby simply wants to play rock music, and as a result is in constant trouble with the authorities. When Bobby takes a shocking step of revolt and Gustavo is refused service at a foreigners-only bar, the contradictions in his resolve to become a \"new man\" push him to the breaking point.", "genres": "Drama, Romance", "year": "1996", "rating": "7.0", "directors": "Leon Ichaso", "cast": "René Lavan, Mayte Vilán, Miguel Gutiérrez, Larry Villanueva, Luís Celeiro, Teresa Maria Rojas, Orestes Matacena, Caridad Ravelo, Jorge Pupo, Victor Checo, Virgilio Martí, Tony Almont, Félix Germán, Augusto Feria, Alejandro Gonzáles, F.C. Fernandez, Alejandro Galera, Jose Maria Almonte, Danilo Taveras, Nerea Alvarez, Henry Garcia, Victor Ramirez, Marily Gallardo, Mercedes Morales, Soraya Gallardo, Paola Sanchez, Manuela Feliz, Flori Belle Perez, Nelson Eddie Figuero, Jorge Arismendi, Jennifer Gardner, Clemente, Luinis Quezada, Víctor Ramírez, Teo Terrero, Yahaira Florentino", "dbpedia_uri": "http://dbpedia.org/resource/Azúcar_amarga", "dbpedia_label": "Azúcar amarga"}]